[
  {
    "id": "nextfrontiers:scientists develop the worlds first 6g chip capable of 100 g:2025-09-01T17:30:43.000Z",
    "title": "Scientists develop the world's first 6G chip, capable of 100 Gbps speeds",
    "url": "https://techxplore.com/news/2025-09-scientists-world-6g-chip-capable.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T17:30:43.000Z",
    "summary_long": "Sixth generation, or 6G, wireless technology is one step closer to reality with news that Chinese researchers have unveiled the world's first \"all-frequency\" 6G chip. The chip is capable of delivering mobile internet speeds exceeding 100 gigabits per second (Gbps) and was developed by a team led by scientists from Peking University and the City University of Hong Kong. Sixth generation, or 6G, wireless technology is one step closer to reality with news that Chinese researchers have unveiled the world's first \"all-frequency\" 6G chip. The chip is capable of delivering mobile internet speeds exceeding 100 gigabits per second (Gbps) and was developed by a team led by scientists from Peking University and the City University of Hong Kong.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch.…",
    "tags": []
  },
  {
    "id": "nextfrontiers:humanoid robots showcase skills at ancient olympia but theyr:2025-09-01T17:30:25.000Z",
    "title": "Humanoid robots showcase skills at Ancient Olympia. But they're on a long road to catch up to AI",
    "url": "https://techxplore.com/news/2025-09-humanoid-robots-showcase-skills-ancient.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T17:30:25.000Z",
    "summary_long": "With jerky determination, robots played soccer, wowed children with shadow-boxing skills and shot arrows on Monday at the birthplace of the Olympic Games. With jerky determination, robots played soccer, wowed children with shadow-boxing skills and shot arrows on Monday at the birthplace of the Olympic Games.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "consumer:apples mls season pass drops to as low as 25 for the rest of:2025-09-01T17:08:56.000Z",
    "title": "Apple's MLS Season Pass drops to as low as $25 for the rest of 2025",
    "url": "https://www.engadget.com/entertainment/streaming/apples-mls-season-pass-drops-to-as-low-as-25-for-the-rest-of-2025-170855008.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2025-09-01T17:08:56.000Z",
    "summary_long": "The end of any sports season is usually the most exciting part, and MLS fans can watch the climax of the 2025 campaign for a discount. As it has done each year around this time since it locked up the rights to the top North American soccer league, Apple is offering the MLS Season Pass at a discount for the remainder of the season. Apple TV+ subscribers can get access for $25, while everyone else can snag the season pass for $29. This is just the latest MLS Season Pass price cut of 2025, as Apple slashed it in half to $49 in July. However, it's not quite as great a deal as latecomers got on the pass last year. Apple's end-of-season discount for 2024 saw the season pass drop to just $10 in early September. We're now well over halfway through the 2025 season. Teams have between five and nine games of the regular season left to play. Inter…",
    "tags": []
  },
  {
    "id": "fintech:xlm plunges 5 in wild trading session before staging sharp r:2025-09-01T16:27:22.000Z",
    "title": "XLM Plunges 5% in Wild Trading Session Before Staging Sharp Recovery",
    "url": "https://www.coindesk.com/markets/2025/09/01/xlm-plunges-5-in-wild-trading-session-before-staging-sharp-recovery",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-09-01T16:27:22.000Z",
    "summary_long": "Stellar’s native token XLM endured heavy selling pressure over the past 24 hours, trading in a tight but punishing 5% range between $0.34 and $0.36. The session began with relative stability before a late-evening selloff knocked the token from its $0.36 peak to $0.34. Trading volume surged past 57 million units at midnight as the market tested support around the $0.34–$0.35 zone. Buyers stepped back in early the next morning, briefly lifting XLM back to $0.36 on the back of what appeared to be institutional accumulation, with volumes swelling to 70 million units. Despite the recovery, price action stalled around $0.36, creating a range-bound structure that technical traders say often precedes a directional breakout. The final hour of trading on Sept. 1 showed bearish momentum regaining control, with XLM slipping 1% as the consolidation pattern broke down. Intraday data highlighted an acceleration of selling pressure between 13:45 and 13:46, when more than 1.28 million tokens changed hands at the day’s…",
    "tags": []
  },
  {
    "id": "fintech:hbar shares drop 4 as institutional selling intensifies:2025-09-01T16:16:25.000Z",
    "title": "HBAR Shares Drop 4% as Institutional Selling Intensifies",
    "url": "https://www.coindesk.com/markets/2025/09/01/hbar-shares-drop-4-as-institutional-selling-intensifies",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-09-01T16:16:25.000Z",
    "summary_long": "Hedera’s HBAR token faced renewed selling pressure as institutional investors trimmed exposure, pushing the asset down about 4% between Aug. 31 and Sept. 1. Trading activity was concentrated around the $0.22 mark, with intraday swings ranging from $0.23 highs to $0.22 lows. The heaviest selling emerged during after-hours, when more than 110 million tokens exchanged hands, underscoring signs of coordinated divestment. Market makers sought to stabilize the price in the $0.21–$0.22 range, but resistance hardened just above $0.22, capping any meaningful recovery. Despite the downturn, Hedera continues to position itself as a platform for enterprise adoption. Daily trading volume fell 46% to $172.85 million while the network maintained a market capitalization near $9.5 billion. Selling pressure accelerated into the final hour of Sept. 1 trading, when HBAR briefly breached multiple support levels. Roughly 3.5 million tokens changed hands in a single minute as the token slid below its $0.22 resistance, closing the session near its lows. With sellers maintaining control…",
    "tags": []
  },
  {
    "id": "consumer:masterclass labor day sale get 50 percent off subscriptions:2025-09-01T16:01:26.000Z",
    "title": "MasterClass Labor Day sale: Get 50 percent off subscriptions",
    "url": "https://www.engadget.com/deals/masterclass-labor-day-sale-get-50-percent-off-subscriptions-133223226.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-09-01T16:01:26.000Z",
    "summary_long": "MasterClass promises online learning with instructors who are the very best in their fields, and an annual subscription is currently 50 percent off across all tiers. Subscribers to MasterClass will have access to over 200 classes taught by iconic authors, chefs, athletes and leaders representing a diverse collection of skill sets and backgrounds. With a subscription, you could watch a class on writing taught by James Patterson, or learn cooking techniques from Thomas Keller. If you're trying to impress at your next pickup basketball game you could learn about shooting, ball-handling and scoring from Steph Curry. Each class includes around 20 video lessons that run about 10 minutes long on average, as well as an in-depth workbook. MasterClass has also begun producing some original series for its platform. The series Business Rebels features different CEOs walking viewers through the strategies that helped them disrupt their industries. One entitled Skin Health features top dermatologists and a cosmetic chemist walking viewers through…",
    "tags": []
  },
  {
    "id": "bigtech:why runway is eyeing the robotics industry for future revenu:2025-09-01T15:00:00.000Z",
    "title": "Why Runway is eyeing the robotics industry for future revenue growth",
    "url": "https://techcrunch.com/2025/09/01/why-runway-is-eyeing-the-robotics-industry-for-future-revenue-growth/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Rebecca Szkutak",
    "published_at": "2025-09-01T15:00:00.000Z",
    "summary_long": "Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers. Runway is building up a robotics-focused team and fine-tuning its existing models for robotics and self-driving car customers.. Why it matters: highlight the impact on technology, business, or society. Source: techcrunch.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "bigtech:only 5 days left exhibit tables are disappearing for techcru:2025-09-01T15:00:00.000Z",
    "title": "Only 5 days left: Exhibit tables are disappearing for TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/09/01/only-5-days-left-tables-are-disappearing-for-techcrunch-disrupt-2025/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "TechCrunch Events",
    "published_at": "2025-09-01T15:00:00.000Z",
    "summary_long": "Every founder says they want visibility, traction, and growth. But with just 10 tables left and 5 days to grab one, the window to make that happen at TechCrunch Disrupt 2025 is closing fast. Book your table now. Every founder says they want visibility, traction, and growth. But with just 10 tables left and 5 days to grab one, the window to make that happen at TechCrunch Disrupt 2025 is closing fast. Book your table now.. Why it matters: highlight the impact on technology, business, or society. Source: techcrunch.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01.",
    "tags": []
  },
  {
    "id": "design:a breeze of inspiration in september 2025 wallpapers edition:2025-08-31T08:00:00.000Z",
    "title": "A Breeze Of Inspiration In September (2025 Wallpapers Edition)",
    "url": "https://smashingmagazine.com/2025/08/desktop-wallpaper-calendars-september-2025/",
    "category_id": "design",
    "region": "Global",
    "source": "smashingmagazine.com",
    "author": "hello@smashingmagazine.com (Cosima Mielke)",
    "published_at": "2025-08-31T08:00:00.000Z",
    "summary_long": "September is just around the corner, and that means it’s time for some new wallpapers! For more than 14 years already, our monthly wallpapers series has been the perfect occasion for artists and designers to challenge their creative skills and take on a little just-for-fun project — telling the stories they want to tell, using their favorite tools. This always makes for a unique and inspiring collection of wallpapers month after month, and, of course, this September is no exception. In this post, you’ll find desktop wallpapers for September 2025, created with love by the community for the community. As a bonus, we’ve also added some oldies but goodies from our archives to the collection, so maybe you’ll spot one of your almost-forgotten favorites in here, too? A huge thank-you to everyone who shared their artworks with us this month — this post wouldn’t exist without your creativity and support! By the way, if you’d like to get featured in…",
    "tags": []
  },
  {
    "id": "nextfrontiers:over 16000 compromised servers uncovered using secure shell :2025-09-01T16:37:04.000Z",
    "title": "Over 16,000 compromised servers uncovered using Secure Shell key probing method",
    "url": "https://techxplore.com/news/2025-09-compromised-servers-uncovered-shell-key.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T16:37:04.000Z",
    "summary_long": "An international research team from the Max Planck Institute (MPI) for Informatics in Saarbrücken, Germany, and the Delft University of Technology in the Netherlands has developed a method to detect compromised hosts at an internet scale by probing servers with public SSH keys previously observed in attacker operations. An international research team from the Max Planck Institute (MPI) for Informatics in Saarbrücken, Germany, and the Delft University of Technology in the Netherlands has developed a method to detect compromised hosts at an internet scale by probing servers with public SSH keys previously observed in attacker operations.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01.",
    "tags": []
  },
  {
    "id": "nextfrontiers:styrofoambased hydrogen storage new process offers safe reus:2025-09-01T15:56:03.000Z",
    "title": "Styrofoam-based hydrogen storage: New process offers safe, reusable solution",
    "url": "https://techxplore.com/news/2025-09-styrofoam-based-hydrogen-storage-safe.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T15:56:03.000Z",
    "summary_long": "A research team affiliated with UNIST has unveiled a novel technology that enables hydrogen to be stored within polystyrene-derived materials, particularly those originating from Styrofoam. The research is published in the journal ACS Catalysis. A research team affiliated with UNIST has unveiled a novel technology that enables hydrogen to be stored within polystyrene-derived materials, particularly those originating from Styrofoam. The research is published in the journal ACS Catalysis.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "fintech:polygon leads crypto gains with 16 weekend surge as coindesk:2025-09-01T15:52:43.000Z",
    "title": "Polygon Leads Crypto Gains With 16% Weekend Surge as CoinDesk 20 Index Holds Steady",
    "url": "https://www.coindesk.com/markets/2025/09/01/polygon-leads-crypto-gains-with-16-surge-as-coindesk-20-index-holds-steady",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-09-01T15:52:43.000Z",
    "summary_long": "The native token of Polygon (POL), an Ethereum scaling network, led gains through the weekend in the broad-market crypto benchmark CoinDesk 20 Index (CD20). POL surged 16% from Friday through early Monday, topping $0.29 for the first time since early March, CoinDesk data shows. Recently, it pared back some of the advance slipping below $0.28. The move happened as the CD20 remained little changed with bitcoin (BTC) and Ethereum's ether (ETH) posting only modest gains. CoinDesk 20 performance Aug. 29 - Sep. 1 (CoinDesk Indices) [https://cdn.sanity.io/images/s3y3vcno/production/87c33d34ab3781feb222e8ad87ddb9c472851c39-800x800.png?auto=format] While there wasn't any clear catalyst behind POL's surge, some positive developments may have bolstered the token's performance. Polygon was one of the chains mentioned last week in the U.S. government's initiative to release key economic data such as GDP on blockchain rails. The network also announced an integration last week with USDT0, a Tether-focused cross-chain stablecoin protocol, that could help boost the network's position as a key liquidity hub for stablecoin flows. On…",
    "tags": []
  },
  {
    "id": "consumer:sony is hosting a state of play showcase for 007 first light:2025-09-01T15:19:58.000Z",
    "title": "Sony is hosting a State of Play showcase for 007 First Light on September 3",
    "url": "https://www.engadget.com/gaming/sony-is-hosting-a-state-of-play-showcase-for-007-first-light-on-september-3-151958435.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2025-09-01T15:19:58.000Z",
    "summary_long": "Sony has lined up its next PlayStation State of Play showcase, and this one is all about a single game. It will focus on 007 First Light, the long-awaited James Bond adventure from Hitman studio IO Interactive. It starts at 2PM ET on September 3 and you can watch it on the PlayStation YouTube and Twitch channels (there'll also be a version of the video with English subtitles on YouTube). You can also just hit the play button on the YouTube video above when the time is right. The showcase will run for over 30 minutes and it will feature a deep dive into gameplay, including a full playthrough of a young Bond's first mission. Over on the PlayStation Blog, IOI said to expect \"everything from high-speed car chases to on-foot stealth sequences and shootouts.\" Following that, IOI will offer up more details on 007 First Light gameplay. Perhaps we'll also get a release date or narrower window for the…",
    "tags": []
  },
  {
    "id": "consumer:pick up an apple airtag fourpack for only 70 in this labor d:2025-09-01T15:05:35.000Z",
    "title": "Pick up an Apple AirTag four-pack for only $70 in this Labor Day sale",
    "url": "https://www.engadget.com/mobile/smartphones/pick-up-an-apple-airtag-four-pack-for-only-70-in-this-labor-day-sale-130740075.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2025-09-01T15:05:35.000Z",
    "summary_long": "If you're thinking about getting some of Apple's AirTags, now's the time to act — Amazon currently has a four-pack on sale for $70 thanks to Labor Day sales. That's one of the lowest prices we've seen outside the big sales on Black Friday and Prime Day. For Apple users, AirTags offer some large advantages over rival trackers. The ultra-wideband functionality offers precise tracking with iPhones less than five years old, so you can narrow your search between a couch and love seat in the same room. Over larger distances, the AirTag network enabled by all Apple device users lets you track down an object you might have misplaced in a café. It offers a simple coin-sized design and seamless experience thanks to the Find My app. You can also force an AirTag to emit a chime to help you home in an object's location, and and that sound is nice and loud to better help you locate it. It…",
    "tags": []
  },
  {
    "id": "nextfrontiers:report on social media age assurance trial says there is not:2025-09-01T14:19:03.000Z",
    "title": "Report on social media age assurance trial says there is not a one-size-fits-all solution",
    "url": "https://techxplore.com/news/2025-09-social-media-age-trial-size.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T14:19:03.000Z",
    "summary_long": "Australia's government trial has found age-assurance for its under-16 social media ban can be done effectively and protect privacy, but there is not a one-size-fits-all model. Australia's government trial has found age-assurance for its under-16 social media ban can be done effectively and protect privacy, but there is not a one-size-fits-all model.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "nextfrontiers:how we tricked ai chatbots into creating misinformation desp:2025-09-01T14:09:05.000Z",
    "title": "How we tricked AI chatbots into creating misinformation, despite 'safety' measures",
    "url": "https://techxplore.com/news/2025-09-ai-chatbots-misinformation-safety.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T14:09:05.000Z",
    "summary_long": "When you ask ChatGPT or other AI assistants to help create misinformation, they typically refuse, with responses like \"I cannot assist with creating false information.\" But our tests show these safety measures are surprisingly shallow—often just a few words deep—making them alarmingly easy to circumvent. When you ask ChatGPT or other AI assistants to help create misinformation, they typically refuse, with responses like \"I cannot assist with creating false information.\" But our tests show these safety measures are surprisingly shallow—often just a few words deep—making them alarmingly easy to circumvent.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01.",
    "tags": []
  },
  {
    "id": "consumer:the best labor day sales for 2025 get up to 500 off gear fro:2025-09-01T14:00:34.000Z",
    "title": "The best Labor Day sales for 2025: Get up to $500 off gear from Apple, Dyson, Shark, Sony and others",
    "url": "https://www.engadget.com/deals/the-best-labor-day-sales-for-2025-get-up-to-500-off-gear-from-apple-dyson-shark-sony-and-others-120049563.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Valentina Palladino",
    "published_at": "2025-09-01T14:00:34.000Z",
    "summary_long": "Labor Day may bring about the unofficial end to summer, but on the bright side, it can be a good time to save on tech. While seasonal holidays like Memorial Day and Labor Day aren’t the boon for tech deals as Prime Day or Black Friday can be, you can still find some good deals across the web. That’s particularly true if you’re going back to school soon, or are shopping for someone imminently heading back to campus. Engadget has you covered for all of the best Labor Day sales on tech. Since this time of year does overlap with the back-to-school season, students should be first in line to check out these deals. If you need some new gadgets for college, or refreshed tech to help you out in your first job after graduating, now's the time to see if you can get it for less. Student discounts are handy and exclusive to those who can prove their student…",
    "tags": []
  },
  {
    "id": "nextfrontiers:why are video games getting more expensive spoiler its not j:2025-09-01T13:49:17.000Z",
    "title": "Why are video games getting more expensive? Spoiler: It's not just tariffs",
    "url": "https://techxplore.com/news/2025-09-video-games-expensive-spoiler-tariffs.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T13:49:17.000Z",
    "summary_long": "The launch of Nintendo's Switch 2 this year came with the normal level of hype for a new gaming console, but there was also something distinctly sour about it: the price. The launch of Nintendo's Switch 2 this year came with the normal level of hype for a new gaming console, but there was also something distinctly sour about it: the price.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  }
]