[
  {
    "id": "bigtech:star wars fate of the old republic announced as a kotor spir:2025-12-12T02:51:40.000Z",
    "title": "Star Wars: Fate of the Old Republic announced as a KOTOR spiritual successor",
    "url": "https://arstechnica.com/gaming/2025/12/star-wars-fate-of-the-old-republic-announced-as-a-kotor-spiritual-successor/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kyle Orland\n                ",
    "published_at": "2025-12-12T02:51:40.000Z",
    "summary_long": "Over two decades after the release of Star Wars: Knights of the Old Republic II, a new project described as a “spiritual successor” to that seminal RPG series was announced at The Game Awards Thursday night. Star Wars: Fate of the Old Republic will be a collaboration between Lucasfilm Games and Arcanaut Studios, a new development house being launched by original KOTOR director Casey Hudson. Hudson, who will serve as director on the new game, said in an interview with StarWars.com that he has remained in contact with Lucasfilm since the KOTOR days, in the hopes of being able to collaborate in the Star Wars universe again. “It took the right conditions to get everything to line up,” he told the site. Source: arstechnica.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:instead of fixing wows new floating house exploit blizzard m:2025-12-11T23:03:02.000Z",
    "title": "Instead of fixing WoW’s new floating house exploit, Blizzard makes it official",
    "url": "https://arstechnica.com/gaming/2025/12/instead-of-fixing-wows-new-floating-house-exploit-blizzard-makes-it-official/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kyle Orland\n                ",
    "published_at": "2025-12-11T23:03:02.000Z",
    "summary_long": "Long-time World of Warcraft players have been waiting 21 years for the new in-game housing features that Blizzard officially announced last year and which launched in early access last week. Shortly after that launch, though, players quickly discovered a way to make their houses float high above the ground by exploiting an unintended, invisible UI glitch. Now, Blizzard says that the overwhelming response to that accidental house hovering has been so strong that it’s pivoting to integrate it as an official part of the game. “We were going to fix flying houses to bring them back to terra firma, but you all made such awesome stuff, so we made it possible with the base UI instead.” WoW principal designer Jesse Kurlancheek posted on social media Tuesday. Source: arstechnica.com. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:openai releases gpt52 after code red google threat alert:2025-12-11T21:27:18.000Z",
    "title": "OpenAI releases GPT-5.2 after “code red” Google threat alert",
    "url": "https://arstechnica.com/information-technology/2025/12/openai-releases-gpt-5-2-after-code-red-google-threat-alert/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-12-11T21:27:18.000Z",
    "summary_long": "On Thursday, OpenAI released GPT-5.2, its newest family of AI models for ChatGPT, in three versions called Instant, Thinking, and Pro. The release follows CEO Sam Altman’s internal “code red” memo earlier this month, which directed company resources toward improving ChatGPT in response to competitive pressure from Google’s Gemini 3 AI model. “We designed 5.2 to unlock even more economic value for people,” Fidji Simo, OpenAI’s chief product officer, said during a press briefing with journalists on Thursday. “It’s better at creating spreadsheets, building presentations, writing code, perceiving images, understanding long context, using tools and then linking complex, multi-step projects.” As with previous versions of GPT-5, the three model tiers serve different purposes: Instant handles faster tasks like writing and translation; Thinking spits out simulated reasoning “thinking” text in an attempt to tackle more complex work like coding and math; and Pro spits out even more simulated reasoning text with the goal of delivering the highest-accuracy performance for difficult problems.…",
    "tags": []
  },
  {
    "id": "code:lets talk about github actions:2025-12-11T17:40:52.000Z",
    "title": "Let’s talk about GitHub Actions",
    "url": "https://github.blog/news-insights/product-news/lets-talk-about-github-actions/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Ben De St Paer-Gotch",
    "published_at": "2025-12-11T17:40:52.000Z",
    "summary_long": "GitHub Actions has grown massively since its release in 2018; in 2025 alone, developers used 11.5 billion GitHub Actions minutes in public and open source projects, up 35% year over year from 2024. At the same time, this has not been without its growing pains, and you’ve made clear to us what improvements matter most: faster builds, improved security, better caching, more workflow flexibility, and rock-solid reliability. Meeting that level of demand first required a deliberate investment in re-architecting the core backend services powering every GitHub Actions job and runner. This was a substantial effort that laid the foundation for the long-term performance, scalability, and feature delivery you’ve been asking for. Source: github.blog. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crosschain liquidity protocol lifi raises 29m in series a ex:2025-12-11T16:22:42.000Z",
    "title": "Cross-Chain Liquidity Protocol LI.FI Raises $29M in Series A Extension",
    "url": "https://www.coindesk.com/business/2025/12/11/cross-chain-liquidity-protocol-li-fi-raises-usd29m-in-series-a-extension",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-12-11T16:22:42.000Z",
    "summary_long": "Cross-Chain Liquidity Protocol LI.FI Raises $29M in Series A Extension Source: www.coindesk.com. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:larian studios is returning to the divinity series with divi:2025-12-12T01:58:33.000Z",
    "title": "Larian Studios is returning to the Divinity series with... Divinity",
    "url": "https://www.engadget.com/gaming/larian-studios-is-returning-to-the-divinity-series-with-divinity-015833088.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2025-12-12T01:58:33.000Z",
    "summary_long": "Larian Studios didn’t rest on its laurels for long. Two years after taking home the Game of the Year prize for Baldur’s Gate III at The Game Awards, the developer popped up again at the 2025 edition of the ceremony to announce its upcoming project, which is the next entry in the Divinity series. Simply called Divinity, this will be the studio’s biggest game to date with “more breadth and depth than ever before,” according to TGA host Geoff Keighley. After 2017’s Divinity: Original Sin II, Larian took a break from the series with which it established itself to make BG3. Source: www.engadget.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:optimal transport unlocks endtoend learning for singlemolecu:2025-12-11T14:30:16.000Z",
    "title": "Optimal transport unlocks end-to-end learning for single-molecule localization",
    "url": "https://arxiv.org/abs/2512.10683v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Romain Seailles",
    "published_at": "2025-12-11T14:30:16.000Z",
    "summary_long": "Single-molecule localization microscopy (SMLM) allows reconstructing biology-relevant structures beyond the diffraction limit by detecting and localizing individual fluorophores -- fluorescent molecules stained onto the observed specimen -- over time to reconstruct super-resolved images. Currently, efficient SMLM requires non-overlapping emitting fluorophores, leading to long acquisition times that hinders live-cell imaging. Recent deep-learning approaches can handle denser emissions, but they rely on variants of non-maximum suppression (NMS) layers, which are unfortunately non-differentiable and may discard true positives with their local fusion strategy. In this presentation, we reformulate the SMLM training objective as a set-matching problem, deriving an optimal-transport loss that eliminates the need for NMS during inference and enables end-to-end training. Source: arxiv.org. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:fortnite is back on the google play store:2025-12-11T19:55:07.000Z",
    "title": "Fortnite is back on the Google Play Store",
    "url": "https://www.engadget.com/gaming/fortnite-is-back-on-the-google-play-store-195507458.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2025-12-11T19:55:07.000Z",
    "summary_long": "Epic Games has spent a lot of time in court over the past several years, but it seems the company's litigious era may be winding down. The company announced today that its game Fortnite is back on the Google Play mobile store in the US. Fortnite's return to Android devices means Epic's popular hit is now available on just about every gaming platform following five years of arguing antitrust lawsuits. Epic took both Google and Apple to court over their policies for mobile payment systems back in 2020. Source: www.engadget.com. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:advancing science and math with gpt52:2025-12-11T10:00:00.000Z",
    "title": "Advancing science and math with GPT-5.2",
    "url": "https://openai.com/index/gpt-5-2-for-science-and-math",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2025-12-11T10:00:00.000Z",
    "summary_long": "GPT-5.2 is OpenAI’s strongest model yet for math and science, setting new state-of-the-art results on benchmarks like GPQA Diamond and FrontierMath. This post shows how those gains translate into real research progress, including solving an open theoretical problem and generating reliable mathematical proofs. Source: openai.com. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:stellar jet:2025-12-11T15:58:20.000Z",
    "title": "Stellar Jet",
    "url": "https://www.nasa.gov/image-article/stellar-jet/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2025-12-11T15:58:20.000Z",
    "summary_long": "NASA, ESA, CSA, STScI, Yu Cheng (NAOJ); Image Processing: Joseph DePasquale (STScI) NASA’s James Webb Space Telescope captured a blowtorch of seething gasses erupting from a volcanically growing monster star in this image released on Sept. 10, 2025. Stellar jets, which are powered by the gravitational energy released as a star grows in mass, encode the formation history of the protostar. This image provides evidence that protostellar jets scale with the mass of their parent stars—the more massive the stellar engine driving the plasma, the larger the resulting jet. Source: www.nasa.gov. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:pmbnn physiologycentred hybrid ai for personalized hemodynam:2025-12-11T15:32:50.000Z",
    "title": "PMB-NN: Physiology-Centred Hybrid AI for Personalized Hemodynamic Monitoring from Photoplethysmography",
    "url": "https://arxiv.org/abs/2512.10745v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yaowen Zhang",
    "published_at": "2025-12-11T15:32:50.000Z",
    "summary_long": "Continuous monitoring of blood pressure (BP) and hemodynamic parameters such as peripheral resistance (R) and arterial compliance (C) are critical for early vascular dysfunction detection. While photoplethysmography (PPG) wearables has gained popularity, existing data-driven methods for BP estimation lack interpretability. We advanced our previously proposed physiology-centered hybrid AI method-Physiological Model-Based Neural Network (PMB-NN)-in blood pressure estimation, that unifies deep learning with a 2-element Windkessel based model parameterized by R and C acting as physics constraints. The PMB-NN model was trained in a subject-specific manner using PPG-derived timing features, while demographic information was used to infer an intermediate variable: cardiac output. Source: arxiv.org. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:warios one and only 3d platformer is now playable on switch :2025-12-11T13:30:11.000Z",
    "title": "Wario’s one and only 3D platformer is now playable on Switch 2",
    "url": "https://www.engadget.com/gaming/nintendo/warios-one-and-only-3d-platformer-is-now-playable-on-switch-2-133011950.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2025-12-11T13:30:11.000Z",
    "summary_long": "Nintendo has been slowly drip-feeding us GameCube games since the console joined its Nintendo Classics offering when the Switch 2 launched in June, and we just got another one. Wario World launched in 2003 and was developed by Treasure (Gunstar Heroes, Ikaruga). You play as Wario, the flatulent antithesis of Nintendo’s primary mascot, in what is a combat-heavy platformer. Wario’s castle has been overthrown by an evil piece of sentient jewellery called Black Jewel, and it’s up to the garlic-loving antihero to punch and piledrive everything in sight in order to reclaim it. Source: www.engadget.com. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]