[
  {
    "id": "bigtech:can google be trusted without a break up:2025-09-27T13:00:00.000Z",
    "title": "Can Google be trusted without a break up?",
    "url": "https://www.theverge.com/policy/786930/google-doj-ad-tech-remedies-break-up-trust",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Lauren Feiner",
    "published_at": "2025-09-27T13:00:00.000Z",
    "summary_long": "On day three of the two-week remedies trial in the Justice Department's ad tech case against Google, Judge Leonie Brinkema boiled down the argument to one key issue: trust. Brinkema interrupted testimony from a DOJ expert with a hypothetical: should she issue a strict order modifying Google's behavior, could it resolve the issues at hand if \"you had confidence that Google would actually act in complete good faith?\" The question felt particularly pointed, given how the Google trial Brinkema presided over last year unfolded. Over three weeks, the DOJ repeatedly presented examples of Google employees allegedly using chat messages to avoid leav … Read the full story at The Verge. Source: www.theverge.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:what to expect from amazons big fall hardware event on tuesd:2025-09-27T12:00:00.000Z",
    "title": "What to expect from Amazon’s big fall hardware event on Tuesday",
    "url": "https://www.theverge.com/news/786455/amazon-fall-hardware-event-2025-what-to-expect-alexa-echo-kindle",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Jay Peters",
    "published_at": "2025-09-27T12:00:00.000Z",
    "summary_long": "Amazon is hosting its 2025 fall hardware event on Tuesday, September 30th, and it could be a packed show. The company’s invite has a few not-so-subtle hints about new Echos and a new Kindle. It will also be Amazon’s next big product event for Panos Panay, who joined Amazon in 2023 to head up its devices and services teams after a long career at Microsoft helping launch products like the Surface lineup. Amazon has taken some big swings under Panay’s leadership, launching a suite of new Kindle products last year — including the first color Kindle — and announcing its AI-powered Alexa Plus assistant. Source: www.theverge.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:nydig calls for bitcoin treasury companies to drop misleadin:2025-09-27T19:00:47.000Z",
    "title": "NYDIG Calls for Bitcoin Treasury Companies to Drop 'Misleading' mNAV Metric",
    "url": "https://www.coindesk.com/business/2025/09/27/nydig-calls-for-bitcoin-treasury-companies-to-drop-misleading-mnav-metric",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-27T19:00:47.000Z",
    "summary_long": "Strive Asset Management (ASST) has acquired Semler Scientific (SMLR) in an all-stock deal. While historic, the move also drew attention to what may be a problem for investors valuing bitcoin treasury firms. The acquisition was the first-ever merger between two Digital Asset Treasuries (DATs) holding bitcoin, giving the combined company control of more than 10,900 BTC and increases net asset value (NAV) per share, which DAT investors view as a measure of “yield.” In a note this week commenting on the acquisition, Greg Cipolaro, Global Head of Research at NYDIG, argued that the commonly used “mNAV” metric, defined as market cap divided by crypto held, should be removed from industry reporting altogether. “At best, it’s misleading; at worst, it’s disingenuous,” the firm claimed in the note. Source: www.coindesk.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:the current war on science and whos behind it:2025-09-27T11:30:01.000Z",
    "title": "The current war on science, and who’s behind it",
    "url": "https://arstechnica.com/science/2025/09/who-should-we-blame-for-the-current-war-on-science/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Diana Gitig\n                ",
    "published_at": "2025-09-27T11:30:01.000Z",
    "summary_long": "We’re about a quarter of the way through the 21st century. Summers across the global north are now defined by flash floods, droughts, heat waves, uncontainable wildfires, and intensifying named storms, exactly as predicted by Exxon scientists back in the 1970s. The United States secretary of health and human services advocates against using the most effective tool we have to fight the infectious diseases that have ravaged humanity for millennia. People are eagerly lapping up the misinformation spewed and disseminated by AI chatbots, which are only just getting started. Source: arstechnica.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:as gold keeps setting new highs china reportedly wants to be:2025-09-27T15:48:54.000Z",
    "title": "As Gold Keeps Setting New Highs, China Reportedly Wants to Be Its Custodian for Central Banks",
    "url": "https://www.coindesk.com/markets/2025/09/27/as-gold-keeps-setting-new-highs-china-reportedly-wants-to-be-its-custodian-for-central-banks",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-09-27T15:48:54.000Z",
    "summary_long": "China is reportedly making a bid to expand its influence in global gold markets by offering to hold foreign central bank reserves within its borders. According to Bloomberg, the People’s Bank of China has used the Shanghai Gold Exchange in recent months to pitch central banks in friendly countries on the idea. At least one Southeast Asian country has shown interest, people familiar with the matter told Bloomberg. The push would allow Beijing to strengthen its role as a bullion hub and reduce reliance on Western financial centers. Source: www.coindesk.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crypto treasury firms could become longterm giants like berk:2025-09-27T21:22:48.000Z",
    "title": "Crypto Treasury Firms Could Become Long-Term Giants like Berkshire Hathaway, Analyst Says",
    "url": "https://www.coindesk.com/markets/2025/09/27/crypto-treasury-firms-could-become-long-term-giants-like-berkshire-hathaway-analyst-says",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-09-27T21:22:48.000Z",
    "summary_long": "Crypto treasury firms that stockpile tokens could evolve from speculative wrappers into long-run economic engines for blockchains, argues Syncracy Capital co-founder Ryan Watkins. Digital asset treasury (DAT) firms are publicly traded companies that raise capital to acquire and manage crypto on their balance sheets. In a Sept. 23 blog post and an accompanying thread on X, Watkins said DATs already hold roughly $105 billion in assets across bitcoin, ether and other majors, a scale that few market participants have fully considered. Source: www.coindesk.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:what to read this weekend moonflow and everything dead dying:2025-09-27T19:17:22.000Z",
    "title": "What to read this weekend: Moonflow and Everything Dead & Dying",
    "url": "https://www.engadget.com/entertainment/what-to-read-this-weekend-moonflow-and-everything-dead--dying-191722871.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Cheyenne MacDonald",
    "published_at": "2025-09-27T19:17:22.000Z",
    "summary_long": "These are some recently released titles we think are worth adding to your reading list. Get lost in Bitter Karella's splatterpunk, cosmic fever dream, Moonflow, and the new zombie apocalypse comic, Everything Dead & Dying. This article originally appeared on Engadget at Source: www.engadget.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:how to set your ps5 as your home console:2025-09-27T12:00:59.000Z",
    "title": "How to set your PS5 as your home console",
    "url": "https://www.engadget.com/gaming/playstation/how-to-set-your-ps5-as-your-home-console-120059735.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Rob Webb",
    "published_at": "2025-09-27T12:00:59.000Z",
    "summary_long": "Setting your PlayStation 5 as your primary console ensures other users on that system can access your digital games and PlayStation Plus benefits. This includes offline access to your library and shared access for other local profiles on the same device. This guide explains how to enable Console Sharing and Offline Play on your PS5, along with tips to manage your account and avoid common issues. After all, sharing is caring, and this can be a great way for your squad at home to experience a stack of games at no extra cost, while claiming all the trophies (and the glory) for their own profiles. Source: www.engadget.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:underground data fortresses the nuclear bunkers mines and mo:2025-09-27T18:00:02.000Z",
    "title": "Underground data fortresses: The nuclear bunkers, mines and mountains being transformed to protect data from attack",
    "url": "https://techxplore.com/news/2025-09-underground-fortresses-nuclear-bunkers-mountains.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-27T18:00:02.000Z",
    "summary_long": "Underground data fortresses: The nuclear bunkers, mines and mountains being transformed to protect data from attack Source: techxplore.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:faa restores boeings ability to certify max jets for flight :2025-09-27T11:28:45.000Z",
    "title": "FAA restores Boeing's ability to certify Max jets for flight more than 6 years after fatal crashes",
    "url": "https://techxplore.com/news/2025-09-faa-boeing-ability-certify-max.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-27T11:28:45.000Z",
    "summary_long": "Boeing is getting back the ability to perform final safety inspections on 737 Max jetliners and certify the planes for flight more than six years after crashes of the then-new model killed 346 people, the Federal Aviation Administration said Friday. Source: techxplore.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:pixel buds pro 2 get adaptive audio gesture controls and mor:2025-09-27T15:51:16.000Z",
    "title": "Pixel Buds Pro 2 get Adaptive Audio, gesture controls and more in latest update",
    "url": "https://www.engadget.com/audio/headphones/pixel-buds-pro-2-get-adaptive-audio-gesture-controls-and-more-in-latest-update-155116813.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-09-27T15:51:16.000Z",
    "summary_long": "Google first teased some enticing upgrades for its Pixel Buds Pro 2 during the Made by Google event in August. More than a month later, Google is finally rolling out the update that makes its wireless earbuds earn the Pro label. The Pixel Buds Pro 2 now get an Adaptive Audio feature in the Active Noise Control section of the Pixel Buds app. This ANC mode automatically adjusts the volume depending on your surrounding environment, balancing between hearing your music or podcasts and the world around you. Source: www.engadget.com. Date: 2025-09-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]