[
  {
    "id": "bigtech:bmws first electric m car is coming in 2027with one motor pe:2026-01-13T23:01:44.000Z",
    "title": "BMW’s first electric M car is coming in 2027—with one motor per wheel",
    "url": "https://arstechnica.com/cars/2026/01/bmws-first-electric-m-car-is-coming-in-2027-with-one-motor-per-wheel/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jonathan M. Gitlin\n                ",
    "published_at": "2026-01-13T23:01:44.000Z",
    "summary_long": "BMW provided flights from Washington, DC, to Malaga, Spain, and accommodation so Ars could drive the iX3 and be briefed on the electric M Neue Klasse. Ars does not accept paid editorial content. Late last year, we drove BMW's new iX3. It's the first of a series of electric BMWs to use a newly developed platform, known as the \"Neue Klasse.\" Later this year, we'll see the first fully electric version of the 3 Series when the i3 sedan debuts. Source: arstechnica.com. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:hegseth wants to integrate musks grok ai into military netwo:2026-01-13T21:13:07.000Z",
    "title": "Hegseth wants to integrate Musk’s Grok AI into military networks this month",
    "url": "https://arstechnica.com/ai/2026/01/hegseth-wants-to-integrate-musks-grok-ai-into-military-networks-this-month/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2026-01-13T21:13:07.000Z",
    "summary_long": "On Monday, US Defense Secretary Pete Hegseth said he plans to integrate Elon Musk's AI tool, Grok, into Pentagon networks later this month. During remarks at the SpaceX headquarters in Texas reported by The Guardian, Hegseth said the integration would place \"the world's leading AI models on every unclassified and classified network throughout our department.\" The announcement comes weeks after Grok drew international backlash for generating sexualized images of women and children, although the Department of Defense has not released official documentation confirming Hegseth's announced timeline or implementation details. During the same appearance, Hegseth rolled out what he called an \"AI acceleration strategy\" for the Department of Defense. The strategy, he said, will \"unleash experimentation, eliminate bureaucratic barriers, focus on investments, and demonstrate the execution approach needed to ensure we lead in military AI and that it grows more dominant into the future.\" Read full article Comments Source: arstechnica.com. Date: 2026-01-13.",
    "tags": []
  },
  {
    "id": "bigtech:starlink tries to stay online in iran as regime jams signals:2026-01-13T19:18:35.000Z",
    "title": "Starlink tries to stay online in Iran as regime jams signals during protests",
    "url": "https://arstechnica.com/tech-policy/2026/01/starlink-tries-to-stay-online-in-iran-as-regime-jams-signals-during-protests/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2026-01-13T19:18:35.000Z",
    "summary_long": "President Trump asked Elon Musk to get Starlink working more reliably in Iran to thwart the Iranian government's Internet shutdown. Starlink operator SpaceX was apparently already working on the problem before Trump reached out to Musk. Iran severed Internet connections and phone lines last week as the government conducted a violent crackdown on anti-government demonstrators, according to numerous reports, which say that thousands of people have been killed. Starlink hasn't been completely disabled. Source: arstechnica.com. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta refocuses on ai hardware as metaverse layoffs begin:2026-01-13T14:59:24.000Z",
    "title": "Meta refocuses on AI hardware as metaverse layoffs begin",
    "url": "https://www.engadget.com/ar-vr/meta-refocuses-on-ai-hardware-as-metaverse-layoffs-begin-145924706.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Devindra Hardawar",
    "published_at": "2026-01-13T14:59:24.000Z",
    "summary_long": "As we expected, Meta has begun laying off more than 1,000 employees from its Reality Labs division, which focused on virtual reality and metaverse products, Bloomberg reports. The company will refocus on developing wearables, like its recent batch of AI-powered Ray-Ban smart glasses, according to a memo from CTO Andrew Bosworth. The news isn’t too surprising. Reality Labs has lost more than $70 billion since the beginning of 2021, and while Meta has done a solid job of delivering desirable consumer VR headsets and smart glasses, that business hasn’t been nearly profitable enough to justify the cost. Source: www.engadget.com. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:la nasa transmitirá en directo el regreso y el amerizaje de :2026-01-13T23:52:24.000Z",
    "title": "La NASA transmitirá en directo el regreso y el amerizaje de Crew 11",
    "url": "https://www.nasa.gov/news-release/la-nasa-transmitira-en-directo-el-regreso-y-el-amerizaje-de-crew-11/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jennifer M. Dooren",
    "published_at": "2026-01-13T23:52:24.000Z",
    "summary_long": "Los cuatro miembros de la tripulación SpaceX Crew-11 se juntaron para una foto de grupo con sus trajes presurizados Dragon durante una comprobación de dichos trajes en el módulo laboratorio Kibo de la Estación Espacial Internacional. En el sentido de las agujas del reloj, desde la parte inferior izquierda, aparecen el astronauta de la NASA Mike Fincke, el cosmonauta de Roscosmos Oleg Platonov, la astronauta de la NASA Zena Cardman y el astronauta de la JAXA (Agencia Japonesa de Exploración Aeroespacial) Kimiya Yui. Credit: NASA Read this press release in English here. La NASA y SpaceX prevén que, si las condiciones meteorológicas lo permiten, el desacoplamiento de la misión SpaceX Crew 11 de la agencia espacial estadounidense de la Estación Espacial Internacional se produzca no antes de las 5:05 p.m. Source: www.nasa.gov. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:us space force switches rockets for upcoming gps satellite l:2026-01-13T23:42:02.000Z",
    "title": "U.S. Space Force switches rockets for upcoming GPS satellite launch",
    "url": "https://spaceflightnow.com/2026/01/13/u-s-space-force-switches-rockets-for-upcoming-gps-satellite-launch/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-13T23:42:02.000Z",
    "summary_long": "The next Global Positioning System satellite is switching from a United Launch Alliance Vulcan rocket to a SpaceX Falcon 9, a spokesperson for the U.S. Space Force’s Space Systems Command System Delta 80 said Tuesday. SpaceX could launch the GPS III Space Vehicle 09 (SV09) within the next few weeks, as the satellite was entering the final stages of pre-flight preparations. As part of the swap, United Launch Alliance (ULA) will instead launch the third of the next generation of Global Positioning System satellites. Source: spaceflightnow.com. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas pandora small satellite launched:2026-01-13T21:39:44.000Z",
    "title": "NASA’s Pandora Small Satellite Launched",
    "url": "https://www.nasa.gov/image-article/nasas-pandora-small-satellite-launched/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-01-13T21:39:44.000Z",
    "summary_long": "SpaceX In this photo from early January 2026, teams prepare to encapsulate NASA’s Pandora small satellite, NASA-sponsored Star-Planet Activity Research CubeSat (SPARCS), and the Black Hole Coded Aperture Telescope (BlackCAT) CubeSat, inside a SpaceX Falcon 9 payload fairing. A SpaceX Falcon 9 rocket carrying NASA’s Pandora small satellite lifted off at 5:44 a.m. PST Sunday, Jan. 11, from Space Launch Complex 4 East at Vandenberg Space Force Base located on California’s central coast. Source: www.nasa.gov. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:taiwan issues arrest warrant for pete lau ceo of oneplus:2026-01-13T18:54:00.000Z",
    "title": "Taiwan issues arrest warrant for Pete Lau, CEO of OnePlus",
    "url": "https://www.engadget.com/mobile/smartphones/taiwan-issues-arrest-warrant-for-pete-lau-ceo-of-oneplus-185400997.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-13T18:54:00.000Z",
    "summary_long": "Taiwanese officials have issued an arrest warrant for OnePlus CEO Pete Lau on allegations of illegally employing workers in Taiwan. Two Taiwanese citizens who worked for Lau have also been indicted. The China-based smartphone company has been accused of illegally recruiting more than 70 engineers from Taiwan. Members of the Shilin District Prosecutors Office claim that OnePlus reportedly set up a shell company in Hong Kong with a distinct name, then launched a branch in Taiwan in 2015 without government approval. Source: www.engadget.com. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:multiplex thinking reasoning via tokenwise branchandmerge:2026-01-13T18:48:00.000Z",
    "title": "Multiplex Thinking: Reasoning via Token-wise Branch-and-Merge",
    "url": "https://arxiv.org/abs/2601.08808v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yao Tang",
    "published_at": "2026-01-13T18:48:00.000Z",
    "summary_long": "Large language models often solve complex reasoning tasks more effectively with Chain-of-Thought (CoT), but at the cost of long, low-bandwidth token sequences. Humans, by contrast, often reason softly by maintaining a distribution over plausible next steps. Motivated by this, we propose Multiplex Thinking, a stochastic soft reasoning mechanism that, at each thinking step, samples K candidate tokens and aggregates their embeddings into a single continuous multiplex token. This preserves the vocabulary embedding prior and the sampling dynamics of standard discrete generation, while inducing a tractable probability distribution over multiplex rollouts. Source: arxiv.org. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:adaptive requesting in decentralized edge networks via nonst:2026-01-13T17:43:38.000Z",
    "title": "Adaptive Requesting in Decentralized Edge Networks via Non-Stationary Bandits",
    "url": "https://arxiv.org/abs/2601.08760v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yi Zhuang",
    "published_at": "2026-01-13T17:43:38.000Z",
    "summary_long": "We study a decentralized collaborative requesting problem that aims to optimize the information freshness of time-sensitive clients in edge networks consisting of multiple clients, access nodes (ANs), and servers. Clients request content through ANs acting as gateways, without observing AN states or the actions of other clients. We define the reward as the age of information reduction resulting from a client's selection of an AN, and formulate the problem as a non-stationary multi-armed bandit. In this decentralized and partially observable setting, the resulting reward process is history-dependent and coupled across clients, and exhibits both abrupt and gradual changes in expected rewards, rendering classical bandit-based approaches ineffective. Source: arxiv.org. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:gridaware charging and operational optimization for mixedfle:2026-01-13T17:30:25.000Z",
    "title": "Grid-Aware Charging and Operational Optimization for Mixed-Fleet Public Transit",
    "url": "https://arxiv.org/abs/2601.08753v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Rishav Sen",
    "published_at": "2026-01-13T17:30:25.000Z",
    "summary_long": "The rapid growth of urban populations and the increasing need for sustainable transportation solutions have prompted a shift towards electric buses in public transit systems. However, the effective management of mixed fleets consisting of both electric and diesel buses poses significant operational challenges. One major challenge is coping with dynamic electricity pricing, where charging costs vary throughout the day. Transit agencies must optimize charging assignments in response to such dynamism while accounting for secondary considerations such as seating constraints. Source: arxiv.org. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:star wars outlaws developer massive entertainment and ubisof:2026-01-13T13:42:34.000Z",
    "title": "Star Wars Outlaws developer Massive Entertainment and Ubisoft Stockholm face layoffs",
    "url": "https://www.engadget.com/gaming/star-wars-outlaws-developer-massive-entertainment-and-ubisoft-stockholm-face-layoffs-134234968.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2026-01-13T13:42:34.000Z",
    "summary_long": "We aren't even two weeks into the new year and Ubisoft is already looking to carry out its second round of layoffs in 2026. The company has informed workers at Massive Entertainment and Ubisoft Stockholm of a \"proposed organizational restructure\" that could affect around 55 roles across its two Swedish studios. Workers at Massive (the developer of The Division series, Star Wars Outlaws and Avatar: Frontiers of Pandora) were offered voluntary buyouts late last year as part of Ubisoft's ongoing cost-cutting efforts. \"This restructure follows the completion of the Voluntary Leave Program launched during the fall of 2025, a finalized long-term roadmap and a completed staffing and appointment process, which together have provided clearer visibility into the structure and capacity required to support the two studios’ work and sustainably over time,\" Ubisoft told IGN in a statement. Source: www.engadget.com. Date: 2026-01-13. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  }
]