[
  {
    "id": "bigtech:yikes internal emails reveal ticketmaster helped scalpers ja:2025-09-19T16:48:01.000Z",
    "title": "“Yikes”: Internal emails reveal Ticketmaster helped scalpers jack up prices, FTC says",
    "url": "https://arstechnica.com/tech-policy/2025/09/ticketmaster-intentionally-screwed-fans-out-of-billions-ftc-lawsuit-says/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-09-19T16:48:01.000Z",
    "summary_long": "The Federal Trade Commission sued Live Nation and Ticketmaster on Thursday, alleging that the companies tacitly worked with scalpers to profit from jacking up ticket prices on the secondary market. As the FTC alleged in a press release, Ticketmaster's years of turning a blind eye to scalpers violated the FTC Act and the Better Online Ticket Sales Act, costing customers \"billions in inflated prices and additional fees.\" Further, artists' efforts to keep event costs low were repeatedly frustrated by executives' greedy bid to drive Ticketmaster revenue by reaping as many additional fees as possible, the FTC alleged. Rather than blocking scalping, Ticketmaster allegedly provided tech support to help so-called brokers exceed \"fake\" ticket limits that seemingly only applied to genuine customers buying tickets to see events. Read full article Comments Source: arstechnica.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:starship will soon fly over towns and cities but will dodge :2025-09-20T00:18:44.000Z",
    "title": "Starship will soon fly over towns and cities, but will dodge the biggest ones",
    "url": "https://arstechnica.com/space/2025/09/starship-will-soon-fly-over-towns-and-cities-but-will-dodge-the-biggest-ones/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-09-20T00:18:44.000Z",
    "summary_long": "Some time soon, perhaps next year, SpaceX will attempt to fly one of its enormous Starship rockets from low-Earth orbit back to its launch pad in South Texas. A successful return and catch at the launch tower would demonstrate a key capability underpinning Elon Musk's hopes for a fully reusable rocket. In order for this to happen, SpaceX must overcome the tyranny of geography. Unlike launches over the open ocean from Cape Canaveral, Florida, rockets departing from South Texas must follow a narrow corridor to steer clear of downrange land masses. Source: arstechnica.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:in a win for science nasa told to use house budget as shutdo:2025-09-19T22:38:10.000Z",
    "title": "In a win for science, NASA told to use House budget as shutdown looms",
    "url": "https://arstechnica.com/space/2025/09/amid-budget-uncertainty-nasa-gets-some-good-news-use-house-funding-levels/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-09-19T22:38:10.000Z",
    "summary_long": "The situation with the fiscal year 2026 budget for the United States is, to put it politely, kind of a mess. The White House proposed a budget earlier this year with significant cuts for a number of agencies, including NASA. In the months since then, through the appropriations process, both the House and Senate have proposed their own budget templates. However, Congress has not passed a final budget, and the new fiscal year begins on October 1. Source: arstechnica.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bankrupt exchange ftx set to repay 16b to creditors starting:2025-09-19T20:02:19.000Z",
    "title": "Bankrupt Exchange FTX Set to Repay $1.6B to Creditors Starting on Sep. 30",
    "url": "https://www.coindesk.com/business/2025/09/19/bankrupt-exchange-ftx-set-to-repay-usd1-6b-to-creditors-starting-on-sep-30",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-09-19T20:02:19.000Z",
    "summary_long": "FTX’s bankruptcy estate is set to release $1.6 billion of funds to creditors at the end of the month, marking the third major payout following the crypto exchange's implosion nearly three years ago. The FTX Recovery Trust, which oversees the bankruptcy process, announced on Friday that payments will begin on September 30 for creditors who have completed verification steps on the FTX claims portal. Funds will be routed through service providers BitGo, Kraken or Payoneer and are expected to land in accounts within three business days. U.S. Source: www.coindesk.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bank of japans historic etf unwind sparks market selloff dip:2025-09-19T14:43:04.000Z",
    "title": "Bank of Japan's Historic ETF Unwind Sparks Market Sell-Off, Dip in Crypto",
    "url": "https://www.coindesk.com/markets/2025/09/19/bank-of-japan-s-historic-etf-unwind-sparks-market-selloff-dip-in-crypto",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "James Van Straten",
    "published_at": "2025-09-19T14:43:04.000Z",
    "summary_long": "The Bank of Japan (BOJ) spooked markets Friday by announcing it will begin unwinding its $250 billion in exchange traded funds (ETFs) and Japanese Real Estate Investment Trusts (JREITs), assets it accumulated since 2010 as part of its ultra-loose monetary policy. Under the plan, the central bank will sell ETFs with a book value of ¥330bn ($2.2 billion) annually, equivalent to ¥620bn ($4.2 billion) at market prices. BOJ Governor Kazuo Ueda stressed the pace would be deliberately slow, noting it would take more than a century to fully dispose of the holdings. The announcement came alongside a decision to hold the bank's benchmark rate at 0.5% by a 7-2 split vote. Source: www.coindesk.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:a beacon to space:2025-09-19T14:32:42.000Z",
    "title": "A Beacon to Space",
    "url": "https://www.nasa.gov/image-article/a-beacon-to-space/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2025-09-19T14:32:42.000Z",
    "summary_long": "NASA/JPL-Caltech In this infrared photograph taken on June 2, 2025, the Optical Communications Telescope Laboratory at NASA’s Jet Propulsion Laboratory’s Table Mountain Facility near Wrightwood, California, beams its eight-laser beacon to the Deep Space Optical Communications (DSOC) flight laser transceiver aboard NASA’s Psyche spacecraft. At the time, when Psyche was about 143 million miles (230 million kilometers) from Earth. Managed by JPL, DSOC successfully demonstrated that data encoded in laser photons could be reliably transmitted, received, and then decoded after traveling millions of miles from Earth out to Mars distances. Nearly two years after launching aboard the agency’s Psyche mission in 2023, the demonstration completed its 65th and final “pass” on Sept. Source: www.nasa.gov. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:grvt raises 19m to bring privacy and scale to onchain financ:2025-09-19T09:50:41.000Z",
    "title": "Grvt Raises $19M to Bring Privacy and Scale to On-Chain Finance",
    "url": "https://www.coindesk.com/business/2025/09/19/grvt-raises-usd19m-to-bring-privacy-and-scale-to-on-chain-finance",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jamie Crawley",
    "published_at": "2025-09-19T09:50:41.000Z",
    "summary_long": "Grvt (pronounced \"gravity\"), a decentralized exchange (DEX) focused on privacy in on-chain finance, has raised $19 million in Series A funding. The round was co-led by ZKsync, its foundational technology partner, along with Further Ventures, EigenCloud (formerly EigenLayer) and 500 Global, the company announced via email on Thursday. Built on the ZKsync Validium L2, Grvt uses zero-knowledge (ZK) proofs to ensure transactions inherit Ethereum-level security while keeping trade details private and settlement costs low. The company says this architecture addresses long-standing barriers to mainstream adoption of on-chain finance: privacy, scalability and accessibility. Source: www.coindesk.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas orion spacecraft secures critical abort system hardwar:2025-09-19T17:56:44.000Z",
    "title": "NASA’s Orion Spacecraft Secures Critical Abort System Hardware for Artemis II",
    "url": "https://www.nasa.gov/image-article/nasas-orion-spacecraft-secures-critical-abort-system-hardware-for-artemis-ii/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jason Costa",
    "published_at": "2025-09-19T17:56:44.000Z",
    "summary_long": "All the pieces are stacking up – literally – for NASA’s first crewed mission of the Artemis program coming in 2026. Teams are finishing integration of the Orion spacecraft for the Artemis II test flight with its launch abort system on Sept. 17 inside the Launch Abort System Facility at NASA’s Kennedy Space Center in Florida. The 44-foot-tall tower-like abort structure would swiftly carry the four-person crew inside Orion to safety in the unlikely event of an emergency during launch or ascent atop the SLS (Space Launch System) rocket. Source: www.nasa.gov. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:dropprinting shows potential for constructing bioelectronic :2025-09-19T16:31:03.000Z",
    "title": "'Drop-printing' shows potential for constructing bioelectronic interfaces that conform to complex surfaces",
    "url": "https://techxplore.com/news/2025-09-potential-bioelectronic-interfaces-conform-complex.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-19T16:31:03.000Z",
    "summary_long": "With the rapid development of wearable electronics, neurorehabilitation, and brain-machine interfaces in recent years, there has been an urgent need for methods to conformally wrap thin-film electronic devices onto biological tissues to enable precise acquisition and regulation of physiological signals. Source: techxplore.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:indie studio bets on new game after buying freedom from sega:2025-09-19T08:35:15.000Z",
    "title": "Indie studio bets on new game after buying freedom from Sega",
    "url": "https://techxplore.com/news/2025-09-indie-studio-game-buying-freedom.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-19T08:35:15.000Z",
    "summary_long": "Indie studio bets on new game after buying freedom from Sega Source: techxplore.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:the ancient mars variety show:2025-09-19T23:09:16.000Z",
    "title": "The Ancient Mars Variety Show",
    "url": "https://science.nasa.gov/blog/the-ancient-mars-variety-show/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-09-19T23:09:16.000Z",
    "summary_long": "Explore This Section * Perseverance Home * Mission Overview * Rover Components * Mars Rock Samples * Where is Perseverance? * Ingenuity Mars Helicopter * Mission Updates * Science * Overview * Objectives * Instruments * Highlights * Exploration Goals * News and Features * Multimedia * Perseverance Raw Images * Images * Videos * Audio * More Resources * Mars Missions * Mars Sample Return * Mars Perseverance Rover * Mars Curiosity Rover * MAVEN * Mars Reconnaissance Orbiter * Mars Odyssey * More Mars Missions * Mars Home Image of the “Peachflya” abrasion spot, from Perseverance’s WATSON Camera on sol 1620. NASA/JPL-Caltech Written by Melissa Rice, Professor of Planetary Science at Western Washington University Perseverance accomplished something unusual this week: abrading two dramatically different rocks within the span of a few days. While exploring the Vernodden area along Jezero crater’s rim, the rover has been studying what might be “megablocks,” a variety of ancient crustal materials with clues…",
    "tags": []
  },
  {
    "id": "nextfrontiers:hyundai says it will spend 27 billion expanding part of the :2025-09-19T08:10:06.000Z",
    "title": "Hyundai says it will spend $2.7 billion expanding part of the Georgia complex raided by ICE",
    "url": "https://techxplore.com/news/2025-09-hyundai-billion-georgia-complex-raided.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-19T08:10:06.000Z",
    "summary_long": "Hyundai says it will spend $2.7 billion expanding part of the Georgia complex raided by ICE Source: techxplore.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]