[
  {
    "id": "bigtech:horses deserves to be played even if it8217s not very good:2025-12-06T14:00:00.000Z",
    "title": "Horses deserves to be played, even if it&#8217;s not very good",
    "url": "https://www.theverge.com/games/839464/horses-review-santa-ragione-steam-epic-bans",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Ash Parrish",
    "published_at": "2025-12-06T14:00:00.000Z",
    "summary_long": "Horses has become the current face of the fight against video game censorship and what gets to be art. After getting banned from Steam and the Epic Game Store, the narrative horror game has become a bestseller on GOG.com, and has brought gamers of all stripes together in support of it. But as a game, Horses doesn't deserve all this - neither its bans nor, after playing it myself, all the glowing praise. Horses is a collaboration between indie studio Santa Ragione and Italian filmmaker Andrea Lucco Bolera. Source: www.theverge.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:french banking giant bpce to roll out crypto trading for 2m :2025-12-06T18:03:56.000Z",
    "title": "French Banking Giant BPCE to Roll Out Crypto Trading for 2M Retail Clients",
    "url": "https://www.coindesk.com/business/2025/12/06/french-banking-giant-bpce-to-roll-out-crypto-trading-for-2m-retail-clients",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-12-06T18:03:56.000Z",
    "summary_long": "French Banking Giant BPCE to Roll Out Crypto Trading for 2M Retail Clients Source: www.coindesk.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta plans to push back the debut of its next mixed reality :2025-12-06T17:24:37.000Z",
    "title": "Meta plans to push back the debut of its next mixed reality glasses to 2027",
    "url": "https://www.engadget.com/ar-vr/meta-plans-to-push-back-the-debut-of-its-next-mixed-reality-glasses-to-2027-172437374.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-12-06T17:24:37.000Z",
    "summary_long": "The big reveal for Meta's next mixed reality glasses is being postponed until the first half of 2027, according to a report from Business Insider. Based on an internal memo from Maher Saba, the vice president of Meta's Reality Labs Foundation, the report said that the company's project, which is codenamed \"Phoenix,\" will no longer be scheduled for a 2026 debut. In a separate memo, Meta execs explained that the delay would help deliver a more \"polished and reliable experience.\" According to BI, a memo from Meta's Gabriel Aul and Ryan Cairns said this new release window is \"going to give us a lot more breathing room to get this right.\" Meta hasn't publicly revealed many details about its Phoenix project, but The Information previously reported that it would feature a goggle-like form factor with an external power source, similar to how the Apple Vision Pro is attached to a battery pack. In the memo from Saba, BI reported that…",
    "tags": []
  },
  {
    "id": "bigtech:a massive chinesebacked port could push the amazon rainfores:2025-12-06T12:30:35.000Z",
    "title": "A massive, Chinese-backed port could push the Amazon Rainforest over the edge",
    "url": "https://arstechnica.com/science/2025/12/a-massive-chinese-backed-port-could-push-the-amazon-rainforest-over-the-edge/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Georgina Gustin, Inside Climate News\n                ",
    "published_at": "2025-12-06T12:30:35.000Z",
    "summary_long": "CHANCAY, Peru—The elevator doors leading to the fifth-floor control center open like stage curtains onto a theater-sized screen. This “Operations Productivity Dashboard” instantaneously displays a battery of data: vehicle locations, shipping times, entry times, loading data, unloading data, efficiency statistics. Most striking, though, are the bold lines arcing over the dashboard’s deep-blue Pacific—digital streaks illustrating the routes that lead thousands of miles across the ocean, from this unassuming city, to Asia’s biggest ports. Read full article Comments Source: arstechnica.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:apples chip chief might be the next exec to leave:2025-12-06T19:55:52.000Z",
    "title": "Apple’s chip chief might be the next exec to leave",
    "url": "https://www.theverge.com/news/839700/apples-chip-chief-might-be-the-next-exec-to-leave",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Terrence O’Brien",
    "published_at": "2025-12-06T19:55:52.000Z",
    "summary_long": "Bloomberg’s Mark Gurman is reporting that Johny Srouji, senior vice president of hardware technologies, told Tim Cook he is “seriously considering” leaving Apple for another company in the near future. It was reported in October that Srouji was “evaluating his future at the tech giant.” While nothing is confirmed, it seems the executive is leaning towards not having a future at Cupertino. If Srouji leaves, he would be just the latest in a string of high-profile shakeups in the company’s C-suite. COO Jeff Williams announced his retirement in July, which led to some shifting of roles. Source: www.theverge.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apples johny srouji could continue the companys executive ex:2025-12-06T20:07:50.000Z",
    "title": "Apple's Johny Srouji could continue the company's executive exodus, according to report",
    "url": "https://www.engadget.com/big-tech/apples-johny-srouji-could-continue-the-companys-executive-exodus-according-to-report-200750252.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-12-06T20:07:50.000Z",
    "summary_long": "Apple's Johny Srouji may be the latest company executive to seek greener pastures, according to a report from Bloomberg. The report said that Srouji, Apple's senior vice president of hardware technologies, told Tim Cook that he is \"seriously considering leaving in the near future.\" While the report didn't mention if Srouji has another job lined up, Bloomberg's sources claimed that he wants to join another company if he leaves Apple. Srouji joined the company in 2008 to develop Apple's first in-house system-on-a-chip and eventually led the transition to Apple silicon. If Srouji leaves Apple, he would be the latest in a string of departures of longtime execs. Source: www.engadget.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:how much longer until we consider the bitcoin power law mode:2025-12-06T15:00:00.000Z",
    "title": "How Much Longer Until We Consider the Bitcoin Power Law Model Invalid?",
    "url": "https://www.coindesk.com/markets/2025/12/05/how-much-longer-until-we-consider-the-bitcoin-power-law-model-invalid",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "James Van Straten",
    "published_at": "2025-12-06T15:00:00.000Z",
    "summary_long": "How Much Longer Until We Consider the Bitcoin Power Law Model Invalid? Source: www.coindesk.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:waymos robotaxi fleet is being recalled again this time for :2025-12-06T19:02:22.000Z",
    "title": "Waymo's robotaxi fleet is being recalled again, this time for failing to stop for school buses",
    "url": "https://www.engadget.com/transportation/waymos-robotaxi-fleet-is-being-recalled-again-this-time-for-failing-to-stop-for-school-buses-190222243.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-12-06T19:02:22.000Z",
    "summary_long": "To prevent its robotaxi fleet from passing stopped school buses, Waymo is issuing another software recall in 2025. While it's not a traditional recall that pulls vehicles from the road, Waymo is voluntarily updating software for its autonomous fleet in response to an investigation from the National Highway Traffic Safety Administration. According to Waymo, the recall will be filed with the federal agency early next week. Mauricio Peña, Waymo's chief safety officer, said in a statement that Waymo sees far fewer crashes involving pedestrians than human drivers, but that the company knows when \"our behavior should be better.\" \"As a result, we have made the decision to file a voluntary software recall with NHTSA related to appropriately slowing and stopping in these scenarios,\" Peña said in a statement to multiple news outlets. Source: www.engadget.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:railroads will be allowed to reduce inspections and rely mor:2025-12-06T11:43:39.000Z",
    "title": "Railroads will be allowed to reduce inspections and rely more on technology to spot track problems",
    "url": "https://techxplore.com/news/2025-12-railroads-technology-track-problems.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-06T11:43:39.000Z",
    "summary_long": "Railroads will be allowed to reduce inspections and rely more on technology to spot track problems Source: techxplore.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:georgia power says it needs a huge increase in power capacit:2025-12-06T11:40:51.000Z",
    "title": "Georgia Power says it needs a huge increase in power capacity to meet data center demand",
    "url": "https://techxplore.com/news/2025-12-georgia-power-huge-capacity-center.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-06T11:40:51.000Z",
    "summary_long": "With data centers flooding into Georgia, utility regulators face a big decision: Should they let Georgia Power Co. spend more than $15 billion to increase its electricity capacity by 50% over the next six years to serve computer complexes? Or could the utility overbuild and stick other ratepayers with the bill? Source: techxplore.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:state of crypto wrapping up the month:2025-12-06T22:56:32.000Z",
    "title": "State of Crypto: Wrapping Up the Month",
    "url": "https://www.coindesk.com/policy/2025/12/06/state-of-crypto-wrapping-up-the-month",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Nikhilesh De",
    "published_at": "2025-12-06T22:56:32.000Z",
    "summary_long": "State of Crypto: Wrapping Up the Month Source: www.coindesk.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]