[
  {
    "id": "bigtech:verizon starts requiring 365 days of paid service before it :2026-01-20T22:35:32.000Z",
    "title": "Verizon starts requiring 365 days of paid service before it will unlock phones",
    "url": "https://arstechnica.com/tech-policy/2026/01/verizon-starts-requiring-365-days-of-paid-service-before-it-will-unlock-phones/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2026-01-20T22:35:32.000Z",
    "summary_long": "Verizon has started enforcing a 365-day lock period on phones purchased through its TracFone division, one week after the Federal Communications Commission waived a requirement that Verizon unlock handsets 60 days after they are activated on its network. Verizon was previously required to unlock phones automatically after 60 days due to restrictions imposed on its spectrum licenses and merger conditions that helped Verizon obtain approval of its purchase of TracFone. But an update applied today to the TracFone unlocking policy said new phones will be locked for at least a year and that each customer will have to request an unlock instead of getting it automatically. The \"new\" TracFone policy is basically a return to the yearlong locking it imposed before Verizon bought the company in 2021. Source: arstechnica.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:zuck stuck on trumps bad side ftc appeals loss in meta monop:2026-01-20T23:22:26.000Z",
    "title": "Zuck stuck on Trump’s bad side: FTC appeals loss in Meta monopoly case",
    "url": "https://arstechnica.com/tech-policy/2026/01/zuck-stuck-on-trumps-bad-side-ftc-appeals-loss-in-meta-monopoly-case/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2026-01-20T23:22:26.000Z",
    "summary_long": "Still feeling uneasy about Meta's acquisition of Instagram in 2012 and WhatsApp in 2014, the Federal Trade Commission will be appealing a November ruling that cleared Meta of allegations that it holds an illegal monopoly in a market dubbed \"personal social networking.\" The FTC hopes the US Court of Appeals for the District of Columbia will agree that \"robust evidence at trial\" showed that Meta's acquisitions were improper. In the initial trial, the FTC sought a breakup of Meta's apps, with Meta risking forced divestments of Instagram or WhatsApp. In a press release Tuesday, the FTC confirmed that it \"continues to allege\" that \"for over a decade Meta has illegally maintained a monopoly in personal social networking services through anticompetitive conduct—by buying the significant competitive threats it identified in Instagram and WhatsApp.\" Read full article Comments Source: arstechnica.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:flesheating flies are eating their way through mexico cdc wa:2026-01-20T21:59:38.000Z",
    "title": "Flesh-eating flies are eating their way through Mexico, CDC warns",
    "url": "https://arstechnica.com/health/2026/01/be-on-the-lookout-for-flesh-eating-flies-cdc-tells-clinicians-in-alert/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2026-01-20T21:59:38.000Z",
    "summary_long": "The US Centers for Disease Control and Prevention issued a health alert to clinicians Tuesday, warning that the savage, flesh-eating parasitic fly—the New World Screwworm—is not only approaching the Texas border, but also felling an increasing number of animals in the bordering Mexican state of Tamaulipas. The advisory, released through the agency's Health Alert Network, directs doctors, veterinarians, and other health workers to be on the lookout for patients with wounds teeming with ferocious maggots burrowing into their living flesh. The alert also provides guidance on what to do if any such festering wounds are encountered—namely, remove each and every maggot to prevent the patient from dying, and, under no circumstance allow any of the parasites to survive and escape. The New World Screwworm (NWS) is a fly that lays its eggs—up to 400 at a time—in the wounds, orifices, and mucus membranes of any warm-blooded animal. Source: arstechnica.com. Date: 2026-01-20.",
    "tags": []
  },
  {
    "id": "ai_data:torchsla differentiable sparse linear algebra with adjoint s:2026-01-20T14:06:01.000Z",
    "title": "torch-sla: Differentiable Sparse Linear Algebra with Adjoint Solvers and Sparse Tensor Parallelism for PyTorch",
    "url": "https://arxiv.org/abs/2601.13994v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Mingyuan Chi",
    "published_at": "2026-01-20T14:06:01.000Z",
    "summary_long": "Industrial scientific computing predominantly uses sparse matrices to represent unstructured data -- finite element meshes, graphs, point clouds. We present \\torchsla{}, an open-source PyTorch library that enables GPU-accelerated, scalable, and differentiable sparse linear algebra. The library addresses three fundamental challenges: (1) GPU acceleration for sparse linear solves, nonlinear solves (Newton, Picard, Anderson), and eigenvalue computation; (2) Multi-GPU scaling via domain decomposition with halo exchange, reaching \\textbf{400 million DOF linear solve on 3 GPUs}; and (3) Adjoint-based differentiation} achieving $\\mathcal{O}(1)$ computational graph nodes (for autograd) and $\\mathcal{O}(\\text{nnz})$ memory -- independent of solver iterations. \\torchsla{} supports multiple backends (SciPy, cuDSS, PyTorch-native) and seamlessly integrates with PyTorch autograd for end-to-end differentiable simulations. Source: arxiv.org. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:horizon 1000 advancing ai for primary healthcare:2026-01-20T21:00:00.000Z",
    "title": "Horizon 1000: Advancing AI for primary healthcare",
    "url": "https://openai.com/index/horizon-1000",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-01-20T21:00:00.000Z",
    "summary_long": "Horizon 1000: Advancing AI for primary healthcare Source: openai.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:stargate community:2026-01-20T19:00:00.000Z",
    "title": "Stargate Community",
    "url": "https://openai.com/index/stargate-community",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-01-20T19:00:00.000Z",
    "summary_long": "Stargate Community Source: openai.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:research reveals a surprising line of defense against cyber :2026-01-20T23:50:01.000Z",
    "title": "Research reveals a surprising line of defense against cyber attacks: Accountants",
    "url": "https://techxplore.com/news/2026-01-reveals-line-defense-cyber-accountants.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-20T23:50:01.000Z",
    "summary_long": "When Optus, Medibank and non-bank lender Latitude Financial were hit by separate cyber attacks in the past few years, millions of Australians felt the fallout: stolen personal data, disrupted services and weeks of uncertainty. Each breach raised the same uncomfortable question: how can this keep happening? Source: techxplore.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the ftc isnt giving up on its antitrust case against meta:2026-01-20T22:50:20.000Z",
    "title": "The FTC isn't giving up on its antitrust case against Meta",
    "url": "https://www.engadget.com/big-tech/the-ftc-isnt-giving-up-on-its-antitrust-case-against-meta-225020769.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Karissa Bell",
    "published_at": "2026-01-20T22:50:20.000Z",
    "summary_long": "The Federal Trade Commission lost its antitrust case against Meta last year, but the regulator hasn't given up on its attempts to punish the social media company for its acquisitions of WhatsApp and Instagram. The FTC is appealing a ruling last year in which a federal judge found that the government hadn't proven that Meta is currently operating as a monopoly. \"Meta has maintained its dominant position and record profits for well over a decade not through legitimate competition, but by buying its most significant competitive threats,\" the FTC's Bureau of Competition Director Daniel Guarnera said in a statement. \"The Trump-Vance FTC will continue fighting its historic case against Meta to ensure that competition can thrive across the country to the benefit of all Americans and U.S. Source: www.engadget.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:openai is launching age prediction for chatgpt accounts:2026-01-20T22:26:50.000Z",
    "title": "OpenAI is launching age prediction for ChatGPT accounts",
    "url": "https://www.engadget.com/ai/openai-is-launching-age-prediction-for-chatgpt-accounts-222650340.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-20T22:26:50.000Z",
    "summary_long": "OpenAI is the latest company to hop on the bandwagon of gating access by users' age. The AI business is beginning a global rollout of an age prediction tool to determine whether or not a user is a minor. “The model looks at a combination of behavioral and account-level signals, including how long an account has existed, typical times of day when someone is active, usage patterns over time,and a user’s stated age,” the company’s announcement states. If an individual is incorrectly characterized by ChatGPT as underage, they will need to submit a selfie to correct the mistake through the Persona age verification platform. Source: www.engadget.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas sls rocket secondary payloads:2026-01-20T18:56:53.000Z",
    "title": "NASA’s SLS Rocket: Secondary Payloads",
    "url": "https://www.nasa.gov/image-article/nasas-sls-rocket-secondary-payloads/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lee Mohon",
    "published_at": "2026-01-20T18:56:53.000Z",
    "summary_long": "When NASA’s SLS (Space Launch System) rocket launches the agency’s Artemis II mission to the Moon, four CubeSats, or small satellites, will be hitching a ride inside the rocket’s Orion stage adapter (OSA). All four Artemis II CubeSats are provided by countries that are signatories of the Artemis Accords. Payload deployment, which begins approximately five hours after launch, is controlled by the avionics unit. Image Credit: NASA/Kevin O’Brien Source: www.nasa.gov. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa unlocks golden age of innovation exploration in trumps :2026-01-20T17:56:10.000Z",
    "title": "NASA Unlocks Golden Age of Innovation, Exploration in Trump’s First Year",
    "url": "https://www.nasa.gov/news-release/nasa-unlocks-golden-age-of-innovation-exploration-in-trumps-first-year/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jennifer M. Dooren",
    "published_at": "2026-01-20T17:56:10.000Z",
    "summary_long": "NASA’s SLS (Space Launch System) and Orion spacecraft rolled out of the Vehicle Assembly Building at the agency’s Kennedy Space Center in Florida on Saturday, Jan. 17, 2026 in preparation for the Artemis II mission. Credit: NASA/Brandon Hancock One year into President Donald J. Trump’s second term, NASA is delivering measurable progress across human spaceflight, science, aeronautics, and cutting-edge technology. Source: www.nasa.gov. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:sony is handing control of its bravia tv business to chinas :2026-01-20T12:10:04.000Z",
    "title": "Sony is handing control of its Bravia TV business to China's TCL",
    "url": "https://www.engadget.com/home/home-theater/sony-is-handing-control-of-its-bravia-tv-business-to-chinas-tcl-120957252.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2026-01-20T12:10:04.000Z",
    "summary_long": "Sony is ceding control of its Bravia TV brand to China's TCL as part of a new \"strategic partnership,\" the companies announced in a joint press release. The Japanese electronics giant plans to sell a majority 51 percent stake in its home entertainment arm to TCL, while retaining a 49 percent share. The joint venture is set to start operations in April 2027, pending regulatory and other approvals. The new combined business will sell TVs carrying Sony and Bravia branding while using TCL's display technology. Source: www.engadget.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]