[
  {
    "id": "bigtech:people complaining about windows 11 hasnt stopped it from hi:2026-01-29T22:46:59.000Z",
    "title": "People complaining about Windows 11 hasn't stopped it from hitting 1 billion users",
    "url": "https://arstechnica.com/gadgets/2026/01/windows-11-has-hit-1-billion-users-just-a-hair-faster-than-windows-10-did/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-01-29T22:46:59.000Z",
    "summary_long": "Complaining about Windows 11 is a popular sport among tech enthusiasts on the Internet, whether you're publicly switching to Linux, publishing guides about the dozens of things you need to do to make the OS less annoying, or getting upset because you were asked to sign in to an app after clicking a sign-in button. Despite the negativity surrounding the current version of Windows, it remains the most widely used operating system on the world's desktop and laptop computers, and people usually prefer to stick to what they're used to. As a result, Windows 11 has just cleared a big milestone—Microsoft CEO Satya Nadella said on the company's most recent earnings call (via The Verge) that Windows 11 now has over 1 billion users worldwide. Windows 11 also reached that milestone just a few months quicker than Windows 10 did—1,576 days after its initial public launch on October 5, 2021. Source: arstechnica.com. Date: 2026-01-29.",
    "tags": []
  },
  {
    "id": "bigtech:shell mess with texas nurse keeps mailing abortion pills des:2026-01-29T19:19:11.000Z",
    "title": "She'll mess with Texas: Nurse keeps mailing abortion pills, despite Paxton lawsuit",
    "url": "https://arstechnica.com/tech-policy/2026/01/i-dont-fear-ken-paxton-nurse-vows-to-keep-shipping-abortion-pills-to-texas/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2026-01-29T19:19:11.000Z",
    "summary_long": "A Texas fight with a nurse practitioner may eventually push the Supreme Court to settle an intensifying battle between states with strict abortion-ban laws and those with shield laws to protect abortion providers supporting out-of-state patients. In a lawsuit filed Tuesday, Texas Attorney General Ken Paxton accused Debra Lynch, a Delaware-based nurse practitioner, of breaking Texas laws by shipping abortion pills that Lynch once estimated last January facilitated \"up to 162 abortions per week\" in the state. \"No one, regardless of where they live, will be freely allowed to aid in the murder of unborn children in Texas,\" Paxton's press release said. Read full article Comments Source: arstechnica.com. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:new openai tool renews fears that ai slop will overwhelm sci:2026-01-29T17:51:49.000Z",
    "title": "New OpenAI tool renews fears that “AI slop” will overwhelm scientific research",
    "url": "https://arstechnica.com/ai/2026/01/new-openai-tool-renews-fears-that-ai-slop-will-overwhelm-scientific-research/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2026-01-29T17:51:49.000Z",
    "summary_long": "On Tuesday, OpenAI released a free AI-powered workspace for scientists. It's called Prism, and it has drawn immediate skepticism from researchers who fear the tool will accelerate the already overwhelming flood of low-quality papers into scientific journals. The launch coincides with growing alarm among publishers about what many are calling \"AI slop\" in academic publishing. To be clear, Prism is a writing and formatting tool, not a system for conducting research itself, though OpenAI's broader pitch blurs that line. Source: arstechnica.com. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:inside openais inhouse data agent:2026-01-29T10:00:00.000Z",
    "title": "Inside OpenAI’s in-house data agent",
    "url": "https://openai.com/index/inside-our-in-house-data-agent",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-01-29T10:00:00.000Z",
    "summary_long": "Inside OpenAI’s in-house data agent Source: openai.com. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa johnson celebrates 25 years in space with community day:2026-01-30T03:16:36.000Z",
    "title": "NASA Johnson Celebrates 25 Years in Space with Community Day",
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/nasa-johnson-celebrates-25-years-in-space-with-community-day/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Sumer Loggins",
    "published_at": "2026-01-30T03:16:36.000Z",
    "summary_long": "NASA’s Johnson Space Center brought the International Space Station’s 25-year legacy to the public on Jan. 24, 2026, during a community day event in Houston. Johnson’s visitor center, Space Center Houston, hosted the celebration commemorating 25 years of continuous human presence in space. For a quarter century, astronauts have lived and worked aboard the orbiting laboratory, advancing science, strengthening international partnerships, and shaping the future of exploration beyond low Earth orbit. Source: www.nasa.gov. Date: 2026-01-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasaisro radar mission peers through clouds to see mississip:2026-01-29T20:57:25.000Z",
    "title": "NASA-ISRO Radar Mission Peers Through Clouds to See Mississippi River Delta",
    "url": "https://www.nasa.gov/missions/nisar/nasa-isro-radar-mission-peers-through-clouds-to-see-mississippi-river-delta/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "scarney1",
    "published_at": "2026-01-29T20:57:25.000Z",
    "summary_long": "6 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) A new image from the NISAR mission shows off the satellite’s ability to reveal details of Earth’s surfaces. The science team also released new sample data. A U.S.-Indian Earth satellite’s ability to see through clouds, revealing insights and characteristics of our planet’s surface, is on display in a colorful, newly released image showing the Mississippi River Delta region in southeastern Louisiana. Created with data collected by the NISAR (NASA-ISRO Synthetic Aperture Radar) satellite in late fall, the image shows the cities of New Orleans and Baton Rouge, the Mississippi River, Lake Pontchartrain, and a diversity of wetlands, farmland, forests, and communities. Source: www.nasa.gov. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch overnight starlink flight as :2026-01-30T04:43:22.000Z",
    "title": "Live coverage: SpaceX to launch overnight Starlink flight as it unveils new ‘Stargaze’ space situational awareness system",
    "url": "https://spaceflightnow.com/2026/01/30/live-coverage-spacex-starlink-flight-comes-as-it-unveils-new-stargaze-space-situational-awareness-system/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-30T04:43:22.000Z",
    "summary_long": "SpaceX is preparing for its 13th and final Falcon 9 rocket launch of the month, which is scheduled to fly from Cape Canaveral Space Force Station on Thursday night. The Starlink 6-101 mission will add another 29 broadband internet satellites to SpaceX’s low Earth orbit megaconstellation. Prior to liftoff, the company had more than 9,500 satellites in orbit, according to stats maintained by Dr. Johnathan McDowell, an expert orbital tracker and astronomer. Source: spaceflightnow.com. Date: 2026-01-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:waymo gears up to launch robotaxis in london this year:2026-01-29T19:30:01.000Z",
    "title": "Waymo gears up to launch robotaxis in London this year",
    "url": "https://techxplore.com/news/2026-01-waymo-gears-robotaxis-london-year.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-29T19:30:01.000Z",
    "summary_long": "Waymo gears up to launch robotaxis in London this year Source: techxplore.com. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:sina a circuit schematic imagetonetlist generator using arti:2026-01-29T18:41:52.000Z",
    "title": "SINA: A Circuit Schematic Image-to-Netlist Generator Using Artificial Intelligence",
    "url": "https://arxiv.org/abs/2601.22114v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Saoud Aldowaish",
    "published_at": "2026-01-29T18:41:52.000Z",
    "summary_long": "Current methods for converting circuit schematic images into machine-readable netlists struggle with component recognition and connectivity inference. In this paper, we present SINA, an open-source, fully automated circuit schematic image-to-netlist generator. SINA integrates deep learning for accurate component detection, Connected-Component Labeling (CCL) for precise connectivity extraction, and Optical Character Recognition (OCR) for component reference designator retrieval, while employing a Vision-Language Model (VLM) for reliable reference designator assignments. In our experiments, SINA achieves 96.47% overall netlist-generation accuracy, which is 2.72x higher than state-of-the-art approaches. Source: arxiv.org. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:heterogeneous computing the key to powering the future of ai:2026-01-29T17:11:46.000Z",
    "title": "Heterogeneous Computing: The Key to Powering the Future of AI Agent Inference",
    "url": "https://arxiv.org/abs/2601.22001v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yiren Zhao",
    "published_at": "2026-01-29T17:11:46.000Z",
    "summary_long": "AI agent inference is driving an inference heavy datacenter future and exposes bottlenecks beyond compute - especially memory capacity, memory bandwidth and high-speed interconnect. We introduce two metrics - Operational Intensity (OI) and Capacity Footprint (CF) - that jointly explain regimes the classic roofline analysis misses, including the memory capacity wall. Across agentic workflows (chat, coding, web use, computer use) and base model choices (GQA/MLA, MoE, quantization), OI/CF can shift dramatically, with long context KV cache making decode highly memory bound. These observations motivate disaggregated serving and system level heterogeneity: specialized prefill and decode accelerators, broader scale up networking, and decoupled compute-memory enabled by optical I/O. Source: arxiv.org. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:honda vehicles used to proactively report road safety issues:2026-01-29T15:16:30.000Z",
    "title": "Honda vehicles used to proactively report road safety issues in nation-first pilot",
    "url": "https://www.engadget.com/transportation/honda-vehicles-used-to-proactively-report-road-safety-issues-in-nation-first-pilot-151629967.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-01-29T15:16:30.000Z",
    "summary_long": "Honda and DriveOhio have teamed up on a new road safety initiative in which Honda vehicles are being used to collect real-time data that can advise about potential issues and road deficiencies before they become a problem. Honda’s Proactive Roadway Maintenance System, which has been in prototyping since 2021, uses \"advanced vision and LiDAR sensors\" to identify issues such as worn or obstructed road signs, damaged guardrails, rough roads and emerging potholes. During the pilot, members of the Ohio Department of Transportation’s smart mobility hub drove the test vehicles on around 3,000 miles of road in central and southeastern Ohio. They covered a mix of urban and rural environments, in varying weather conditions and at different times of the day. Source: www.engadget.com. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crypto custody firm copper in early talks for ipo as crypto :2026-01-29T15:55:25.000Z",
    "title": "Crypto custody firm Copper in early talks for IPO as crypto 'plumbing' becomes new Wall Street favorite",
    "url": "https://www.coindesk.com/business/2026/01/26/crypto-custody-firm-copper-in-early-talks-for-ipo-as-crypto-plumbing-becomes-new-wall-street-favorite",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2026-01-29T15:55:25.000Z",
    "summary_long": "Crypto custody firm Copper in early talks for IPO as crypto 'plumbing' becomes new Wall Street favorite Source: www.coindesk.com. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]