[
  {
    "id": "bigtech:investors commit quarterbillion dollars to startup designing:2025-12-12T15:23:57.000Z",
    "title": "Investors commit quarter-billion dollars to startup designing “Giga” satellites",
    "url": "https://arstechnica.com/science/2025/12/investors-commit-quarter-billion-dollars-to-startup-designing-giga-satellites/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-12-12T15:23:57.000Z",
    "summary_long": "A startup established three years ago to churn out a new class of high-power satellites has raised $250 million to ramp up production at its Southern California factory. The company, named K2, announced the cash infusion on Thursday. K2’s Series C fundraising round was led by Redpoint Ventures, with additional funding from investment firms in the United States, the United Kingdom, and Germany. K2 has now raised more than $400 million since its founding in 2022 and is on track to launch its first major demonstration mission next year, officials said. Source: arstechnica.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:scientists built an ai copilot for prosthetic bionic hands:2025-12-12T19:14:31.000Z",
    "title": "Scientists built an AI co-pilot for prosthetic bionic hands",
    "url": "https://arstechnica.com/ai/2025/12/scientists-built-an-ai-co-pilot-for-prosthetic-bionic-hands/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jacek Krywko\n                ",
    "published_at": "2025-12-12T19:14:31.000Z",
    "summary_long": "Modern bionic hand prostheses nearly match their natural counterparts when it comes to dexterity, degrees of freedom, and capability. And many amputees who tried advanced bionic hands apparently didn’t like them. “Up to 50 percent of people with upper limb amputation abandon these prostheses, never to use them again,” says Jake George, an electrical and computer engineer at the University of Utah. The main issue with bionic hands that drives users away from them, George explains, is that they’re difficult to control. Source: arstechnica.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:rocket report neutrons hungry hippo is deemed ready whither :2025-12-12T12:00:49.000Z",
    "title": "Rocket Report: Neutron’s Hungry Hippo is deemed ready, whither Orbex?",
    "url": "https://arstechnica.com/space/2025/12/rocket-report-neutrons-hungry-hippo-is-deemed-ready-whither-orbex/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-12-12T12:00:49.000Z",
    "summary_long": "Welcome to Edition 8.22 of the Rocket Report! The big news this week concerns the decision by SpaceX founder Elon Musk to take the company public, via IPO, sometime within the next 12 to 18 months. Musk confirmed this after Ars published a story on Wednesday evening. This understandably raises questions about whether a future SpaceX will be committed more to AI data centers in space or Mars settlement. Source: arstechnica.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:new system efficiently explains ai judgments in realtime:2025-12-12T19:40:04.000Z",
    "title": "New system efficiently explains AI judgments in real-time",
    "url": "https://techxplore.com/news/2025-12-efficiently-ai-judgments-real.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-12T19:40:04.000Z",
    "summary_long": "A research team led by Professor Jaesik Choi of KAIST's Kim Jaechul Graduate School of AI, in collaboration with KakaoBank Corp, has developed an accelerated explanation technology that can explain the basis of an artificial intelligence (AI) model's judgment in real-time. Source: techxplore.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:a rare gourd:2025-12-12T15:18:51.000Z",
    "title": "A Rare Gourd",
    "url": "https://www.nasa.gov/image-article/a-rare-gourd/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Gary Daines",
    "published_at": "2025-12-12T15:18:51.000Z",
    "summary_long": "Image credit: ESA/Hubble & NASA; Acknowledgement: Judy Schmidt NASA’s Hubble Space Telescope captured an uncommon sight – the death of a low-mass star – in this image of the Calabash Nebula released on Feb. 3, 2017. Here, we can see the star going through a rapid transformation from a red giant to a planetary nebula, during which it blows its outer layers of gas and dust out into the surrounding space. The recently ejected material is spat out in opposite directions with immense speed — the gas shown in yellow is moving close to a million kilometers an hour. Source: www.nasa.gov. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa announces plan to map milky way with roman space telesc:2025-12-12T15:00:00.000Z",
    "title": "NASA Announces Plan to Map Milky Way With Roman Space Telescope",
    "url": "https://www.nasa.gov/missions/roman-space-telescope/nasa-announces-plan-to-map-milky-way-with-roman-space-telescope/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Ashley Balzer",
    "published_at": "2025-12-12T15:00:00.000Z",
    "summary_long": "NASA’s Nancy Grace Roman Space Telescope team has released detailed plans for a major survey that will reveal our home galaxy, the Milky Way, in unprecedented detail. In one month of observations spread across two years, the survey will unveil tens of billions of stars and explore previously uncharted structures. “The Galactic Plane Survey will revolutionize our understanding of the Milky Way,” said Julie McEnery, Roman’s senior project scientist at NASA’s Goddard Space Flight Center in Greenbelt, Maryland. “We’ll be able to explore the mysterious far side of our galaxy and its star-studded heart. Source: www.nasa.gov. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:reddit sues australia over underage social media ban:2025-12-12T14:30:18.000Z",
    "title": "Reddit sues Australia over underage social media ban",
    "url": "https://www.engadget.com/social-media/reddit-sues-australia-over-underage-social-media-ban-143018208.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2025-12-12T14:30:18.000Z",
    "summary_long": "Reddit has filed a lawsuit in Australia's High Court aiming to overturn the country's under-16 social media ban, Reuters reported. The forum platform called the law contrary to Australia's constitution as it intrudes on free political discourse. It also argued that Reddit shouldn't have been included in the ban since it isn't a social media site, based on the law's definition. The action is likely to set in motion a protracted legal battle, given Reddit's resources and its popularity in Australia Australia's minimum age social media ban, the first of its kind in the world, went into effect on December 10. Source: www.engadget.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:five crypto firms win initial approvals as trust banks inclu:2025-12-12T16:39:19.000Z",
    "title": "Five Crypto Firms Win Initial Approvals as Trust Banks, Including Ripple, Circle, BitGo",
    "url": "https://www.coindesk.com/policy/2025/12/12/five-crypto-firms-step-closer-to-become-a-bank-including-ripple-circle-fidelity",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-12-12T16:39:19.000Z",
    "summary_long": "Five Crypto Firms Win Initial Approvals as Trust Banks, Including Ripple, Circle, BitGo Source: www.coindesk.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:why does netflix want to buy warner bros to copy not kill tr:2025-12-12T14:42:13.000Z",
    "title": "Why does Netflix want to buy Warner Bros? To copy, not kill, traditional TV",
    "url": "https://techxplore.com/news/2025-12-netflix-buy-warner-bros-traditional.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-12T14:42:13.000Z",
    "summary_long": "The recent news that Netflix has agreed to buy part of Warner Bros Discovery (WBD) for US$83 billion (£61.8 billion), followed by Paramount Global's hostile counterbid to acquire WBD in its entirety for US$108.4 billion, has triggered shockwaves through Hollywood and the wider entertainment industry. Source: techxplore.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:ripple payments lands first european bank client in amina:2025-12-12T11:53:12.000Z",
    "title": "Ripple Payments Lands First European Bank Client in AMINA",
    "url": "https://www.coindesk.com/markets/2025/12/12/ripple-payments-lands-first-european-bank-client-in-amina",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Shaurya Malwa",
    "published_at": "2025-12-12T11:53:12.000Z",
    "summary_long": "Ripple Payments Lands First European Bank Client in AMINA Source: www.coindesk.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:southeast asia seeks its place in space:2025-12-12T11:00:00.000Z",
    "title": "Southeast Asia seeks its place in space",
    "url": "https://www.technologyreview.com/2025/12/12/1129235/dispatch-thai-space-expo-southeast-asia-exploration/",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "www.technologyreview.com",
    "author": "Jonathan O'Callaghan",
    "published_at": "2025-12-12T11:00:00.000Z",
    "summary_long": "It’s a scorching October day in Bangkok and I’m wandering through the exhibits at the Thai Space Expo, held in one of the city’s busiest shopping malls, when I do a double take. Amid the flashy space suits and model rockets on display, there’s a plain-looking package of Thai basil chicken. I’m told the same kind of vacuum-­sealed package has just been launched to the International Space Station. “This is real chicken that we sent to space,” says a spokesperson for the business behind the stunt, Charoen Pokphand Foods, the biggest food company in Thailand. Source: www.technologyreview.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:wwe saturday nights main event how to watch john cenas final:2025-12-12T23:55:37.000Z",
    "title": "WWE Saturday Night's Main Event: How to watch John Cena's final match for free",
    "url": "https://www.engadget.com/entertainment/streaming/wwe-saturday-nights-main-event-how-to-watch-john-cenas-final-match-for-free-235537779.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Uncrowned Staff,Liz Kocan",
    "published_at": "2025-12-12T23:55:37.000Z",
    "summary_long": "John Cena began his WWE retirement tour back in January, and it's coming to an end this weekend when the wrestling legend headlines WWE Saturday Night's Main Event. For the last fight of his career, Cena has been matched up with \"The Ring General\" Gunther on the night's fight card, which also features matches between Cody Rhodes and Oba Femi, a tag team match featuring AJ Styles & Dragon Lee vs. Je'Von Evans & Leon Slater, and a women's matchup between Bayley and Sol Ruca. This show starts at 8 p.m. Source: www.engadget.com. Date: 2025-12-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]