[
  {
    "id": "bigtech:discord faces backlash over age checks after data breach exp:2026-02-09T19:39:22.000Z",
    "title": "Discord faces backlash over age checks after data breach exposed 70,000 IDs",
    "url": "https://arstechnica.com/tech-policy/2026/02/discord-faces-backlash-over-age-checks-after-data-breach-exposed-70000-ids/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2026-02-09T19:39:22.000Z",
    "summary_long": "Discord is facing backlash after announcing that all users will soon be required to verify ages to access adult content by sharing video selfies or uploading government IDs. According to Discord, it's relying on AI technology that verifies age on the user's device, either by evaluating a user's facial structure or by comparing a selfie to a government ID. Although government IDs will be checked off-device, the selfie data will never leave the user's device, Discord emphasized. Both forms of data will be promptly deleted after the user's age is estimated. Source: arstechnica.com. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:tem raises 75m to remake electricity markets using ai:2026-02-10T03:01:00.000Z",
    "title": "Tem raises $75M to remake electricity markets using AI",
    "url": "https://techcrunch.com/2026/02/09/tem-raises-75m-to-remake-electricity-markets-using-ai/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Tim De Chant",
    "published_at": "2026-02-10T03:01:00.000Z",
    "summary_long": "Tem raises $75M to remake electricity markets using AI Source: techcrunch.com. Date: 2026-02-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:mrbeast just bought a banking app:2026-02-09T22:14:13.000Z",
    "title": "MrBeast just bought a banking app",
    "url": "https://www.theverge.com/tech/876080/mrbeast-step-mobile-banking-app",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Stevie Bonifield",
    "published_at": "2026-02-09T22:14:13.000Z",
    "summary_long": "Beast Industries, owned by YouTuber Jimmy \"MrBeast\" Donaldson, announced on Monday that it has acquired Step, a banking app designed for teens and young adults. The move comes a couple of months after Donaldson announced plans to start a new YouTube channel centered on personal finance and investing. MrBeast's other business ventures also include a chain of ghost restaurants, the Feastables snack brand, and an upcoming phone service company called Beast Mobile. This is … Read the full story at The Verge. Source: www.theverge.com. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:shapecond fast shapeletguided dataset condensation for time :2026-02-09T18:53:08.000Z",
    "title": "ShapeCond: Fast Shapelet-Guided Dataset Condensation for Time Series Classification",
    "url": "https://arxiv.org/abs/2602.09008v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sijia Peng",
    "published_at": "2026-02-09T18:53:08.000Z",
    "summary_long": "Time series data supports many domains (e.g., finance and climate science), but its rapid growth strains storage and computation. Dataset condensation can alleviate this by synthesizing a compact training set that preserves key information. Yet most condensation methods are image-centric and often fail on time series because they miss time-series-specific temporal structure, especially local discriminative motifs such as shapelets. In this work, we propose ShapeCond, a novel and efficient condensation framework for time series classification that leverages shapelet-based dataset knowledge via a shapelet-guided optimization strategy. Source: arxiv.org. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:data science and technology towards agi part i tiered data m:2026-02-09T18:47:51.000Z",
    "title": "Data Science and Technology Towards AGI Part I: Tiered Data Management",
    "url": "https://arxiv.org/abs/2602.09003v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yudong Wang",
    "published_at": "2026-02-09T18:47:51.000Z",
    "summary_long": "The development of artificial intelligence can be viewed as an evolution of data-driven learning paradigms, with successive shifts in data organization and utilization continuously driving advances in model capability. Current LLM research is dominated by a paradigm that relies heavily on unidirectional scaling of data size, increasingly encountering bottlenecks in data availability, acquisition cost, and training efficiency. In this work, we argue that the development of AGI is entering a new phase of data-model co-evolution, in which models actively guide data management while high-quality data, in turn, amplifies model capabilities. To implement this vision, we propose a tiered data management framework, designed to support the full LLM training lifecycle across heterogeneous learning objectives and cost constraints. Source: arxiv.org. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:corefine confidenceguided selfrefinement for adaptive testti:2026-02-09T17:44:41.000Z",
    "title": "CoRefine: Confidence-Guided Self-Refinement for Adaptive Test-Time Compute",
    "url": "https://arxiv.org/abs/2602.08948v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Chen Jin",
    "published_at": "2026-02-09T17:44:41.000Z",
    "summary_long": "Large Language Models (LLMs) often rely on test-time scaling via parallel decoding (for example, 512 samples) to boost reasoning accuracy, but this incurs substantial compute. We introduce CoRefine, a confidence-guided self-refinement method that achieves competitive accuracy using a fraction of the tokens via a lightweight 211k-parameter Conv1D controller atop a frozen LLM. The controller consumes full-trace confidence to decide whether to halt, re-examine, or try a different approach, enabling targeted self-correction with an average of 2.7 refinement steps per problem and roughly 190-fold token reduction relative to 512-sample baselines. Across diverse reasoning benchmarks and three open-source models, the controller achieves 92.6 percent precision when it confidently halts, indicating that confidence dynamics reliably signal correctness without ground-truth verification. Source: arxiv.org. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:what you need to know about nasas spacex crew12 mission:2026-02-09T22:14:29.000Z",
    "title": "What You Need to Know About NASA’s SpaceX Crew-12 Mission",
    "url": "https://www.nasa.gov/missions/station/what-you-need-to-know-about-nasas-spacex-crew-12-mission/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Joseph Zakrzewski",
    "published_at": "2026-02-09T22:14:29.000Z",
    "summary_long": "jsc2026e004045 (Oct. 17, 2025) — The four members of NASA’s SpaceX Crew-12 mission to the International Space Station pose together for an official crew portrait. From left are, Roscosmos cosmonaut and Mission Specialist Andrey Fedyaev, NASA astronauts Jessica Meir and Jack Hathaway, Commander and Pilot respectively, and ESA (European Space Agency) astronaut and Mission Specialist Sophie Adenot. NASA Four crew members are set to launch to the International Space Station as part of NASA’s SpaceX Crew-12 mission, where they will conduct research, technology demonstrations, and maintenance aboard the orbiting laboratory. Source: www.nasa.gov. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:weather delays nasas spacex crew12 flight to the internation:2026-02-09T22:09:35.000Z",
    "title": "Weather delays NASA’s SpaceX Crew-12 flight to the International Space Station",
    "url": "https://spaceflightnow.com/2026/02/09/weather-delays-nasas-spacex-crew-12-flight-to-the-international-space-station/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-02-09T22:09:35.000Z",
    "summary_long": "The launch of the next crew rotation mission to the International Space Station will have to wait at least another day after NASA and SpaceX leadership determined weather along the flight path would be unacceptable. Leaders moved the launch of Crew-12 from pad 40 at Cape Canaveral Space Force Station to no earlier than Thursday, Feb. 12. That would place liftoff at 5:38 a.m. Source: spaceflightnow.com. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:riot games is laying off half of the 2xko development team:2026-02-09T21:54:23.000Z",
    "title": "Riot Games is laying off half of the 2XKO development team",
    "url": "https://www.engadget.com/gaming/riot-games-is-laying-off-half-of-the-2xko-development-team-215423279.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-02-09T21:54:23.000Z",
    "summary_long": "Another day, another wave of gaming layoffs. Today it's Riot Games with the announcement that it's cutting jobs on its pair-based fighting game 2XKO. For context, a representative from Riot confirmed to Game Developer that about 80 people are being cut, or roughly half of 2XKO's global development team. \"As we expanded from PC to console, we saw consistent trends in how players were engaging with 2XKO,\" according to the blog post from executive producer Tom Cannon. Source: www.engadget.com. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:farcaster founders join stablecoin startup tempo after neyna:2026-02-09T19:34:50.000Z",
    "title": "Farcaster founders join stablecoin startup Tempo after Neynar acquires social protocol",
    "url": "https://www.coindesk.com/business/2026/02/09/farcaster-founders-join-stablecoin-startup-tempo-after-neynar-acquires-social-protocol",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2026-02-09T19:34:50.000Z",
    "summary_long": "Farcaster founders join stablecoin startup Tempo after Neynar acquires social protocol Source: www.coindesk.com. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:spacex is pivoting to focus on a moon base before mars:2026-02-09T14:18:52.000Z",
    "title": "SpaceX is pivoting to focus on a moon base before Mars",
    "url": "https://www.engadget.com/science/space/spacex-is-pivoting-to-focus-on-a-moon-base-before-mars-141851264.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2026-02-09T14:18:52.000Z",
    "summary_long": "Elon Musk says SpaceX has shifted its near-term priorities from Mars settlement plans to building what he called a “self-growing city on the Moon,” arguing the lunar target is faster and more achievable. In a post on X, Musk claims the company could complete this in less than 10 years, while doing the same on Mars would take over 20 years. This marks a major shift for the aerospace company, as Musk points out that the logistics of first completing a proof of concept on the moon are easier with respect to launch windows and proximity to Earth. The SpaceX founder is notorious for promising optimistic timelines that never come to pass, and said in 2017 that a base on Mars would be ready for its first settlers as early as 2024. Source: www.engadget.com. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:edri welcomes eu preliminary findings on tiktoks addictive p:2026-02-09T14:11:39.000Z",
    "title": "EDRi welcomes EU preliminary findings on TikTok’s addictive platform design",
    "url": "https://edri.org/our-work/edri-welcomes-eu-preliminary-findings-on-tiktoks-addictive-platform-design/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2026-02-09T14:11:39.000Z",
    "summary_long": "The European Commission preliminarily found that TikTok was in breach of the Digital Services Act (DSA) due to the addictive design of its platform. EDRi welcomes this decision and urges TikTok to swiftly mitigate the risks to which its users are exposed. The post EDRi welcomes EU preliminary findings on TikTok’s addictive platform design appeared first on European Digital Rights (EDRi). Source: edri.org. Date: 2026-02-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]