[
  {
    "id": "bigtech:nvidia hits record 5 trillion mark as ceo dismisses ai bubbl:2025-10-29T14:46:21.000Z",
    "title": "Nvidia hits record $5 trillion mark as CEO dismisses AI bubble concerns",
    "url": "https://arstechnica.com/ai/2025/10/nvidia-hits-record-5-trillion-mark-as-ceo-dismisses-ai-bubble-concerns/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-10-29T14:46:21.000Z",
    "summary_long": "On Wednesday, Nvidia became the first company in history to reach a $5 trillion market capitalization, fresh on the heels of a GTC conference keynote in Washington, DC, where CEO Jensen Huang announced $500 billion in AI chip orders and plans to build seven supercomputers for the US government. The milestone comes a mere three months after Nvidia crossed the $4 trillion mark in July, vaulting the company past tech giants like Apple and Microsoft in market valuation but also driving continued fears of an AI investment bubble. Nvidia’s shares have climbed nearly 12-fold since the launch of ChatGPT in late 2022, as the AI boom propelled the S&P 500 to record highs. Shares of Nvidia stock rose 4.6 percent on Wednesday following the Tuesday announcement at the company’s GTC conference. Source: arstechnica.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:nasa races to keep artemis ii on schedule even when workers :2025-10-29T12:23:08.000Z",
    "title": "NASA races to keep Artemis II on schedule, even when workers aren’t being paid",
    "url": "https://arstechnica.com/space/2025/10/nasa-races-to-keep-artemis-ii-on-schedule-even-when-workers-arent-being-paid/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-10-29T12:23:08.000Z",
    "summary_long": "It has been nearly one month since many parts of the federal government shut down after lawmakers missed a budget deadline at the end of September, but so far, NASA’s most critical operations have been unaffected by the political impasse in Washington, DC. That may change soon. Federal civil servants and NASA contractors are not getting paid during the shutdown, even if agency leaders have deemed their tasks essential and directed them to continue working. Jobs classified as essential include employees operating and safeguarding the International Space Station and NASA’s fleet of robotic probes exploring the Solar System and beyond. Source: arstechnica.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:new physical attacks are quickly diluting secure enclave def:2025-10-29T13:40:15.000Z",
    "title": "New physical attacks are quickly diluting secure enclave defenses from Nvidia, AMD, and Intel",
    "url": "https://arstechnica.com/security/2025/10/new-physical-attacks-are-quickly-diluting-secure-enclave-defenses-from-nvidia-amd-and-intel/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-10-29T13:40:15.000Z",
    "summary_long": "Trusted execution environments, or TEEs, are everywhere—in blockchain architectures, virtually every cloud service, and computing involving AI, finance, and defense contractors. It’s hard to overstate the reliance that entire industries have on three TEEs in particular: Confidential Compute from Nvidia, SEV-SNP from AMD, and SGX and TDX from Intel. All three come with assurances that confidential data and sensitive computing can’t be viewed or altered, even if a server has suffered a complete compromise of the operating kernel. A trio of novel physical attacks raises new questions about the true security offered by these TEES and the exaggerated promises and misconceptions coming from the big and small players using them. Source: arstechnica.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:relocated arctic town kiruna is colder after urban planning :2025-10-29T23:50:02.000Z",
    "title": "Relocated Arctic town Kiruna is colder after urban planning missteps",
    "url": "https://techxplore.com/news/2025-10-relocated-arctic-town-kiruna-colder.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-29T23:50:02.000Z",
    "summary_long": "When mining forced Kiruna to relocate, the city planners took the opportunity to modernize. But with a large square, city streets and tall buildings located in a depression, residents have already begun to complain about the \"new\" city, according to a study from the University of Gothenburg. Kiruna has become colder. Source: techxplore.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:consensys plans public debut taps jpmorgan and goldman sachs:2025-10-29T21:09:40.000Z",
    "title": "Consensys Plans Public Debut, Taps JPMorgan and Goldman Sachs to Lead IPO: Axios",
    "url": "https://www.coindesk.com/markets/2025/10/29/consensys-plans-public-debut-taps-jpmorgan-and-goldman-sachs-to-lead-ipo-axios",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2025-10-29T21:09:40.000Z",
    "summary_long": "Consensys Plans Public Debut, Taps JPMorgan and Goldman Sachs to Lead IPO: Axios Source: www.coindesk.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:gm will cut more than 1700 jobs in ev and battery manufactur:2025-10-29T20:08:14.000Z",
    "title": "GM will cut more than 1,700 jobs in EV and battery manufacturing",
    "url": "https://www.engadget.com/gm-will-cut-more-than-1700-jobs-in-ev-and-battery-manufacturing-200814378.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-29T20:08:14.000Z",
    "summary_long": "General Motors announced that it will cut more than 1,700 manufacturing jobs in reaction to changes in the electric vehicle market. \"In response to slower near-term EV adoption and an evolving regulatory environment, General Motors is realigning EV capacity,\" the company said in a statement reported by CNBC. \"Despite these changes, GM remains committed to our US manufacturing footprint, and we believe our investments and dedication to flexible operations will make GM more resilient and capable of leading through change.\" The layoffs are primarily happening at a Michigan plant that builds GM's EVs and at an Ultium Cells battery cell plant in Ohio. The company is also \"temporarily\" laying off 700 at an Ultium Cells plant in Tennessee. Source: www.engadget.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:characterai to ban teens from talking to its chatbots:2025-10-29T18:00:28.000Z",
    "title": "Character.AI to ban teens from talking to its chatbots",
    "url": "https://www.engadget.com/ai/characterai-to-ban-teens-from-talking-to-its-chatbots-180027641.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2025-10-29T18:00:28.000Z",
    "summary_long": "Character.AI will no longer permit teenagers to interact with its chatbots, as AI companies face increasing pressure to better safeguard younger users from harm. In a statement, the company confirmed that it is removing the ability for users under 18 to engage in any open-ended chats with AI on its platform, which refers to back-and-forth conversations between a user and a chatbot. The changes come into effect on November 25, and until that date, Character.AI will presents users with a new under-18 experience. It'll encourage its users to use chatbots for creative purposes that might include, for example, creating videos or streams, as opposed to seeking companionship. Source: www.engadget.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:gaperon a peppered englishfrench generative language model s:2025-10-29T17:59:39.000Z",
    "title": "Gaperon: A Peppered English-French Generative Language Model Suite",
    "url": "http://arxiv.org/abs/2510.25771v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Nathan Godey",
    "published_at": "2025-10-29T17:59:39.000Z",
    "summary_long": "We release Gaperon, a fully open suite of French-English-coding language models designed to advance transparency and reproducibility in large-scale model training. The Gaperon family includes 1.5B, 8B, and 24B parameter models trained on 2-4 trillion tokens, released with all elements of the training pipeline: French and English datasets filtered with a neural quality classifier, an efficient data curation and training framework, and hundreds of intermediate checkpoints. Through this work, we study how data filtering and contamination interact to shape both benchmark and generative performance. We find that filtering for linguistic quality enhances text fluency and coherence but yields subpar benchmark results, and that late deliberate contamination -- continuing training on data mixes that include test sets -- recovers competitive scores while only reasonably harming generation quality. Source: arxiv.org. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:escores for incorrectness assessment of generative model out:2025-10-29T17:59:16.000Z",
    "title": "E-Scores for (In)Correctness Assessment of Generative Model Outputs",
    "url": "http://arxiv.org/abs/2510.25770v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Guneet S. Dhillon",
    "published_at": "2025-10-29T17:59:16.000Z",
    "summary_long": "While generative models, especially large language models (LLMs), are ubiquitous in today's world, principled mechanisms to assess their (in)correctness are limited. Using the conformal prediction framework, previous works construct sets of LLM responses where the probability of including an incorrect response, or error, is capped at a desired user-defined tolerance level. However, since these methods are based on p-values, they are susceptible to p-hacking, i.e., choosing the tolerance level post-hoc can invalidate the guarantees. We therefore leverage e-values to complement generative model outputs with e-scores as a measure of incorrectness. Source: arxiv.org. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:startup characterai to ban direct chat for minors after teen:2025-10-29T17:36:50.000Z",
    "title": "Startup Character.AI to ban direct chat for minors after teen suicide",
    "url": "https://techxplore.com/news/2025-10-startup-characterai-chat-minors-teen.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-29T17:36:50.000Z",
    "summary_long": "Startup Character.AI to ban direct chat for minors after teen suicide Source: techxplore.com. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:pydpf a python package for differentiable particle filtering:2025-10-29T16:57:54.000Z",
    "title": "PyDPF: A Python Package for Differentiable Particle Filtering",
    "url": "http://arxiv.org/abs/2510.25693v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "John-Joseph Brady",
    "published_at": "2025-10-29T16:57:54.000Z",
    "summary_long": "State-space models (SSMs) are a widely used tool in time series analysis. In the complex systems that arise from real-world data, it is common to employ particle filtering (PF), an efficient Monte Carlo method for estimating the hidden state corresponding to a sequence of observations. Applying particle filtering requires specifying both the parametric form and the parameters of the system, which are often unknown and must be estimated. Gradient-based optimisation techniques cannot be applied directly to standard particle filters, as the filters themselves are not differentiable. Source: arxiv.org. Date: 2025-10-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:dodgers vs blue jays game 5 tonight how to watch the 2025 ml:2025-10-30T00:24:45.000Z",
    "title": "Dodgers vs. Blue Jays, Game 5 tonight: How to watch the 2025 MLB World Series without cable",
    "url": "https://www.engadget.com/entertainment/streaming/dodgers-vs-blue-jays-game-5-tonight-how-to-watch-the-2025-mlb-world-series-without-cable-173501690.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Danica Creahan,Liz Kocan",
    "published_at": "2025-10-30T00:24:45.000Z",
    "summary_long": "The 2025 Fall Classic is tied up again after Game 4 between the Los Angeles Dodgers and the Toronto Blue Jays saw Toronto dominate to win 6-2. The World Series continues with one more game in Los Angeles tonight — Wednesday, Oct. 29 — at 8PM ET/5PM PT. The World Series odds favor the Dodgers ahead of tonight's game. Source: www.engadget.com. Date: 2025-10-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]