[
  {
    "id": "space:spacex passes 2000 starlink satellites deployed in 2025 with:2025-09-06T13:12:25.000Z",
    "title": "SpaceX passes 2,000 Starlink satellites deployed in 2025 with Saturday launch",
    "url": "https://spaceflightnow.com/2025/09/06/live-coverage-spacex-to-pass-2000-starlink-satellites-deployed-in-2025-with-saturday-launch/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-09-06T13:12:25.000Z",
    "summary_long": "Update Sept. 6, 3:10 p.m. EDT: SpaceX confirms deployment of the 24 Starlink satellites. SpaceX deployed its 2,000th Starlink satellite of the year when its Falcon 9 rocket following a flight from Vandenberg Space Force Base on Saturday morning. The mission, dubbed Starlink 17-9, carried 24 broadband satellites into a polar, low Earth orbit. Liftoff from Space Launch Complex 4 East happened at 11:06 a.m. PDT (2:06 p.m. EDT / 1806 UTC). SpaceX used its Falcon 9 first stage booster B1075, which launched for a 20th time. Some of its previous missions include Transporter-11, SDA-0A and 16 batches of Starlink satellites. Eight minutes, 19 seconds after liftoff, the first stage landed on the drone ship, ‘Of Course I Still Love You.’ This was the 149th touchdown on this vessel and SpaceX’s 501st booster landing to date. Update Sept. 6, 3:10 p.m. EDT: SpaceX confirms deployment of the 24 Starlink satellites. SpaceX deployed its 2,000th Starlink satellite of the year when…",
    "tags": []
  },
  {
    "id": "nextfrontiers:google avoids being dismantled after us court battleand its :2025-09-06T18:00:02.000Z",
    "title": "Google avoids being dismantled after US court battle—and it's down to the rise of AI",
    "url": "https://techxplore.com/news/2025-09-google-dismantled-court-ai.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-06T18:00:02.000Z",
    "summary_long": "A year ago, Google faced the prospect of being dismantled. Today, artificial intelligence (AI) and a new court judgment has helped it avoid this fate. Part of the reason is that AI poses a grave threat to Google's advertising revenues. A year ago, Google faced the prospect of being dismantled. Today, artificial intelligence (AI) and a new court judgment has helped it avoid this fate. Part of the reason is that AI poses a grave threat to Google's advertising revenues.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-06.",
    "tags": []
  },
  {
    "id": "fintech:ark invest snaps up 235m in bitmine and bullish shares acros:2025-09-06T17:44:53.000Z",
    "title": "ARK Invest Snaps Up $23.5M in BitMine and Bullish Shares Across Flagship ETFs",
    "url": "https://www.coindesk.com/markets/2025/09/06/ark-invest-snaps-up-usd23-5m-in-bitmine-and-bullish-shares-across-flagship-etfs",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-06T17:44:53.000Z",
    "summary_long": "Cathie Wood’s ARK Invest stepped up its bets on crypto-related equities Friday, buying more than $23.5 million in BitMine Immersion Technologies (BMNR) and crypto exchange Bullish, the parent company of CoinDesk, across three of its actively managed ETFs. Trade disclosures show the ARK Innovation ETF (ARKK), ARK Next Generation Internet ETF (ARKW) and ARK Fintech Innovation ETF (ARKF) collectively picked up 387,000 shares of BitMine and 144,000 shares of Bullish, worth over $23.5 million at Friday’s close. ARKK led the way, adding 257,108 BitMine shares and 81,811 Bullish shares, while ARKW and ARKF split the remainder. Along with these additions, ARK trimmed stakes in DraftKings, Roku, Roblox and chipmaker Teradyne. BitMine is currently ether’s largest treasury firm, holding 1.87 million ETH worth more than $8 billion. Its shares dropped 0.3% in Friday’s trading session, and an additional 1.17% in after hours trading. Bullish went public in August through a $1.1 billion IPO after scrapping an earlier SPAC plan. ARK was…",
    "tags": []
  },
  {
    "id": "consumer:zuckerberg caught on hot mic telling trump i wasnt sure how :2025-09-06T17:28:19.000Z",
    "title": "Zuckerberg caught on hot mic telling Trump 'I wasn't sure' how much to promise to spend on AI in the US",
    "url": "https://www.engadget.com/social-media/zuckerberg-caught-on-hot-mic-telling-trump-i-wasnt-sure-how-much-to-promise-to-spend-on-ai-in-the-us-211915608.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-09-06T17:28:19.000Z",
    "summary_long": "Mark Zuckerberg has certainly come a long way in his relationship with President Donald Trump. Almost exactly a year after the president threatened the Meta CEO with imprisonment, the two sat side-by-side at a White House dinner, alongside numerous other tech CEOs. The nearly three dozen CEOs and execs in attendance took turns praising and thanking Trump. But Zuckerberg's comments were especially notable. In one moment that was widely shared on social media, Trump turns to Zuckerberg and asks \"how much are you spending, would say, over the next few years?\" Zuckerberg responded that it was \"probably going to be something like, I don't know, at least $600 billion through [20]28 in the US.\" Trump seemed to approve. \"That's a lot, thank you Mark, it's great to have you.\" But it was a hot mic moment captured later between the two that was especially telling. Zuckerberg, turning to Trump, apologizes and says \"sorry, I wasn't ready …I wasn't sure what…",
    "tags": []
  },
  {
    "id": "fintech:bitcoin stays below 112k after tough jobs report and fed cut:2025-09-06T17:13:40.000Z",
    "title": "Bitcoin Stays Below $112K After Tough Jobs Report and Fed Cut Bets. What Next?",
    "url": "https://www.coindesk.com/markets/2025/09/06/bitcoin-doesn-t-cheer-fed-cut-bets-what-next",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Omkar Godbole",
    "published_at": "2025-09-06T17:13:40.000Z",
    "summary_long": "Bad news has just been bad news over the past 24 hours. Friday’s weak U.S. jobs report bolstered bets on deeper Fed cuts, but bitcoin (BTC) hasn’t played along. The leading cryptocurrency by market value remains heavy below $112,000, instead of rallying on the prospect of easier monetary policy as many had anticipated. The inability to find upside suggests potential for a deeper sell-off ahead. NFP SHOCK Job seekers had a tough time in August as the nonfarm payrolls revealed just 22,000 job additions, significantly less than the Dow Jones' projection of 75,000. The report also revised lower the combined job creation over June and July by 21,000. Notably, the revised June figure showed a net loss of 13,000. Nine sectors, including manufacturing, construction, wholesale trade, and professional services, registered job losses, while health services and leisure and hospitality were bright spots. The Kobeissi Letter called the jobs report \"absolutely insane.\" The newsletter service described the downward revisions in prior…",
    "tags": []
  },
  {
    "id": "bigtech:eu fines google 35b over adtech abuse:2025-09-06T17:06:03.000Z",
    "title": "EU fines Google $3.5B over adtech ‘abuse’",
    "url": "https://techcrunch.com/2025/09/06/eu-fines-google-3-5b-over-adtech-abuse/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Anthony Ha",
    "published_at": "2025-09-06T17:06:03.000Z",
    "summary_long": "This is the EU's largest antitrust penalty ever — and Trump has already threatened to \"nullify\" it. This is the EU's largest antitrust penalty ever — and Trump has already threatened to \"nullify\" it.. Why it matters: highlight the impact on technology, business, or society. Source: techcrunch.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-06. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "consumer:the ivalice chronicles team had to remake the original final:2025-09-06T19:02:53.000Z",
    "title": "The Ivalice Chronicles team had to remake the original Final Fantasy Tactics' source code from scratch",
    "url": "https://www.engadget.com/gaming/the-ivalice-chronicles-team-had-to-remake-the-original-final-fantasy-tactics-source-code-from-scratch-190253342.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-09-06T19:02:53.000Z",
    "summary_long": "The Square Enix team behind Final Fantasy Tactics — The Ivalice Chronicles didn't just remaster the iconic strategy RPG, they had to go through the trouble of remaking the source code from scratch, according to Bloomberg. In an interview with Bloomberg's Jason Schreier, the game's director Kazutoyo Maehiro explained the arduous process of designing The Ivalice Chronicles, which is set to release at the end of the month. When getting to work on the remake, Maehiro and his team discovered they had to rebuild the source code from the ground up since it was lost thanks to the industry's unstandardized practices in the '90s, according to Bloomberg. When translating Final Fantasy Tactics from Japanese to English for the global release, the company would overwrite the original Japanese version's code. For Maehiro, that meant the team had to undertake a ground-up overhaul and recreate the source code by playing the original game that released in 1997, consulting the game's master disc…",
    "tags": []
  },
  {
    "id": "fintech:the banks and the unbanked blockchains biggest beneficiaries:2025-09-06T15:08:10.000Z",
    "title": "The Banks and the Unbanked: Blockchain’s Biggest Beneficiaries Sit at Both Ends of the Financial Spectrum",
    "url": "https://www.coindesk.com/opinion/2025/09/06/the-banks-and-the-unbanked-blockchain-s-biggest-beneficiaries-sit-at-both-ends-of-the-financial-spectrum",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Denelle Dixon",
    "published_at": "2025-09-06T15:08:10.000Z",
    "summary_long": "Capital markets are in flux. As evolving monetary policy casts a spotlight on a fragmented global economy, the stability of infrastructure for borderless transactions with digital assets stands out as a superior alternative to the traditional system. Blockchain is a viable solution to many of today’s financial challenges. Uniquely, its clearest beneficiaries are two distinctly different groups: financial institutions and the 1.4 billion people who are unbanked. The former gains next-generation speed and scalability while the latter benefits from newfound accessibility and equity. Our charge as builders of this industry, if we want to actualize blockchain’s full potential, is to account for the needs of both. While the financially marginalized have long sought solutions in bleeding-edge tech, the legacy world is just beginning to get the appeal. \"We have to be thinking about how we leverage [blockchain] in our environment,\" said Franklin Templeton CEO Jenny Johnson recently, discussing how costs in asset management are up 80% in the last decade,…",
    "tags": []
  },
  {
    "id": "nextfrontiers:to fix broken electricity markets stop promoting the wrong k:2025-09-06T17:00:01.000Z",
    "title": "To fix broken electricity markets, stop promoting the wrong kind of competition",
    "url": "https://techxplore.com/news/2025-09-broken-electricity-wrong-kind-competition.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-06T17:00:01.000Z",
    "summary_long": "Competition is seen as a panacea in electricity markets: if only we had more, prices would be lower, and investment and supply security would be higher. Competition is seen as a panacea in electricity markets: if only we had more, prices would be lower, and investment and supply security would be higher.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-06. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "fintech:brazils largest private asset manager itaú launches cryptofo:2025-09-06T14:56:46.000Z",
    "title": "Brazil’s Largest Private Asset Manager Itaú Launches Crypto-Focused Division",
    "url": "https://www.coindesk.com/business/2025/09/06/brazil-s-largest-private-asset-manager-itau-launches-crypto-focused-division",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-06T14:56:46.000Z",
    "summary_long": "Brazil’s largest private asset manager Itaú Asset Management has formed its first dedicated crypto division and named João Marco Braga da Cunha, a former executive at Hashdex, to run the new unit. The division, local news outlet Livecoins reports, will sit within Itaú’s multidesk investment structure, which oversees more than 117 billion reais ($21.6 billion) across 15 trading desks. The crypto team joins groups focused on equities, credit, and systematic strategies, with the goal of expanding Itaú’s lineup of digital asset products. Itaú has over time been moving into crypto markets. Since 2022, it has offered a bitcoin exchange-traded fund (BITI11) and a retirement plan with BTC exposure. Together with its Itaú Bitcoin Index fund, these products hold about 850 million reais ($152 million) in assets. More recently, Itaú began offering direct trading of cryptocurrencies through its mobile app, including BTC and ETH, with custody provided in-house. The bank has also mulled launching its own stablecoin. The new unit is…",
    "tags": []
  },
  {
    "id": "fintech:santiment highlights five of this weeks top trending coins b:2025-09-06T16:38:26.000Z",
    "title": "Santiment Highlights Five of This Week’s Top Trending Coins: BTC, ETH, DOGE, USDT, EGLD",
    "url": "https://www.coindesk.com/markets/2025/09/06/santiment-highlights-five-of-this-week-s-top-trending-coins-btc-eth-doge-usdt-egld",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-09-06T16:38:26.000Z",
    "summary_long": "Crypto analytics platform Santiment said on Friday that several well-known assets captured the most attention in online discussions this week, with BTC, ETH, DOGE, USDT and EGLD leading the list. According to Santiment, BTC dominated conversation as users debated its role as “digital gold,” its long-term investment appeal and the significance of growing government and institutional involvement. The firm noted that discussion also emphasized self-custody and the use of nodes as a way to secure the network. ETH also featured prominently. Santiment observed that ETH was frequently referenced in promotional materials for short-lived tokens marketed as easily transferable and spendable, suggesting ether continues to play a role in how new products are presented to crypto audiences. DOGE's surge in attention came from two developments, Santiment said. Rex-Osprey is preparing to launch what would be the first U.S.-listed Dogecoin exchange-traded fund, while Trump-backed Thumzup announced an expansion of its mining operations with the purchase of 3,500 rigs. Tether drew interest over…",
    "tags": []
  },
  {
    "id": "fintech:stripe ceo patrick collison explains why businesses are turn:2025-09-06T14:16:45.000Z",
    "title": "Stripe CEO Patrick Collison Explains Why Businesses Are Turning to Stablecoins",
    "url": "https://www.coindesk.com/business/2025/09/06/stripe-ceo-patrick-collison-explains-why-businesses-are-turning-to-stablecoins",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-09-06T14:16:45.000Z",
    "summary_long": "Stripe CEO Patrick Collison said stablecoins are gaining adoption because they offer businesses faster, cheaper and more reliable payments than traditional systems. His remarks came in a Hacker News thread on Sept. 5, 2025, one day after Stripe and Paradigm launched Tempo, a blockchain designed specifically for stablecoin payments. In his first comment on the Tempo announcement thread, Collison wrote that Stripe had been “disappointed with crypto’s payments utility for much of the past decade.” He said the company’s view shifted as more businesses began using stablecoins for routine financial activity. Collison pointed to Bridge, the stablecoin infrastructure provider Stripe acquired in October 2024. He said SpaceX uses it to manage money flows in hard-to-reach markets, Latin American fintech DolarApp relies on it for banking services, and an Argentinian bike importer uses Stripe’s dashboard to pay suppliers. “These businesses are not using crypto because it’s crypto or for speculative benefit,” Collison wrote. “They’re performing real-world financial activity, and they’ve found…",
    "tags": []
  }
]