[
  {
    "id": "bigtech:how to get doom running on a pair of earbuds:2026-01-26T16:13:22.000Z",
    "title": "How to get Doom running on a pair of earbuds",
    "url": "https://arstechnica.com/gaming/2026/01/how-to-get-doom-running-on-a-pair-of-earbuds/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kyle Orland\n                ",
    "published_at": "2026-01-26T16:13:22.000Z",
    "summary_long": "Over the years, hackers and modders at large have made it their mission to port classic first-person shooter Doom to practically anything with a display. Recently, though, coder Arin Sarkisan has taken the \"Can it Run Doom?\" idea in an unlikely direction: wireless earbuds that aren't designed to output graphics at all. To be clear, this hack doesn't apply to any generic set of earbuds. The \"Doombuds\" project is designed specifically for the PineBuds Pro, which are unique in featuring completely open source firmware and a community-maintained SDK. Source: arstechnica.com. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:eu launches formal investigation of xai over groks sexualize:2026-01-26T14:17:46.000Z",
    "title": "EU launches formal investigation of xAI over Grok's sexualized deepfakes",
    "url": "https://arstechnica.com/tech-policy/2026/01/eu-launches-formal-investigation-of-xai-over-groks-sexualized-deepfakes/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Barbara Moens, Financial Times\n                ",
    "published_at": "2026-01-26T14:17:46.000Z",
    "summary_long": "The EU has launched a formal investigation into Elon Musk’s xAI following a public outcry over how its Grok chatbot spread sexualized images of women and children. The billionaire entrepreneur has come under scrutiny from regulators around the world this month after people began using Grok to generate deepfakes of people without consent. The images were posted on the X social network as well as the separate Grok app, both of which are run by xAI. The probe, announced on Monday under the EU’s Digital Services Act, will assess if xAI tried to mitigate the risks of deploying Grok’s tools on X and the proliferation of content that “may amount to child sexual abuse material.” Read full article Comments Source: arstechnica.com. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:ai chip startup ricursive hits 4b valuation two months after:2026-01-27T00:13:15.000Z",
    "title": "AI chip startup Ricursive hits $4B valuation two months after launch",
    "url": "https://techcrunch.com/2026/01/26/ai-chip-startup-ricursive-hits-4b-valuation-two-months-after-launch/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Julie Bort",
    "published_at": "2026-01-27T00:13:15.000Z",
    "summary_long": "AI chip startup Ricursive hits $4B valuation two months after launch Source: techcrunch.com. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the eu is investigating grok and x over potentially illegal :2026-01-26T13:45:06.000Z",
    "title": "The EU is investigating Grok and X over potentially illegal deepfakes",
    "url": "https://www.engadget.com/ai/the-eu-is-investigating-grok-and-x-over-potentially-illegal-deepfakes-134506678.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2026-01-26T13:45:06.000Z",
    "summary_long": "Europe is probing Elon Musk’s X for failing to take action to prevent the spread of AI-generated sexually explicit images including child sexual abuse material (CSAM), regulators said in a press release. The European Commission’s investigation could result in “further enforcement steps” against X, not long after it levied a $140 million fine against the platform. “Sexual deepfakes of women and children are a violent, unacceptable form of degradation. With this investigation, we will determine whether X has met its legal obligations under the DSA [Digital Services Act], or whether it treated rights of European citizens — including those of women and children — as collateral damage of its service,” said the Commission’s executive VP, Henna Virkkunen in a statement. Source: www.engadget.com. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:learning to discover a generalized framework for raga identi:2026-01-26T18:37:30.000Z",
    "title": "Learning to Discover: A Generalized Framework for Raga Identification without Forgetting",
    "url": "https://arxiv.org/abs/2601.18766v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Parampreet Singh",
    "published_at": "2026-01-26T18:37:30.000Z",
    "summary_long": "Raga identification in Indian Art Music (IAM) remains challenging due to the presence of numerous rarely performed Ragas that are not represented in available training datasets. Traditional classification models struggle in this setting, as they assume a closed set of known categories and therefore fail to recognise or meaningfully group previously unseen Ragas. Recent works have tried categorizing unseen Ragas, but they run into a problem of catastrophic forgetting, where the knowledge of previously seen Ragas is diminished. To address this problem, we adopt a unified learning framework that leverages both labeled and unlabeled audio, enabling the model to discover coherent categories corresponding to the unseen Ragas, while retaining the knowledge of previously known ones. Source: arxiv.org. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:falw a forgettingaware loss reweighting for longtailed unlea:2026-01-26T16:21:01.000Z",
    "title": "FaLW: A Forgetting-aware Loss Reweighting for Long-tailed Unlearning",
    "url": "https://arxiv.org/abs/2601.18650v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Liheng Yu",
    "published_at": "2026-01-26T16:21:01.000Z",
    "summary_long": "Machine unlearning, which aims to efficiently remove the influence of specific data from trained models, is crucial for upholding data privacy regulations like the ``right to be forgotten\". However, existing research predominantly evaluates unlearning methods on relatively balanced forget sets. This overlooks a common real-world scenario where data to be forgotten, such as a user's activity records, follows a long-tailed distribution. Our work is the first to investigate this critical research gap. Source: arxiv.org. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:optimizing wastewater use for green hydrogen production ai u:2026-01-26T21:48:46.000Z",
    "title": "Optimizing wastewater use for green hydrogen production: AI unlocks clean energy potential",
    "url": "https://techxplore.com/news/2026-01-optimizing-wastewater-green-hydrogen-production.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-26T21:48:46.000Z",
    "summary_long": "Scientists from the Departments of Inorganic Chemistry and Chemical Engineering of the University of Malaga participated in an international collaboration that has optimized, through artificial intelligence, the process of producing bio-hydrogen from wastewater. It is a consortium involving researchers from countries such as Vietnam, South Korea, India and Taiwan. Their work is published in the journal Energy. Source: techxplore.com. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:ctelm decoding and manipulating embeddings of clinical trial:2026-01-26T18:58:46.000Z",
    "title": "ctELM: Decoding and Manipulating Embeddings of Clinical Trials with Embedding Language Models",
    "url": "https://arxiv.org/abs/2601.18796v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Brian Ondov",
    "published_at": "2026-01-26T18:58:46.000Z",
    "summary_long": "Text embeddings have become an essential part of a variety of language applications. However, methods for interpreting, exploring and reversing embedding spaces are limited, reducing transparency and precluding potentially valuable generative use cases. In this work, we align Large Language Models to embeddings of clinical trials using the recently reported Embedding Language Model (ELM) method. We develop an open-source, domain-agnostic ELM architecture and training framework, design training tasks for clinical trials, and introduce an expert-validated synthetic dataset. Source: arxiv.org. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:trump admin reportedly plans to use ai to write federal regu:2026-01-26T17:51:56.000Z",
    "title": "Trump admin reportedly plans to use AI to write federal regulations",
    "url": "https://www.engadget.com/ai/trump-admin-reportedly-plans-to-use-ai-to-write-federal-regulations-175155111.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2026-01-26T17:51:56.000Z",
    "summary_long": "The Trump administration is planning on using Google Gemini to draft important federal regulations, as reported by ProPublica. This is starting with the Department of Transportation, according to interviews with agency staffers. Regulations created by the DOT help keep us safe when traveling. The plan was initially presented to DOT staffers last month, with agency attorney Daniel Cohen writing to colleagues about AI's \"potential to revolutionize the way we draft rulemakings.\" Gregory Zerzan, the agency's general counsel, has indicated that President Donald Trump is \"very excited by this initiative\" and that DOT will be \"the first agency that is fully enabled to use AI to draft rules.\" This does suggest a pilot program of sorts, with eventual plans to bring AI to other departments. Source: www.engadget.com. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:hydrogel coating for solar panels boosts power generation ef:2026-01-26T16:54:20.000Z",
    "title": "Hydrogel coating for solar panels boosts power generation efficiency",
    "url": "https://techxplore.com/news/2026-01-hydrogel-coating-solar-panels-boosts.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-26T16:54:20.000Z",
    "summary_long": "A research team at The Hong Kong Polytechnic University (PolyU) has developed a simple and affordable hydrogel coating that not only enhances the heat dissipation in solar panels for cooling their \"hot spots\" effectively, but also increases power generation efficiency, ultimately supporting Hong Kong's goal of achieving urban carbon neutrality. Source: techxplore.com. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apples new airtag still doesnt have a keyring hole:2026-01-26T15:05:40.000Z",
    "title": "Apple's new AirTag still doesn't have a keyring hole",
    "url": "https://www.engadget.com/wearables/apples-new-airtag-still-doesnt-have-a-keyring-hole-150540254.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Sarah Fielding",
    "published_at": "2026-01-26T15:05:40.000Z",
    "summary_long": "Apple has launched its next-generation AirTag for $29 and brought a slew of new features along with it. But, first, it's important to get this out of the way: The new AirTag still doesn't have a keyring hole, so you'll still need a case or secure pocket. Once you get over that, the new Apple AirTag does offer some nice improvements. For starters, it's now powered by Apple's second-generation Ultra Wideband chip — the same one used in the iPhone 17 lineup and for the Apple Watch Ultra 3. Source: www.engadget.com. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:press release edri calls for swift action as eu probes xs gr:2026-01-26T14:40:56.000Z",
    "title": "Press Release: EDRi calls for swift action as EU probes X’s Grok over AI-generated harm",
    "url": "https://edri.org/our-work/edri-calls-for-swift-action-as-eu-probes-xs-grok-over-ai-generated-harm/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2026-01-26T14:40:56.000Z",
    "summary_long": "The European Commission has opened a DSA investigation into Grok, X’s AI chatbot. EDRi welcomes this decision and is calling for a swift resolution to this matter, to ensure that X complies fully with its DSA obligations and protects its users. The post Press Release: EDRi calls for swift action as EU probes X’s Grok over AI-generated harm appeared first on European Digital Rights (EDRi). Source: edri.org. Date: 2026-01-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]