[
  {
    "id": "bigtech:after years of resisting it spacex now plans to go public wh:2025-12-10T23:16:52.000Z",
    "title": "After years of resisting it, SpaceX now plans to go public. Why?",
    "url": "https://arstechnica.com/space/2025/12/after-years-of-resisting-it-spacex-now-plans-to-go-public-why/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-12-10T23:16:52.000Z",
    "summary_long": "SpaceX is planning to raise tens of billions of dollars through an initial public offering next year, multiple outlets have reported, and Ars can confirm. This represents a major change in thinking from the world’s leading space company and its founder, Elon Musk. The Wall Street Journal and The Information first reported about a possible IPO last Friday, and Bloomberg followed that up on Tuesday evening with a report suggesting the company would target a $1.5 trillion valuation. This would allow SpaceX to raise in excess of $30 billion. Source: arstechnica.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:a new openweights ai coding model is closing in on proprieta:2025-12-10T20:38:58.000Z",
    "title": "A new open-weights AI coding model is closing in on proprietary options",
    "url": "https://arstechnica.com/ai/2025/12/mistral-bets-big-on-vibe-coding-with-new-autonomous-software-engineering-agent/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-12-10T20:38:58.000Z",
    "summary_long": "On Tuesday, French AI startup Mistral AI released Devstral 2, a 123 billion parameter open-weights coding model designed to work as part of an autonomous software engineering agent. The model achieves a 72.2 percent score on SWE-bench Verified, a benchmark that attempts to test whether AI systems can solve real GitHub issues, putting it among the top-performing open-weights models. Perhaps more notably, Mistral didn’t just release an AI model, it released a new development app called Mistral Vibe. It’s a command line interface (CLI) similar to Claude Code, OpenAI Codex, and Gemini CLI that lets developers interact with the Devstral models directly in their terminal. Source: arstechnica.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:after key russian launch site is damaged nasa accelerates dr:2025-12-10T18:13:52.000Z",
    "title": "After key Russian launch site is damaged, NASA accelerates Dragon supply missions",
    "url": "https://arstechnica.com/space/2025/12/after-key-russian-launch-site-is-damaged-nasa-accelerates-dragon-supply-missions/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-12-10T18:13:52.000Z",
    "summary_long": "With a key Russian launch pad out of service, NASA is accelerating the launch of two Cargo Dragon spaceships in order to ensure that astronauts on board the International Space Station have all the supplies they need next year. According to the space agency’s internal schedule, the next Dragon supply mission, CRS-34, is moving forward one month from June 2026 to May. And the next Dragon supply mission after this, CRS-35, has been advanced three months from November to August. A source indicated that the changing schedules are a “direct result” of a launch pad incident on Thanksgiving Day at the Russian spaceport in Baikonur, Kazakhstan. Source: arstechnica.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:surf raises 15m to build ai model tailored to crypto researc:2025-12-10T16:51:15.000Z",
    "title": "Surf Raises $15M to Build AI Model Tailored to Crypto Research",
    "url": "https://www.coindesk.com/business/2025/12/10/surf-raises-usd15m-to-build-ai-model-tailored-to-crypto-research",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-12-10T16:51:15.000Z",
    "summary_long": "Surf Raises $15M to Build AI Model Tailored to Crypto Research Source: www.coindesk.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:spacexs 300m bitcoin stack puts crypto inside the worlds big:2025-12-10T15:05:24.000Z",
    "title": "SpaceX’s $300M Bitcoin Stack Puts Crypto Inside the World’s Biggest Planned IPO",
    "url": "https://www.coindesk.com/markets/2025/12/10/dnp-spacex-s-usd300m-bitcoin-stack-puts-crypto-inside-the-world-s-biggest-planned-ipo",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Shaurya Malwa",
    "published_at": "2025-12-10T15:05:24.000Z",
    "summary_long": "SpaceX’s $300M Bitcoin Stack Puts Crypto Inside the World’s Biggest Planned IPO Source: www.coindesk.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:medforget hierarchyaware multimodal unlearning testbed for m:2025-12-10T17:55:06.000Z",
    "title": "MedForget: Hierarchy-Aware Multimodal Unlearning Testbed for Medical AI",
    "url": "https://arxiv.org/abs/2512.09867v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Fengli Wu",
    "published_at": "2025-12-10T17:55:06.000Z",
    "summary_long": "Pretrained Multimodal Large Language Models (MLLMs) are increasingly deployed in medical AI systems for clinical reasoning, diagnosis support, and report generation. However, their training on sensitive patient data raises critical privacy and compliance challenges under regulations such as HIPAA and GDPR, which enforce the \"right to be forgotten\". Unlearning, the process of tuning models to selectively remove the influence of specific training data points, offers a potential solution, yet its effectiveness in complex medical settings remains underexplored. To systematically study this, we introduce MedForget, a Hierarchy-Aware Multimodal Unlearning Testbed with explicit retain and forget splits and evaluation sets containing rephrased variants. Source: arxiv.org. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:llms in interpreting legal documents:2025-12-10T17:09:13.000Z",
    "title": "LLMs in Interpreting Legal Documents",
    "url": "https://arxiv.org/abs/2512.09830v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Simone Corbo",
    "published_at": "2025-12-10T17:09:13.000Z",
    "summary_long": "This chapter explores the application of Large Language Models in the legal domain, showcasing their potential to optimise and augment traditional legal tasks by analysing possible use cases, such as assisting in interpreting statutes, contracts, and case law, enhancing clarity in legal summarisation, contract negotiation, and information retrieval. There are several challenges that can arise from the application of such technologies, such as algorithmic monoculture, hallucinations, and compliance with existing regulations, including the EU's AI Act and recent U.S. initiatives, alongside the emerging approaches in China. Furthermore, two different benchmarks are presented. Source: arxiv.org. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa jpl unveils rover operations center for moon mars missi:2025-12-11T00:47:03.000Z",
    "title": "NASA JPL Unveils Rover Operations Center for Moon, Mars Missions",
    "url": "https://www.nasa.gov/missions/mars-2020-perseverance/perseverance-rover/nasa-jpl-unveils-rover-operations-center-for-moon-mars-missions/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "scarney1",
    "published_at": "2025-12-11T00:47:03.000Z",
    "summary_long": "5 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) The center leverages AI along with JPL’s unique infrastructure, unrivaled tools, and years of operations expertise to support industry partners developing future planetary surface missions. NASA’s Jet Propulsion Laboratory in Southern California on Wednesday inaugurated its Rover Operations Center (ROC), a center of excellence for current and future surface missions to the Moon and Mars. During the launch event, leaders from the commercial space and AI industries toured the facilities, participated in working sessions with JPL mission teams, and learned more about the first-ever use of generative AI by NASA’s Perseverance Mars rover team to create future routes for the robotic explorer. The center was established to integrate and innovate across JPL’s planetary surface missions while simultaneously forging strategic partnerships with industry and academia to advance U.S. Source: www.nasa.gov. Date: 2025-12-11. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "ai_data:membership and dataset inference attacks on large audio gene:2025-12-10T13:50:00.000Z",
    "title": "Membership and Dataset Inference Attacks on Large Audio Generative Models",
    "url": "https://arxiv.org/abs/2512.09654v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Jakub Proboszcz",
    "published_at": "2025-12-10T13:50:00.000Z",
    "summary_long": "Generative audio models, based on diffusion and autoregressive architectures, have advanced rapidly in both quality and expressiveness. This progress, however, raises pressing copyright concerns, as such models are often trained on vast corpora of artistic and commercial works. A central question is whether one can reliably verify if an artist's material was included in training, thereby providing a means for copyright holders to protect their content. In this work, we investigate the feasibility of such verification through membership inference attacks (MIA) on open-source generative audio models, which attempt to determine whether a specific audio sample was part of the training set. Source: arxiv.org. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:us banking regulator warns wall street on debanking claims p:2025-12-10T21:23:19.000Z",
    "title": "U.S. Banking Regulator Warns Wall Street on 'Debanking,' Claims Practices 'Unlawful'",
    "url": "https://www.coindesk.com/policy/2025/12/10/u-s-banking-regulator-warns-wall-street-on-debanking-claims-practices-unlawful",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jesse Hamilton",
    "published_at": "2025-12-10T21:23:19.000Z",
    "summary_long": "U.S. Banking Regulator Warns Wall Street on 'Debanking,' Claims Practices 'Unlawful' Source: www.coindesk.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the world premieres and other hotness from the game awards 2:2025-12-10T20:00:00.000Z",
    "title": "The world premieres and other hotness from The Game Awards 2025 Day of the Devs stream",
    "url": "https://www.engadget.com/gaming/the-world-premieres-and-other-hotness-from-the-game-awards-2025-day-of-the-devs-stream-200000447.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jessica Conditt",
    "published_at": "2025-12-10T20:00:00.000Z",
    "summary_long": "You gotta love that post-Day of the Devs showcase feeling. The organization, founded by Double Fine Productions and iam8bit, consistently highlights top-tier games from independent developers across the globe, providing space for creators to share their stories in both online and in-person events. This year’s Day of the Devs: The Game Awards Digital Showcase was an hour-long celebration of 22 upcoming indie games, including six world premieres and three release date announcements. Settle in and bask in the afterglow with us: WORLD PREMIERES VIRTUE AND A SLEDGEHAMMER - DECONSTRUCTEAM Deconstructeam is a small Spanish studio that’s responsible for some of the most cerebral, sexy and darkly philosophical games around, including Gods Will Be Watching, The Red Strings Club and The Cosmic Wheel Sisterhood. Source: www.engadget.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:hackers tricked chatgpt grok and google into helping them in:2025-12-10T18:57:11.000Z",
    "title": "Hackers tricked ChatGPT, Grok and Google into helping them install malware",
    "url": "https://www.engadget.com/cybersecurity/hackers-tricked-chatgpt-grok-and-google-into-helping-them-install-malware-185711492.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Sam Chapman",
    "published_at": "2025-12-10T18:57:11.000Z",
    "summary_long": "Ever since reporting earlier this year on how easy it is to trick an agentic browser, I've been following the intersections between modern AI and old-school scams. Now, there's a new convergence on the horizon: hackers are apparently using AI prompts to seed Google search results with dangerous commands. When executed by unknowing users, these commands prompt computers to give the hackers the access they need to install malware. The warning comes by way of a recent report from detection-and-response firm Huntress. Source: www.engadget.com. Date: 2025-12-10. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]