[
  {
    "id": "bigtech:nasa launches new mission to get the most out of the james w:2026-01-12T19:25:17.000Z",
    "title": "NASA launches new mission to get the most out of the James Webb Space Telescope",
    "url": "https://arstechnica.com/space/2026/01/nasas-newest-telescope-will-play-an-outsize-role-in-finding-earth-2-0/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2026-01-12T19:25:17.000Z",
    "summary_long": "Among other things, the James Webb Space Telescope is designed to get us closer to finding habitable worlds around faraway stars. From its perch a million miles from Earth, Webb's huge gold-coated mirror collects more light than any other telescope put into space. The Webb telescope, launched in 2021 at a cost of more than $10 billion, has the sensitivity to peer into distant planetary systems and detect the telltale chemical fingerprints of molecules critical to or indicative of potential life, like water vapor, carbon dioxide, and methane. Webb can do this while also observing the oldest observable galaxies in the Universe and studying planets, moons, and smaller objects within our own Solar System. Source: arstechnica.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:nasa topples towers used to test saturn rockets space shuttl:2026-01-12T15:21:38.000Z",
    "title": "NASA topples towers used to test Saturn rockets, space shuttle",
    "url": "https://arstechnica.com/space/2026/01/nasa-topples-towers-used-to-test-saturn-rockets-space-shuttle/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Robert Pearlman\n                ",
    "published_at": "2026-01-12T15:21:38.000Z",
    "summary_long": "Two historic NASA test facilities used in the development of the Saturn V and space shuttle launch vehicles have been demolished after towering over the Marshall Space Flight Center in Alabama since the start of the Space Age. The Propulsion and Structural Test Facility, which was erected in 1957—the same year the first artificial satellite entered Earth orbit—and the Dynamic Test Facility, which has stood since 1964, were brought down by a coordinated series of implosions on Saturday, January 10. Located in Marshall's East Test Area on the US Army's Redstone Arsenal in Huntsville, the two structures were no longer in use and, according to NASA, had a backlog of $25 million in needed repairs. \"This work reflects smart stewardship of taxpayer resources,\" Jared Isaacman, NASA administrator, said in a statement. Source: arstechnica.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:anthropic launches cowork a claude codelike for general comp:2026-01-12T23:42:09.000Z",
    "title": "Anthropic launches Cowork, a Claude Code-like for general computing",
    "url": "https://arstechnica.com/ai/2026/01/anthropic-launches-cowork-a-claude-code-like-for-general-computing/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Samuel Axon\n                ",
    "published_at": "2026-01-12T23:42:09.000Z",
    "summary_long": "Anthropic's agentic tool Claude Code has been an enormous hit with some software developers and hobbyists, and now the company is bringing that modality to more general office work with a new feature called Cowork. Built on the same foundations as Claude Code and baked into the macOS Claude desktop app, Cowork allows users to give Claude access to a specific folder on their computer and then give plain language instructions for tasks. Anthropic gave examples like filling out an expense report from a folder full of receipt photos, writing reports based on a big stack of digital notes, or reorganizing a folder (or cleaning up your desktop) based on a prompt. Read full article Comments Source: arstechnica.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bitgo aims to raise 201 million in ipo targeting 185 billion:2026-01-12T15:31:36.000Z",
    "title": "BitGo aims to raise $201 million in IPO targeting $1.85 billion valuation",
    "url": "https://www.coindesk.com/business/2026/01/12/bitgo-aims-to-raise-usd201-million-in-ipo-targeting-usd1-85-billion-valuation",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2026-01-12T15:31:36.000Z",
    "summary_long": "BitGo aims to raise $201 million in IPO targeting $1.85 billion valuation Source: www.coindesk.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:velafi raises 20 million in series b to expand stablecoin pa:2026-01-12T13:00:00.000Z",
    "title": "VelaFi raises $20 million in Series B to expand stablecoin payments infrastructure",
    "url": "https://www.coindesk.com/business/2026/01/12/velafi-raises-usd20-million-in-series-b-to-expand-stablecoin-payments-infrastructure",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2026-01-12T13:00:00.000Z",
    "summary_long": "VelaFi raises $20 million in Series B to expand stablecoin payments infrastructure Source: www.coindesk.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa spacex invite media to watch crew12 launch to space sta:2026-01-12T23:25:02.000Z",
    "title": "NASA, SpaceX Invite Media to Watch Crew-12 Launch to Space Station",
    "url": "https://www.nasa.gov/news-release/nasa-spacex-invite-media-to-watch-crew-12-launch-to-space-station/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jennifer M. Dooren",
    "published_at": "2026-01-12T23:25:02.000Z",
    "summary_long": "From left to right, NASA astronauts Jessica Meir and Jack Hathaway, ESA (European Space Agency) astronaut Sophie Adenot, and Roscosmos cosmonaut Andrey Fedyaev. NASA Media accreditation is open for the launch of NASA’s 12th rotational mission of a SpaceX Falcon 9 rocket and Dragon spacecraft carrying astronauts to the International Space Station for a science expedition from Space Launch Complex 40 at Cape Canaveral Space Force Station in Florida. NASA announced it is targeting no earlier than Thursday, Jan. 15, for a splashdown of its Crew-11 mission. Source: www.nasa.gov. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:legos first pokémon sets are now available for preorder:2026-01-12T20:55:27.000Z",
    "title": "Lego's first Pokémon sets are now available for pre-order",
    "url": "https://www.engadget.com/entertainment/legos-first-pokemon-sets-are-now-available-for-pre-order-205527102.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-12T20:55:27.000Z",
    "summary_long": "We learned last March that Lego and Pokémon would be joining forces and the first results of their partnership are here. Pre-orders for all three kits are open now, with an expected ship date of February 27. As one might have guessed from the lightning bolts on the previous promotional image, one of the debut pocket monsters getting the brick treatment is Pikachu, complete with a Poké Ball. The 2,050-piece kit can be built to show Pikachu either leaping out of the open Poké Ball into battle or at rest staring up at the builder, closed Poké Ball between his paws. Source: www.engadget.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:white dwarf star artists concept:2026-01-12T17:34:43.000Z",
    "title": "White Dwarf Star (Artist’s Concept)",
    "url": "https://www.nasa.gov/image-article/white-dwarf-star-artists-concept/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-01-12T17:34:43.000Z",
    "summary_long": "This artist’s concept depicts a smaller white dwarf star pulling material from a larger star, right, into an accretion disk. Scientists used NASA’s IXPE (Imaging X-ray Polarization Explorer) to study a white dwarf star and its X-ray polarization. MIT/Jose-Luis Olivares A smaller white dwarf star (left) pulls material from a larger star into a swirling accretion disk in this artist’s concept released Nov. 19, 2025, to illustrate the first use of NASA’s IXPE (Imaging X-ray Polarization Explorer) to study a white dwarf star. Source: www.nasa.gov. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apples siri ai will be powered by gemini:2026-01-12T17:03:13.000Z",
    "title": "Apple's Siri AI will be powered by Gemini",
    "url": "https://www.engadget.com/ai/apples-siri-ai-will-be-powered-by-gemini-153636649.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2026-01-12T17:03:13.000Z",
    "summary_long": "Apple and Google have confirmed reports that it will use Google Gemini’s models to help it power the new version of Siri and other generative AI features. CNBC first reported the news; Apple and Google subsequently released a joint statement which reads: “Apple and Google have entered into a multi-year collaboration under which the next generation of Apple Foundation Models will be based on Google's Gemini models and cloud technology. These models will help power future Apple Intelligence features, including a more personalized Siri coming this year. After careful evaluation, Apple determined that Google's Al technology provides the most capable foundation for Apple Foundation Models and is excited about the innovative new experiences it will unlock for Apple users. Source: www.engadget.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex launches 29 starlink satellites on falcon 9 rocket fr:2026-01-12T16:57:42.000Z",
    "title": "SpaceX launches 29 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "url": "https://spaceflightnow.com/2026/01/12/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-7/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-12T16:57:42.000Z",
    "summary_long": "Update Jan. 12, 5:50 p.m. EST (2250 UTC): SpaceX confirms deployment of the 29 Starlink satellites. Space completed its fifth Falcon 9 rocket launch of 2026 on Monday afternoon, continuing a brisk pace of launching at a rate slightly faster than once per 2.5 days. Source: spaceflightnow.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta appoints extrump and bush official as its new president:2026-01-12T15:10:48.000Z",
    "title": "Meta appoints ex-Trump and Bush official as its new president and vice chairman",
    "url": "https://www.engadget.com/big-tech/meta-appoints-ex-trump-and-bush-official-as-its-new-president-and-vice-chairman-151048263.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2026-01-12T15:10:48.000Z",
    "summary_long": "Meta has appointed Dina Powell McCormick, a banking executive and former Republican White House official, as its new president and vice-chairman. The company said McCormick will help guide its overall strategy and execution as a part of the management team. “Dina’s experience at the highest levels of global finance, combined with her deep relationships around the world, makes her uniquely suited to help Meta manage this next phase of growth as the company’s president and vice chairman,” said Meta Founder and CEO Mark Zuckerberg. McCormick was a partner at Goldman Sachs and ran its Global Sovereign investment banking business. Source: www.engadget.com. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:nonparametric kernel clustering with bandit feedback:2026-01-12T13:36:07.000Z",
    "title": "Nonparametric Kernel Clustering with Bandit Feedback",
    "url": "https://arxiv.org/abs/2601.07535v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Victor Thuot",
    "published_at": "2026-01-12T13:36:07.000Z",
    "summary_long": "Clustering with bandit feedback refers to the problem of partitioning a set of items, where the clustering algorithm can sequentially query the items to receive noisy observations. The problem is formally posed as the task of partitioning the arms of an N-armed stochastic bandit according to their underlying distributions, grouping two arms together if and only if they share the same distribution, using samples collected sequentially and adaptively. This setting has gained attention in recent years due to its applicability in recommendation systems and crowdsourcing. Existing works on clustering with bandit feedback rely on a strong assumption that the underlying distributions are sub-Gaussian. Source: arxiv.org. Date: 2026-01-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]