[
  {
    "id": "bigtech:fury over discords age checks explodes after shady persona t:2026-02-20T22:41:02.000Z",
    "title": "Fury over Discord’s age checks explodes after shady Persona test in UK",
    "url": "https://arstechnica.com/tech-policy/2026/02/discord-and-persona-end-partnership-after-shady-uk-age-test-sparks-outcry/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2026-02-20T22:41:02.000Z",
    "summary_long": "Shortly after Discord announced that all users will soon be defaulted to teen experiences until their ages are verified, the messaging platform faced immediate backlash. One of the major complaints was that Discord planned to collect more government IDs as part of its global age verification process. It shocked many that Discord would be so bold so soon after a third-party breach of a former age check partner's services recently exposed 70,000 Discord users' government IDs. Attempting to reassure users, Discord claimed that most users wouldn't have to show ID, instead relying on video selfies using AI to estimate ages, which raised separate privacy concerns. Source: arstechnica.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:fcc asks stations for proamerica programming like daily pled:2026-02-20T22:00:59.000Z",
    "title": "FCC asks stations for \"pro-America\" programming, like daily Pledge of Allegiance",
    "url": "https://arstechnica.com/tech-policy/2026/02/fcc-asks-stations-for-pro-america-programming-like-daily-pledge-of-allegiance/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2026-02-20T22:00:59.000Z",
    "summary_long": "Federal Communications Commission Chairman Brendan Carr today urged broadcasters to join a \"Pledge America Campaign\" that Carr established to support President Trump's \"Salute to America 250\" project. Carr said in a press release that \"I am inviting broadcasters to pledge to air programming in their local markets in support of this historic national, non-partisan celebration.\" The press release said Carr is asking broadcasters to \"air patriotic, pro-America programming in support of America’s 250th birthday.\" Carr gave what he called examples of content that broadcasters can run if they take the pledge. His examples include \"starting each broadcast day with the 'Star Spangled Banner' or Pledge of Allegiance\"; airing \"PSAs, short segments, or full specials specifically promoting civic education, inspiring local stories, and American history\"; running \"segments during regular news programming that highlight local sites that are significant to American and regional history, such as National Park Service sites\"; airing \"music by America’s greatest composers, such as John Philip Sousa, Aaron…",
    "tags": []
  },
  {
    "id": "bigtech:nintendo brings gbaera pokémon to the switch but not switch :2026-02-20T16:30:21.000Z",
    "title": "Nintendo brings GBA-era Pokémon to the Switch, but not Switch Online subscribers",
    "url": "https://arstechnica.com/gaming/2026/02/pokemon-red-and-greens-gba-remakes-are-getting-re-released-on-switch-for-20-a-pop/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-02-20T16:30:21.000Z",
    "summary_long": "For my money, the 2004 Game Boy Advance re-releases of Pokémon FireRed and LeafGreen are still the best versions of the original Pokémon games. They fixed most of the bugs and balance issues present in the originals—partly by also including the rosters from Gold/Silver and Ruby/Sapphire—but they're more faithful to the original gameplay, battling and catching mechanics, and graphics than the 2018 Let's Go, Pikachu/Eevee! adaptations for the Switch. Someone at Nintendo apparently agrees, as the company announced today that it's re-releasing those games for the original Switch (and, by extension, the Switch 2, though no Switch 2-specific features were announced). Source: arstechnica.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage falcon 9 to launch 25 starlink satellites afte:2026-02-20T22:46:55.000Z",
    "title": "Live coverage: Falcon 9 to launch 25 Starlink satellites after weather delays",
    "url": "https://spaceflightnow.com/2026/02/20/live-coverage-falcon-9-to-launch-25-starlink-satellites-after-weather-delays/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Spaceflight Now",
    "published_at": "2026-02-20T22:46:55.000Z",
    "summary_long": "SpaceX is counting down to the launch of a Falcon 9 rocket carrying 25 Starlink satellites from California, after days of delay. Liftoff from Space Launch Complex 4 East at Vandenberg Space Force Base is scheduled for 1:04:19 a.m. PST (4:04:19 a.m. EST / 0904:19 UTC). Source: spaceflightnow.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:mississippi hospital system closes all clinics after ransomw:2026-02-20T17:40:05.000Z",
    "title": "Mississippi hospital system closes all clinics after ransomware attack",
    "url": "https://techxplore.com/news/2026-02-mississippi-hospital-clinics-ransomware.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-20T17:40:05.000Z",
    "summary_long": "Mississippi hospital system closes all clinics after ransomware attack Source: techxplore.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:openai will reportedly release an aipowered smart speaker in:2026-02-20T17:33:45.000Z",
    "title": "OpenAI will reportedly release an AI-powered smart speaker in 2027",
    "url": "https://www.engadget.com/ai/openai-will-reportedly-release-an-ai-powered-smart-speaker-in-2027-173344866.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2026-02-20T17:33:45.000Z",
    "summary_long": "OpenAI is reportedly hard at work developing a series of AI-powered devices, including smart glasses, a smart speaker and a smart lamp. According to reporting by The Information, the AI company has a team of over 200 employees dedicated to the project. The first product scheduled to be released is reported to be a smart speaker that would include a camera, allowing it to better absorb information about its users and surroundings. According to a person familiar with the project, this would extend to identifying objects on a nearby table, as well as conversations being held in the vicinity of the speaker. Source: www.engadget.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:artemis ii crew trains on t38:2026-02-20T14:50:53.000Z",
    "title": "Artemis II Crew Trains on T-38",
    "url": "https://www.nasa.gov/image-article/artemis-ii-crew-trains-on-t-38/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-02-20T14:50:53.000Z",
    "summary_long": "NASA/Brendan Finnegan NASA astronaut Christina Koch and Canadian Space Agency astronaut Jeremy Hansen take off on a T-38 training flight from Ellington Field on Feb. 11, 2026, as a waning crescent Moon hovers above. Koch and Hansen, along with NASA astronauts Reid Wiseman and Victor Glover, are part of NASA’s Artemis II mission, the first crewed flight of the Space Launch System rocket and Orion spacecraft. Artemis II will fly around the Moon and back to test Orion’s systems and capabilities before returning the crew to a splashdown off the California coast. Source: www.nasa.gov. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:our first proof submissions:2026-02-20T14:30:00.000Z",
    "title": "Our First Proof submissions",
    "url": "https://openai.com/index/first-proof-submissions",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-02-20T14:30:00.000Z",
    "summary_long": "Our First Proof submissions Source: openai.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:samsung updates bixby to become more conversational:2026-02-20T11:26:49.000Z",
    "title": "Samsung updates Bixby to become more conversational",
    "url": "https://www.engadget.com/mobile/smartphones/samsung-updates-bixby-to-become-more-conversational-112649179.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2026-02-20T11:26:49.000Z",
    "summary_long": "Bixby isn’t typically part of the conversation when it comes to virtual assistants for mobile devices, but Samsung is clearly hoping that you would use it more. The company has launched the latest version of Bixby with the new One UI 8.5 beta, and it has been tweaked to work as a “conversational agent.” Samsung says you’ll now be able to talk to it and give it tasks using natural language, like how you’d talk to other people or, these days, to chatbots. You don’t have to remember exact commands or names for specific settings. You can just describe what you want to happen, such as “I don’t want the screen to time out while I’m still looking at it.” Bixby will then automatically turn on the “Keep Screen on While Viewing” setting. Source: www.engadget.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:ubisoft lays off 40 staff working on splinter cell remake sa:2026-02-20T15:11:40.000Z",
    "title": "Ubisoft lays off 40 staff working on Splinter Cell remake, says game remains in development",
    "url": "https://www.engadget.com/gaming/ubisoft-lays-off-40-staff-working-on-splinter-cell-remake-says-game-remains-in-development-151139753.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-02-20T15:11:40.000Z",
    "summary_long": "It has already been a depressingly busy year for layoffs at Ubisoft, and the French publisher’s Toronto studio is the latest workforce to be hit. Around 40 jobs have been cut at the studio, which is one of Ubisoft’s largest and has previously worked on games including Watch Dogs: Legion and Far Cry 6. \"This decision was not taken lightly and does not in any way reflect the talent, dedication, or contributions of the individuals affected,\" Ubisoft said in a statement to Mobile Syrup, which first reported the new layoffs. \"Our priority now is to support them through this transition with comprehensive severance packages and robust career placement assistance.\" Ubisoft Toronto is currently working on the long-awaited Splinter Cell remake, which was first announced in 2021. Source: www.engadget.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:ring cancels its partnership with flock:2026-02-20T12:08:51.000Z",
    "title": "Ring Cancels Its Partnership with Flock",
    "url": "https://www.schneier.com/blog/archives/2026/02/ring-cancels-its-partnership-with-flock.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2026-02-20T12:08:51.000Z",
    "summary_long": "Ring Cancels Its Partnership with Flock Source: www.schneier.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:humanoid home robots are on the marketbut do we really want :2026-02-20T21:40:05.000Z",
    "title": "Humanoid home robots are on the market—but do we really want them?",
    "url": "https://techxplore.com/news/2026-02-humanoid-home-robots.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-20T21:40:05.000Z",
    "summary_long": "Humanoid home robots are on the market—but do we really want them? Source: techxplore.com. Date: 2026-02-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]