[
  {
    "id": "bigtech:streaming service makes rare decision to lower its monthly f:2025-12-05T22:56:51.000Z",
    "title": "Streaming service makes rare decision to lower its monthly fees",
    "url": "https://arstechnica.com/gadgets/2025/12/fubo-lowers-its-prices-by-up-to-15-after-losing-nbcuniversal-channels/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Scharon Harding\n                ",
    "published_at": "2025-12-05T22:56:51.000Z",
    "summary_long": "Somewhere, a pig is catching some sweet air. In a rare move for a streaming service, Fubo announced today that it’s lowering the prices for some of its subscription plans. Fubo is a sports-focused vMVPD (virtual multichannel video programming distributor, or a company that enables people to watch traditional TV channels live over the Internet). Disney closed its acquisition of Fubo in October. Source: arstechnica.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:toyotas new gr gt picks up where the 2000gt and lexus lfa le:2025-12-05T15:55:52.000Z",
    "title": "Toyota’s new GR GT picks up where the 2000GT and Lexus LFA left off",
    "url": "https://arstechnica.com/cars/2025/12/toyota-busts-out-a-new-flagship-gazoo-racing-coupe-plus-gt3-version/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jonathan M. Gitlin\n                ",
    "published_at": "2025-12-05T15:55:52.000Z",
    "summary_long": "There’s some Toyota news today that doesn’t involve the chairman wearing a MAGA hat. The Japanese automaker evidently decided it’s been too long since it flexed its engineering chops on something with two doors and plenty of power, so it has rectified that situation with a new flagship coupe for its Gazoo Racing sporty sub-brand. Meet the GR GT, which looks set to go on sale toward the end of next year. The Camry-esque look at the front, and to an extent the rear, came second to the GR GT’s aerodynamics, which is the opposite way to how Toyota usually styles its cars. Source: arstechnica.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:rocket report blunder at baikonur do launchers really need r:2025-12-05T12:00:57.000Z",
    "title": "Rocket Report: Blunder at Baikonur; do launchers really need rocket engines?",
    "url": "https://arstechnica.com/space/2025/12/rocket-report-openais-launch-overture-south-korea-making-progress-in-space/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-12-05T12:00:57.000Z",
    "summary_long": "Welcome to Edition 8.21 of the Rocket Report! We’re back after the Thanksgiving holiday with more launch news. Most of the big stories over the last couple of weeks came from abroad. Russian rockets and launch pads didn’t fare so well. Source: arstechnica.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:x hit with 140 million fine from the eu:2025-12-05T16:12:59.000Z",
    "title": "X hit with $140 million fine from the EU",
    "url": "https://www.engadget.com/big-tech/x-hit-with-140-million-fine-from-the-eu-161259324.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2025-12-05T16:12:59.000Z",
    "summary_long": "The European Commission has fined Elon Musk’s X €120 million (around $140 million) for breaching its transparency rules under the Digital Services Act. The European Union’s executive arm announced that it was investigating the social media company’s blue checkmarking verification system — first introduced when it was still known as Twitter — last year, along with other alleged DSA violations. Today’s verdict concerns the \"deceptive design\" of the checkmark, as well as \"the lack of transparency of [X's] advertising repository, and the failure to provide access to public data for researchers.\" The Commission's issue with X’s verification system is that where blue checkmarks were once something that Twitter that Twitter vetted, they can now be bough by anyone. According to the EU, this puts users at risk of scams and impersonation fraud, as they can’t tell if the accounts they’re engaging with are authentic. Source: www.engadget.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "consumer:metas latest acquisition suggests hardware plans beyond glas:2025-12-05T21:29:30.000Z",
    "title": "Meta's latest acquisition suggests hardware plans beyond glasses and headsets",
    "url": "https://www.engadget.com/ai/metas-latest-acquisition-suggests-hardware-plans-beyond-glasses-and-headsets-212930339.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-12-05T21:29:30.000Z",
    "summary_long": "Meta has acquired Limitless, the maker of an AI-powered \"Pendant,\" to work on building consumer hardware for the company, the startup announced via a YouTube video and blog post. So far, Meta has focused on selling VR headsets and AI smart glasses. Now the company seems interested in branching out. \"Meta recently announced a new vision to bring personal superintelligence to everyone and a key part of that vision is building incredible AI-enabled wearables. Source: www.engadget.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:chinese hackers reportedly targeting government entities usi:2025-12-05T13:35:01.000Z",
    "title": "Chinese hackers reportedly targeting government entities using 'Brickstorm' malware",
    "url": "https://www.engadget.com/big-tech/chinese-hackers-reportedly-targeting-government-entities-using-brickstorm-malware-133501894.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2025-12-05T13:35:01.000Z",
    "summary_long": "Hackers with links to China reportedly successfully infiltrated a number of unnamed government and tech entities using advanced malware. As reported by Reuters, cybersecurity agencies from the US and Canada confirmed the attack, which used a backdoor known as “Brickstorm” to target organizations using the VMware vSphere cloud computing platform. As detailed in a report published by the Canadian Centre for Cyber Security on December 4, PRC state-sponsored hackers maintained \"long-term persistent access\" to an unnamed victim’s internal network. After compromising the affected platform, the cybercriminals were able to steal credentials, manipulate sensitive files and create \"rogue, hidden VMs\" (virtual machines), effectively seizing control unnoticed. Source: www.engadget.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:softbanks son says super ai could make humans like fish win :2025-12-05T09:19:33.000Z",
    "title": "Softbank's Son says super AI could make humans like fish, win Nobel Prize",
    "url": "https://techxplore.com/news/2025-12-softbank-son-super-ai-humans.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-05T09:19:33.000Z",
    "summary_long": "Softbank's Son says super AI could make humans like fish, win Nobel Prize Source: techxplore.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:small texas lender monet joining field of cryptofocused bank:2025-12-06T00:23:42.000Z",
    "title": "Small Texas Lender Monet Joining Field of Crypto-Focused Banks",
    "url": "https://www.coindesk.com/policy/2025/12/05/small-texas-lender-monet-joining-field-of-crypto-focused-banks",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jesse Hamilton",
    "published_at": "2025-12-06T00:23:42.000Z",
    "summary_long": "Small Texas Lender Monet Joining Field of Crypto-Focused Banks Source: www.coindesk.com. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:friday squid blogging vampire squid genome:2025-12-05T22:06:14.000Z",
    "title": "Friday Squid Blogging: Vampire Squid Genome",
    "url": "https://www.schneier.com/blog/archives/2025/12/friday-squid-blogging-vampire-squid-genome.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2025-12-05T22:06:14.000Z",
    "summary_long": "The vampire squid (Vampyroteuthis infernalis) has the largest cephalopod genome ever sequenced: more than 11 billion base pairs. That’s more than twice as large as the biggest squid genomes. It’s technically not a squid: “The vampire squid is a fascinating twig tenaciously hanging onto the cephalopod family tree. It’s neither a squid nor an octopus (nor a vampire), but rather the last, lone remnant of an ancient lineage whose other members have long since vanished.” As usual, you can also use this squid post to talk about the security stories in the news that I haven’t covered. Source: www.schneier.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:russian banking giant vtb to become countrys first to offer :2025-12-05T14:38:58.000Z",
    "title": "Russian Banking Giant VTB to Become Country's First to Offer Spot Crypto Trading: Report",
    "url": "https://www.coindesk.com/business/2025/12/05/russian-banking-giant-vtb-to-become-country-s-first-to-offer-spot-crypto-trading-report",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2025-12-05T14:38:58.000Z",
    "summary_long": "Russian Banking Giant VTB to Become Country's First to Offer Spot Crypto Trading: Report Source: www.coindesk.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:invention challenge brings student engineers to nasa jpl:2025-12-06T02:05:41.000Z",
    "title": "Invention Challenge Brings Student Engineers to NASA JPL",
    "url": "https://www.nasa.gov/centers-and-facilities/jpl/invention-challenge-brings-student-engineers-to-nasa-jpl/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Naomi Hartono",
    "published_at": "2025-12-06T02:05:41.000Z",
    "summary_long": "Now in its 26th year, the event brings teams of middle and high school students to the lab to compete with home-built contraptions. Teenagers wielding power tools and plywood demonstrated their engineering prowess at the annual Invention Challenge at NASA’s Jet Propulsion Laboratory in Southern California on Friday. Also in evidence: lots of small motors, 3D-printed gears, PVC pipe, and duct tape. First held at JPL in 1998, the event pits middle and high school teams against each other as they try to get handmade devices to accomplish a task that changes annually. Source: www.nasa.gov. Date: 2025-12-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:the ads that sell the sizzle of genetic trait discrimination:2025-12-05T11:00:00.000Z",
    "title": "The ads that sell the sizzle of genetic trait discrimination",
    "url": "https://www.technologyreview.com/2025/12/05/1128755/selling-the-sizzle-of-trait-discrimination/",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "www.technologyreview.com",
    "author": "Antonio Regalado",
    "published_at": "2025-12-05T11:00:00.000Z",
    "summary_long": "One day this fall, I watched an electronic sign outside the Broadway-Lafayette subway station in Manhattan switch seamlessly between an ad for makeup and one promoting the website Pickyourbaby.com, which promises a way for potential parents to use genetic tests to influence their baby’s traits, including eye color, hair color, and IQ. Inside the station, every surface was wrapped with more ads—babies on turnstiles, on staircases, on banners overhead. “Think about it. Makeup and then genetic optimization,” exulted Kian Sadeghi, the 26-year-old founder of Nucleus Genomics, the startup running the ads. Source: www.technologyreview.com. Date: 2025-12-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]