[
  {
    "id": "bigtech:a single click mounted a covert multistage attack against co:2026-01-14T22:03:11.000Z",
    "title": "A single click mounted a covert, multistage attack against Copilot",
    "url": "https://arstechnica.com/security/2026/01/a-single-click-mounted-a-covert-multistage-attack-against-copilot/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2026-01-14T22:03:11.000Z",
    "summary_long": "Microsoft has fixed a vulnerability in its Copilot AI assistant that allowed hackers to pluck a host of sensitive user data with a single click on a legitimate URL. The hackers in this case were white-hat researchers from security firm Varonis. The net effect of their multistage attack was that they exfiltrated data, including the target’s name, location, and details of specific events from the user’s Copilot chat history. The attack continued to run even when the user closed the Copilot chat, with no further interaction needed once the user clicked the link, a legitimate Copilot one, in the email. Source: arstechnica.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:bandcamp bans purely aigenerated music from its platform:2026-01-14T17:46:19.000Z",
    "title": "Bandcamp bans purely AI-generated music from its platform",
    "url": "https://arstechnica.com/ai/2026/01/bandcamp-bans-purely-ai-generated-music-from-its-platform/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2026-01-14T17:46:19.000Z",
    "summary_long": "On Tuesday, Bandcamp announced on Reddit that it will no longer permit AI-generated music on its platform. \"Music and audio that is generated wholly or in substantial part by AI is not permitted on Bandcamp,\" the company wrote in a post to the r/bandcamp subreddit. The new policy also prohibits \"any use of AI tools to impersonate other artists or styles.\" The policy draws a line that some in the music community have debated: Where does tool use end and full automation begin? AI models are not artists in themselves, since they lack personhood and creative intent. Source: arstechnica.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:bill gatesbacked type one energy raises 87m ahead of 250m se:2026-01-14T16:39:49.000Z",
    "title": "Bill Gates-backed Type One Energy raises $87M ahead of $250M Series B",
    "url": "https://techcrunch.com/2026/01/14/bill-gates-backed-type-one-energy-raises-87m-ahead-of-250m-series-b/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Tim De Chant",
    "published_at": "2026-01-14T16:39:49.000Z",
    "summary_long": "Bill Gates-backed Type One Energy raises $87M ahead of $250M Series B Source: techcrunch.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:coverage briefing set for nasas artemis ii moon rocket roll :2026-01-14T22:26:49.000Z",
    "title": "Coverage, Briefing Set for NASA’s Artemis II Moon Rocket Roll to Pad",
    "url": "https://www.nasa.gov/news-release/coverage-briefing-set-for-nasas-artemis-ii-moon-rocket-roll-to-pad/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jennifer M. Dooren",
    "published_at": "2026-01-14T22:26:49.000Z",
    "summary_long": "NASA’s SLS (Space Launch System) rocket is seen inside High Bay 3 of the Vehicle Assembly Building as teams await the arrival of Artemis II crewmembers to board their Orion spacecraft on top of the rocket as part of the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025, at NASA’s Kennedy Space Center in Florida. Credit: NASA/Joel Kowsky NASA’s integrated SLS (Space Launch System) rocket and Orion spacecraft for the Artemis II mission is inching closer to launch – literally. The agency is targeting no earlier than 7 a.m. Source: www.nasa.gov. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:28 advocacy groups call on apple and google to ban grok x ov:2026-01-14T21:50:48.000Z",
    "title": "28 advocacy groups call on Apple and Google to ban Grok, X over nonconsensual deepfakes",
    "url": "https://www.engadget.com/big-tech/28-advocacy-groups-call-on-apple-and-google-to-ban-grok-x-over-nonconsensual-deepfakes-215048460.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2026-01-14T21:50:48.000Z",
    "summary_long": "Elon Musk isn't the only party at fault for Grok's nonconsensual intimate deepfakes of real people, including children. What about Apple and Google? The two (frequently virtue-signaling) companies have inexplicably allowed Grok and X to remain in their app stores — even as Musk's chatbot reportedly continues to produce the material. On Wednesday, a coalition of women's and progressive advocacy groups called on Tim Cook and Sundar Pichai to uphold their own rules and remove the apps. Source: www.engadget.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:california is investigating grok over aigenerated csam and n:2026-01-14T20:20:29.000Z",
    "title": "California is investigating Grok over AI-generated CSAM and nonconsensual deepfakes",
    "url": "https://www.engadget.com/ai/california-is-investigating-grok-over-ai-generated-csam-and-nonconsensual-deepfakes-202029635.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Karissa Bell",
    "published_at": "2026-01-14T20:20:29.000Z",
    "summary_long": "California authorities have launched an investigation into xAI following weeks of reports that the chatbot was generating sexualized images of children. \"xAI appears to be facilitating the large-scale production of deepfake nonconsensual intimate images that are being used to harass women and girls across the internet, including via the social media platform X,\" California Attorney General Rob Bonta's office said in a statement. The statement cited a report that \"more than half of the 20,000 images generated by xAI between Christmas and New Years depicted people in minimal clothing,\" including some that appeared to be children. \"We have zero tolerance for the AI-based creation and dissemination of nonconsensual intimate images or of child sexual abuse material,” Bonta said. Source: www.engadget.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:how policy people and power interact to determine the future:2026-01-14T19:28:17.000Z",
    "title": "How policy, people, and power interact to determine the future of the electric grid",
    "url": "https://techxplore.com/news/2026-01-policy-people-power-interact-future.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-14T19:28:17.000Z",
    "summary_long": "When energy researchers talk about the future of the grid, they often focus on individual pieces: solar panels, batteries, nuclear plants, or new transmission lines. But in a recent study, urban systems researcher Anton Rozhkov takes a different approach—treating the energy system itself as a complex, evolving organism shaped as much by policy and human behavior as by technology. Source: techxplore.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:hacking wheelchairs over bluetooth:2026-01-14T19:22:15.000Z",
    "title": "Hacking Wheelchairs over Bluetooth",
    "url": "https://www.schneier.com/blog/archives/2026/01/hacking-wheelchairs-over-bluetooth.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2026-01-14T19:22:15.000Z",
    "summary_long": "Researchers have demonstrated remotely controlling a wheelchair over Bluetooth. CISA has issued an advisory. > CISA said the WHILL wheelchairs did not enforce authentication for Bluetooth connections, allowing an attacker who is in Bluetooth range of the targeted device to pair with it. The attacker could then control the wheelchair’s movements, override speed restrictions, and manipulate configuration profiles, all without requiring credentials or user interaction. Source: www.schneier.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:communitypowered security with ai an open source framework f:2026-01-14T18:45:09.000Z",
    "title": "Community-powered security with AI: an open source framework for security research",
    "url": "https://github.blog/security/community-powered-security-with-ai-an-open-source-framework-for-security-research/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Kevin Backhouse",
    "published_at": "2026-01-14T18:45:09.000Z",
    "summary_long": "Since its founding in 2019, GitHub Security Lab has had one primary goal: community-powered security. We believe that the best way to improve software security is by sharing knowledge and tools, and by using open source software so that everybody is empowered to audit the code and report any vulnerabilities that they find. Six years later, a new opportunity has emerged to take community-powered security to the next level. Thanks to AI, we can now use natural language to encode, share, and scale our security knowledge, which will make it even easier to build and share new security tools. Source: github.blog. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:he could just turn it off:2026-01-14T18:02:09.000Z",
    "title": "He could just turn it off",
    "url": "https://www.engadget.com/he-could-just-turn-it-off-180209551.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Avery Ellis",
    "published_at": "2026-01-14T18:02:09.000Z",
    "summary_long": "Generative AI, we are repeatedly told, is a transformative and complicated technology. So complicated that its own creators are unable to explain why it acts the way it does, and so transformative that we'd be fools to stand in the way of progress. Even when progress resembles a machine for undressing strangers without their consent on an unprecedented scale, as has been the case of late with Elon Musk's Grok chatbot. UK Prime Minister Kier Starmer seems to have so fully bought into the grand lie of the AI bubble that he was willing to announce: > \"I have been informed this morning that X is acting to ensure full compliance with UK law.\" Not that it currently is in compliance. Source: www.engadget.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:senate banking chairman scott trumptied ethics clash doesnt :2026-01-14T17:35:59.000Z",
    "title": "Senate banking chairman Scott: Trump-tied ethics clash doesn't belong in his crypto bill",
    "url": "https://www.coindesk.com/policy/2026/01/14/senate-banking-chairman-scott-says-trump-tied-ethics-debate-doesn-t-belong-in-his-crypto-bill",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jesse Hamilton",
    "published_at": "2026-01-14T17:35:59.000Z",
    "summary_long": "Senate banking chairman Scott: Trump-tied ethics clash doesn't belong in his crypto bill Source: www.coindesk.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:your voice gives away valuable personal informationexpert ra:2026-01-14T16:33:23.000Z",
    "title": "Your voice gives away valuable personal information—expert raises privacy concerns",
    "url": "https://techxplore.com/news/2026-01-voice-valuable-personal-expert-privacy.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-14T16:33:23.000Z",
    "summary_long": "You can probably quickly tell from a friend's tone of voice whether they're feeling happy or sad, energetic or exhausted. Computers can already do a similar analysis, and soon they'll be able to extract a lot more information. It's something we should all be concerned about, according to Associate Professor in Speech and Language Technology, Tom Bäckström. Personal information encoded in your voice could lead to increased insurance premiums or to advertising that exploits your emotional state. Source: techxplore.com. Date: 2026-01-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]