[
  {
    "id": "bigtech:nearly 80 of americans want congress to extend aca tax credi:2025-10-03T21:56:53.000Z",
    "title": "Nearly 80% of Americans want Congress to extend ACA tax credits, poll finds",
    "url": "https://arstechnica.com/health/2025/10/most-americans-want-aca-tax-credits-extended-even-57-of-maga-supporters/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2025-10-03T21:56:53.000Z",
    "summary_long": "According to new polling data, nearly 80 percent of Americans support extending Affordable Care Act (ACA) enhanced premium tax credits, which are set to expire at the end of this year—and are at the center of a funding dispute that led to a shutdown of the federal government this week. The poll, conducted by KFF and released Friday, found that 78 percent of Americans want the tax credits extended, including 92 percent of Democrats, 59 percent of Republicans—and even a majority (57 percent) of Republicans who identify as Donald Trump-aligned MAGA (Make America Great Again) supporters. A separate analysis published by KFF earlier this week found that if the credits are not extended, monthly premiums for ACA Marketplace plans would more than double on average. Specifically, the current average premium of $888 would jump to $1,904 in 2026, a 114 percent increase. Source: arstechnica.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:removing these 50 objects from orbit would cut danger from s:2025-10-03T20:33:15.000Z",
    "title": "Removing these 50 objects from orbit would cut danger from space junk in half",
    "url": "https://arstechnica.com/space/2025/10/everyone-but-china-has-pretty-much-stopped-littering-in-low-earth-orbit/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-10-03T20:33:15.000Z",
    "summary_long": "A new listing of the 50 most concerning pieces of space debris in low-Earth orbit is dominated by relics more than a quarter-century old, primarily dead rockets left to hurtle through space at the end of their missions. \"The things left before 2000 are still the majority of the problem,\" said Darren McKnight, lead author of a paper presented Friday at the International Astronautical Congress in Sydney. \"Seventy-six percent of the objects in the top 50 were deposited last century, and 88 percent of the objects are rocket bodies. That's important to note, especially with some disturbing trends right now.\" The 50 objects identified by McKnight and his coauthors are the ones most likely to drive the creation of more space junk in low-Earth orbit (LEO) through collisions with other debris fragments. Source: arstechnica.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:rocket report alpha explodes on test stand europe wants a mi:2025-10-03T11:00:19.000Z",
    "title": "Rocket Report: Alpha explodes on test stand; Europe wants a mini Starship",
    "url": "https://arstechnica.com/space/2025/10/rocket-report-alpha-explodes-on-test-stand-europe-wants-a-mini-starship/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-10-03T11:00:19.000Z",
    "summary_long": "Welcome to Edition 8.13 of the Rocket Report! It's difficult for me to believe, but we have now entered the fourth quarter of the year. Accordingly, there are three months left in 2025, with a lot of launch action still to come. The remainder of the year will be headlined by Blue Origin's New Glenn rocket making its second flight (and landing attempt), and SpaceX's Starship making its final test flight of the year. Source: arstechnica.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:tether looking to launch tokenized gold treasury firm with a:2025-10-03T21:05:17.000Z",
    "title": "Tether Looking to Launch Tokenized Gold Treasury Firm With Antalpha Raising $200M: Report",
    "url": "https://www.coindesk.com/business/2025/10/03/tether-looking-to-launch-tokenized-gold-treasury-firm-with-antalpha-raising-usd200m-report",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-10-03T21:05:17.000Z",
    "summary_long": "Tether, the company behind the USDT stablecoin (USDT), is working with crypto miner financing firm Antalpha to raise at least $200 million for a new digital asset treasury for tokenized gold, Bloomberg reported Friday, citing sources familiar with the matter. The planned vehicle would stockpile Tether Gold (XAUT), a blockchain-based token backed by physical gold bars under custody in a Swiss vault. XAUT is the largest tokenized gold offering on the market with nearly $1.5 billion market capitalization. Antalpha is known as a key lender of Chinese crypto mining equipment manufacturer Bitmain, and offers supply chain and margin loans. Source: www.coindesk.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:vaneck registers lido staked ethereum etf trust in delaware :2025-10-03T16:19:16.000Z",
    "title": "VanEck Registers Lido Staked Ethereum ETF Trust in Delaware, Eyes SEC Approval",
    "url": "https://www.coindesk.com/markets/2025/10/03/vaneck-registers-lido-staked-ethereum-etf-trust-in-delaware-eyes-sec-approval",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2025-10-03T16:19:16.000Z",
    "summary_long": "VanEck has taken an early step toward launching a staked Ethereum exchange-traded fund (ETF) by registering a statutory trust for the product in Delaware, a public filing dated October 2 shows. The proposed product, named the VanEck Lido Staked Ethereum ETF, would give investors exposure to ether (ETH) that is staked through Lido, a decentralized protocol that lets users earn staking rewards without locking up assets themselves. Registering the trust is a procedural first move and does not yet represent a formal ETF application with the Securities and Exchange Commission (SEC). Lido dominadtes Ethereum staking, with about $38 billion worth of ETH — roughly one-third of all staked ether — currently locked in the protocol. Source: www.coindesk.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:hbar faces sharp selloff as technical breakdown deepens bear:2025-10-03T16:18:52.000Z",
    "title": "HBAR Faces Sharp Selloff as Technical Breakdown Deepens Bearish Trend",
    "url": "https://www.coindesk.com/markets/2025/10/03/hbar-faces-sharp-selloff-as-technical-breakdown-deepens-bearish-trend",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-10-03T16:18:52.000Z",
    "summary_long": "HBAR saw sharp selling pressure on Oct. 3, with momentum intensifying in the final hour of trading. After briefly reaching $0.224, the token fell to $0.222, breaching key support and ending the session down 0.9%. The steepest drop came between 13:50 and 14:00, when volumes spiked above 3 million, signaling institutional distribution and panic-driven selling. Source: www.coindesk.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:ai could make it easier to create bioweapons that bypass cur:2025-10-03T16:10:02.000Z",
    "title": "AI could make it easier to create bioweapons that bypass current security protocols",
    "url": "https://techxplore.com/news/2025-10-ai-easier-bioweapons-bypass-current.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-03T16:10:02.000Z",
    "summary_long": "Artificial intelligence is transforming biology and medicine by accelerating the discovery of new drugs and proteins and making it easier to design and manipulate DNA, the building blocks of life. But as with most new technologies, there is a potential downside. The same AI tools could be used to develop dangerous new pathogens and toxins that bypass current security checks. In a new study from Microsoft, scientists employed a hacker-style test to demonstrate that AI-generated sequences could evade security software used by DNA manufacturers. Source: techxplore.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:google is also removing apps used to report sightings of ice:2025-10-03T19:29:40.000Z",
    "title": "Google is also removing apps used to report sightings of ICE agents",
    "url": "https://www.engadget.com/apps/google-is-also-removing-apps-used-to-report-sightings-of-ice-agents-192940612.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-10-03T19:29:40.000Z",
    "summary_long": "Following Apple's removal of ICEBlock from the App Store, an app used to report on the activity of Immigration and Customs Enforcement agents, 404 Media reports that Google is also removing similar apps from the Play Store. In a statement to Engadget, Google said \"ICEBlock was never available on Google Play, but we removed similar apps for violations of our policies.\" Google says that it decided to remove apps that shared the location of a vulnerable group following a violent act that involved the group and a similar collection of apps. It suggests the apps were also removed because they didn't appropriately moderate user-generated content. To be offered in the Play Store, apps with user-generated content have to clearly define what is or isn't objectionable content in their terms of service, and make sure those terms line up with Google's definitions of inappropriate content for Google Play. Source: www.engadget.com. Date: 2025-10-03.",
    "tags": []
  },
  {
    "id": "consumer:congress let a key cybersecurity law expire this week leavin:2025-10-03T17:45:29.000Z",
    "title": "Congress let a key cybersecurity law expire this week, leaving US networks more vulnerable",
    "url": "https://www.engadget.com/cybersecurity/congress-let-a-key-cybersecurity-law-expire-this-week-leaving-us-networks-more-vulnerable-174529522.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2025-10-03T17:45:29.000Z",
    "summary_long": "There's a long list of reasons US stability is now teetering between \"Fyre Festival\" and \"Charlie Sheen's 'Tiger Blood' era.\" Now you can add cybersecurity to the tally. A crucial cyber defense law, the Cybersecurity Information Sharing Act of 2015 (CISA 2015), has lapsed. With the government out of commission, the nation's computer networks are more exposed for… who knows how long. Welcome to 2025, baby. Source: www.engadget.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:can ai technology help solve societal environmental and heal:2025-10-03T15:38:04.000Z",
    "title": "Can AI technology help solve societal environmental and health issues?",
    "url": "https://techxplore.com/news/2025-10-ai-technology-societal-environmental-health.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-03T15:38:04.000Z",
    "summary_long": "Can AI technology help solve societal environmental and health issues? Source: techxplore.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:indonesia suspends tiktoks operating licence for allegedly w:2025-10-03T14:51:35.000Z",
    "title": "Indonesia suspends TikTok’s operating licence for allegedly withholding data",
    "url": "https://www.engadget.com/big-tech/indonesia-suspends-tiktoks-operating-licence-for-allegedly-withholding-data-145134189.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2025-10-03T14:51:35.000Z",
    "summary_long": "Indonesia has suspended TikTok’s operational registration status in the country, alleging that the social media platform did not fully co-operate with a request to share its data during nationwide protests in August. In a statement, Alexander Sabar, an official from Indonesia’s digital and communications ministry, said TikTok had violated national laws by only providing partial data while the protests were ongoing between August 23 and 30. Sabar said TikTok was given until September 23 to hand over its data related to traffic, streaming and monetization, after it emerged that some accounts with links to online gambling may have profited from TikTok livestreams during the protests. All forms of gambling are illegal under Indonesian law. Source: www.engadget.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:cobalt exsolution technique boosts solid oxide fuel cell per:2025-10-03T13:27:04.000Z",
    "title": "Cobalt exsolution technique boosts solid oxide fuel cell performance",
    "url": "https://techxplore.com/news/2025-10-cobalt-exsolution-technique-boosts-solid.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-03T13:27:04.000Z",
    "summary_long": "Fuel cells are an efficient, clean alternative to traditional fossil-fuel-based energy systems. Solid oxide fuel cells (SOFCs) are especially attractive due to their ability to use multiple fuels, high efficiency and reversibility. Cobalt (Co)-doped rare-earth layered perovskite oxides are attractive cathode materials for low- and medium-temperature SOFCs. They offer excellent electrochemical performance, owing to their high oxygen content and flexible control of oxygen transport. Source: techxplore.com. Date: 2025-10-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]