[
  {
    "id": "fintech:xrp slides 3 as bitcoin pullback overshadows record etf laun:2025-09-22T04:07:48.000Z",
    "title": "XRP Slides 3% as Bitcoin Pullback Overshadows Record ETF Launch",
    "url": "https://www.coindesk.com/markets/2025/09/22/xrp-slides-3-as-bitcoin-pullback-overshadows-record-etf-launch",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Shaurya Malwa",
    "published_at": "2025-09-22T04:07:48.000Z",
    "summary_long": "XRP endured a volatile 24-hour session from September 21 at 03:00 to September 22 at 02:00, swinging 3.46% between a $3.014 high and $2.910 low. The selloff coincided with the debut of the first U.S.-listed XRP ETF, which set records with $37.7 million in opening-day volume, but institutional profit-taking overwhelmed the bullish catalyst. NEWS BACKGROUND • First U.S.-listed XRP ETF launched September 21, generating $37.7 million in day-one volume — the largest ETF debut of 2025. • Federal Reserve policy easing remains in focus, with markets pricing near-certain September rate cuts that typically support digital assets. Source: www.coindesk.com. Date: 2025-09-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:nasa resurrects its viper moon rover for a 2027 mission with:2025-09-21T21:13:15.000Z",
    "title": "NASA resurrects its VIPER moon rover for a 2027 mission with Blue Origin",
    "url": "https://www.engadget.com/science/space/nasa-resurrects-its-viper-moon-rover-for-a-2027-mission-with-blue-origin-211315035.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-09-21T21:13:15.000Z",
    "summary_long": "NASA is apparently giving its ice-scouting moon rover mission another try. The space agency has announced that the Volatiles Investigating Polar Exploration Rover (VIPER) project — which was called off last year after a series of delays and mounting costs — could catch a ride to the moon with Blue Origin in 2027 under the Commercial Lunar Payload Services (CLPS) program. Blue Origin must first plan and demonstrate how the delivery at the lunar surface would work, and if it's all to NASA's liking, VIPER will be ferried by the company's Blue Moon Mark 1 lander. Blue Origin hasn't yet attempted a moon landing, but the first opportunity for its Blue Moon Mark 1 lander is expected to launch later this year as part of another CLPS delivery. Source: www.engadget.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:coinbase ceo we want to become a super app and provide all t:2025-09-21T21:00:00.000Z",
    "title": "Coinbase CEO: 'We Want to Become a Super App and Provide All Types of Financial Services'",
    "url": "https://www.coindesk.com/markets/2025/09/20/coinbase-ceo-we-want-to-become-a-super-app-and-provide-all-types-of-financial-services",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-09-21T21:00:00.000Z",
    "summary_long": "Brian Armstrong, a co-founder and the CEO of Coinbase (COIN), said in an interview on Friday that Coinbase’s long-term goal is to be a financial “super app,” offering crypto alongside a broad range of financial services beyond traditional banking. Armstrong, speaking on Fox Business’ \"The Claman Countdown,\" told Liz Claman that momentum in Congress is the strongest he has seen, with lawmakers from both parties advancing frameworks for the industry. A move that boosts Coinbase's momentum towards building the super app. He explained how his company wants to approach the buildout during the interview. Source: www.coindesk.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:some iphone 17 models are reportedly prone to very visible s:2025-09-21T19:11:47.000Z",
    "title": "Some iPhone 17 models are reportedly prone to very visible scratches",
    "url": "https://www.engadget.com/mobile/smartphones/some-iphone-17-models-are-reportedly-prone-to-very-visible-scratches-191147266.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-09-21T19:11:47.000Z",
    "summary_long": "Early shoppers are taking to the web to warn about the potentially scratch-prone nature of specific iPhone 17 model and color combos. According to a Bloomberg report, those demoing the latest iPhone in-store noticed that the iPhone 17 Pro in Deep Blue and the iPhone Air in Space Black models already had very noticeable scratches and scuffs. The report is backed up by social media posts following the release, where users recorded display models with residual marks from being used with a MagSafe charger and showed off photos of the back camera housing with chipped edges. In a video by JerryRigEverything, the YouTuber puts the iPhone 17 models to the test with razor blades, coins and keys. Source: www.engadget.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bitcoin bulls challenged by dollars doji xrp macd bearish ah:2025-09-22T04:04:37.000Z",
    "title": "Bitcoin Bulls Challenged by Dollar's Doji, XRP MACD Bearish Ahead of Fed Speak & PCE Inflation",
    "url": "https://www.coindesk.com/markets/2025/09/22/bitcoin-bulls-challenged-by-dollar-s-doji-xrp-macd-bearish-ahead-of-fed-speak-and-pce-inflation",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Omkar Godbole",
    "published_at": "2025-09-22T04:04:37.000Z",
    "summary_long": "This is a daily analysis by CoinDesk analyst and Chartered Market Technician Omkar Godbole. DXY VS BTC Last week, the Federal Reserve (Fed) delivered its first interest rate rate cut since December, while signaling more easing in the coming months. Yet, despite this dovish move, the dollar index (DXY), which tracks the greenback's value against major currencies, finished the week with a dragonfly doji on the weekly chart – a classic bullish reversal signal suggesting a USD rally ahead. The dragonfly doji gets its name from its distinctive “T” shape, which resembles the delicate wings of a dragonfly or the blade of a bamboo-copter toy. Source: www.coindesk.com. Date: 2025-09-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:ifixits teardown shows the iphone air doesnt sacrifice repai:2025-09-21T16:16:41.000Z",
    "title": "iFixit's teardown shows the iPhone Air doesn't sacrifice repairability for thinness",
    "url": "https://www.engadget.com/mobile/smartphones/ifixits-teardown-shows-the-iphone-air-doesnt-sacrifice-repairability-for-thinness-161641244.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-09-21T16:16:41.000Z",
    "summary_long": "Apple manages to hold onto its recent repairability record with the latest iPhone Air, which maintains a provisional 7 out of 10 in iFixit's teardown. As seen in the teardown, the iPhone Air can easily swap batteries, has a modular USB-C port and offers day-one repair guides. Even though the iPhone Air represents Apple's thinnest iPhone ever at 5.6mm, iFixit said the slim design makes repairs \"more approachable, not less.\" Apple kept the same battery design that was introduced with the iPhone 16 lineup, which switched to an electrically released battery adhesive for more consistent replacements. Similarly, you don't have to ever risk damaging the OLED display when swapping an iPhone Air battery, since there's still that dual-entry access allowing you to access it from the back glass. Source: www.engadget.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:montblanc is getting into the digital notepad game:2025-09-21T16:27:11.000Z",
    "title": "Montblanc is getting into the digital notepad game",
    "url": "https://www.theverge.com/news/782288/montblanc-is-getting-into-the-digital-notepad-game",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Terrence O’Brien",
    "published_at": "2025-09-21T16:27:11.000Z",
    "summary_long": "If you’re the kind of person who owns leather driving gloves in multiple colors to match your different Jaguars, then there hasn’t been a digital paper option that could live up to your lofty luxury standards until now. But Montblanc is finally delivering a truly bougie take on the e-ink writing tablet. The $905 Montblanc Digital Paper writing tablet combines a basic black-and-white e-ink screen with a digital pen modeled on the company’s Meisterstück. As you’d expect you can jot down notes, sketch, and even annotate books in epub or PDF format. Source: www.theverge.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:a jury will decide if amazon illegally tricked people into p:2025-09-21T16:00:00.000Z",
    "title": "A jury will decide if Amazon illegally tricked people into paying for Prime",
    "url": "https://www.theverge.com/policy/782197/amazon-prime-ftc-consumer-protection-trial",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Lauren Feiner",
    "published_at": "2025-09-21T16:00:00.000Z",
    "summary_long": "Amazon is about to face a roughly month-long trial against the US Federal Trade Commission in Seattle to defend its Prime program from claims it tricked tens of millions of customers into signing up for the membership and made it hard to quit. It's one of several Big Tech trials the US government has initiated that's taking place this year, but the first major one in recent history against Amazon. Jury selection in the case will begin on Monday, which will be followed by opening arguments in the case. The FTC has separately sued Amazon for allegedly anticompetitive practices in a case that's set to begin in early 2027. Source: www.theverge.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:trump8217s h1b visa fee isn8217t just about immigration it82:2025-09-21T14:20:00.000Z",
    "title": "Trump&#8217;s H-1B visa fee isn&#8217;t just about immigration, it&#8217;s about fealty",
    "url": "https://www.theverge.com/report/782289/trumps-h-1b-visa-fee-isnt-about-immigration-its-about-fealty",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Terrence O’Brien",
    "published_at": "2025-09-21T14:20:00.000Z",
    "summary_long": "Donald Trump has never made his distaste for immigrants a secret. It's been a cornerstone of his political movement since he descended that escalator on June 16th, 2015 and started hurling racist vitriol in the general direction of Mexico and Mexican Americans. On the surface, his assault on the H-1B visa program seems like part of the White House's ongoing campaign to reduce the number of immigrants in the country. It might have that effect, but the biggest goal for Trump may not be forcing companies to hire more Americans or cutting down on the number of workers from India moving to the US. Source: www.theverge.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:floating wind power sets sail in japans energy shift:2025-09-21T19:20:01.000Z",
    "title": "Floating wind power sets sail in Japan's energy shift",
    "url": "https://techxplore.com/news/2025-09-power-japan-energy-shift.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-21T19:20:01.000Z",
    "summary_long": "Floating wind power sets sail in Japan's energy shift Source: techxplore.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:airport cyberattack disrupts more flights across europe:2025-09-21T19:13:07.000Z",
    "title": "Airport cyberattack disrupts more flights across Europe",
    "url": "https://techxplore.com/news/2025-09-airport-cyberattack-disrupts-flights-europe.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-21T19:13:07.000Z",
    "summary_long": "Fallout from a cyberattack that disrupted check-in systems at several European airports extended into a second full day on Sunday, as passengers faced dozens of canceled and delayed flights—and the impact poised to worsen for at least one major airport. Source: techxplore.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:3dprinted fuel cells could reshape sustainable aerospace app:2025-09-21T16:50:01.000Z",
    "title": "3D-printed fuel cells could reshape sustainable aerospace applications",
    "url": "https://techxplore.com/news/2025-09-3d-fuel-cells-reshape-sustainable.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-21T16:50:01.000Z",
    "summary_long": "3D-printed fuel cells could reshape sustainable aerospace applications Source: techxplore.com. Date: 2025-09-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]