[
  {
    "id": "ai_data:openai oracle and softbank expand stargate with five new ai :2025-09-23T14:00:00.000Z",
    "title": "OpenAI, Oracle, and SoftBank expand Stargate with five new AI datacenter sites",
    "url": "https://openai.com/index/five-new-stargate-sites",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2025-09-23T14:00:00.000Z",
    "summary_long": "OpenAI, Oracle, and SoftBank expand Stargate with five new AI datacenter sites Source: openai.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:nasa targeting early february for artemis ii mission to the :2025-09-23T16:29:59.000Z",
    "title": "NASA targeting early February for Artemis II mission to the Moon",
    "url": "https://arstechnica.com/space/2025/09/nasa-targeting-early-february-for-artemis-ii-mission-to-the-moon/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-09-23T16:29:59.000Z",
    "summary_long": "NASA is pressing ahead with preparations for the first launch of humans beyond low-Earth orbit in more than five decades, and officials said Tuesday that the Artemis II mission could take flight early next year. Although work remains to be done, the space agency is now pushing toward a launch window that opens on February 5, 2026, officials said during a news conference on Tuesday at Johnson Space Center. The Artemis II mission represents a major step forward for NASA and seeks to send four astronauts—Reid Wiseman, Victor Glover, Christina Koch, and Jeremy Hansen—around the Moon and back. The 10-day mission will be the first time astronauts have left low-Earth orbit since the Apollo 17 mission in December 1972. Source: arstechnica.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:google play is getting a geminipowered ai sidekick to help y:2025-09-23T15:24:17.000Z",
    "title": "Google Play is getting a Gemini-powered AI Sidekick to help you in games",
    "url": "https://arstechnica.com/gaming/2025/09/googles-big-play-store-revamp-includes-better-gamer-profiles-gemini-live-in-game-help/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2025-09-23T15:24:17.000Z",
    "summary_long": "The era of Google's Play's unrivaled dominance may be coming to an end in the wake of the company's antitrust loss, but Google's app store isn't going anywhere. In fact, the Play Store experience is getting a massive update with more personalization, content, and yes, AI. This is Google, after all. The revamped Google Play Games is a key part of this update. Source: arstechnica.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:volvo says it has big plans for south carolina factory:2025-09-23T13:42:47.000Z",
    "title": "Volvo says it has big plans for South Carolina factory",
    "url": "https://arstechnica.com/cars/2025/09/volvo-says-it-has-big-plans-for-south-carolina-factory/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jonathan M. Gitlin\n                ",
    "published_at": "2025-09-23T13:42:47.000Z",
    "summary_long": "Volvo is undergoing something of a restructuring. The automaker wants to be fully electric by 2040, but for that to happen, it needs to remain in business until then. Earlier this year, that meant layoffs, but today, Volvo announced it has big plans for its North American factory in Ridgeville, South Carolina. Volvo has been making cars in South Carolina since 2017, starting with the S60 sedan—a decision I always found slightly curious given that US car buyers had already given up on sedans by that point in favor of crossovers and SUVs. Source: arstechnica.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:wolbanking77 wolof banking speech intent classification data:2025-09-23T17:34:10.000Z",
    "title": "WolBanking77: Wolof Banking Speech Intent Classification Dataset",
    "url": "http://arxiv.org/abs/2509.19271v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Abdou Karim Kandji",
    "published_at": "2025-09-23T17:34:10.000Z",
    "summary_long": "Intent classification models have made a lot of progress in recent years. However, previous studies primarily focus on high-resource languages datasets, which results in a gap for low-resource languages and for regions with a high rate of illiterate people where languages are more spoken than read or written. This is the case in Senegal, for example, where Wolof is spoken by around 90\\% of the population, with an illiteracy rate of 42\\% for the country. Wolof is actually spoken by more than 10 million people in West African region. Source: arxiv.org. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crypto vc firm archetype launches 100m fund to back early bl:2025-09-23T14:58:49.000Z",
    "title": "Crypto VC Firm Archetype Launches $100M Fund to Back Early Blockchain Startups",
    "url": "https://www.coindesk.com/business/2025/09/23/crypto-vc-firm-archetype-launches-usd100m-fund-to-back-early-blockchain-startups",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-23T14:58:49.000Z",
    "summary_long": "New York-based venture capital firm Archetype has raised $100 million for its third fund aimed at backing early-stage blockchain startups, the firm said. The fund, called Archetype III, is supported by a mix of existing and new institutional investors, including pensions, academic endowments, sovereign wealth funds, and funds of funds. \"Running a concentrated $100M fund lets us be extremely selective and high-conviction with each team,\" Ash Egan, founder and general partner of Archetype, told CoinDesk in an email. \"We operate with a single goal — to ensure crypto teams are positioned to win by building deep rapport with founders in a way that mega funds structurally cannot.\" Archetype has a track record of early bets that paid off. Source: www.coindesk.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:cloudburst raises 7m series a to scale offchain crypto intel:2025-09-23T12:00:00.000Z",
    "title": "Cloudburst Raises $7M Series A to Scale Off-Chain Crypto Intelligence Platform",
    "url": "https://www.coindesk.com/business/2025/09/23/cloudburst-raises-usd7m-series-a-to-scale-off-chain-crypto-intelligence-platform",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-09-23T12:00:00.000Z",
    "summary_long": "Cloudburst Technologies said it closed a $7 million Series A funding round to develop its platform for off-chain crypto intelligence. Unlike most blockchain analytics firms that concentrate on on-chain activity, New York-based Cloudburst specializes in analyzing data sources such as chatrooms and regulatory filings to monitor fraud networks, illicit actors, scams and social sentiment. The round, which brings total funding since its 2022 founding to $11 million, was led by Borderless Capital. Additional backing came from Strategic Cyber Ventures, CoinFund, Coinbase Ventures, Bloccelerate VC and In-Q-Tel, according to a Tuesday announcement. Source: www.coindesk.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:fnality raises 136m to expand blockchain payment systems for:2025-09-23T10:30:56.000Z",
    "title": "Fnality Raises $136M to Expand Blockchain Payment Systems for Banks",
    "url": "https://www.coindesk.com/business/2025/09/23/fnality-raises-usd136m-to-expand-blockchain-payment-systems-for-banks",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Ian Allison",
    "published_at": "2025-09-23T10:30:56.000Z",
    "summary_long": "Fnality, a fintech firm building tokenized versions of major currencies collateralized by cash held at central banks, has raised $136 million in a Series C round to expand its blockchain-based wholesale payment systems, the London-based firm said Tuesday. The investment was led by WisdomTree, Bank of America, Citi, KBC Group, Temasek and Tradeweb, with existing backers including Goldman Sachs, UBS and Barclays also participating. Fnality raised $95 million in 2023, a round led by Goldman and BNP Paribas. The firm's settlement infrastructure runs on distributed ledger technology and allows sterling payments to be processed on-chain with central bank money. Source: www.coindesk.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apple tv indefinitely delays its domestic extremism thriller:2025-09-23T22:30:44.000Z",
    "title": "Apple TV+ indefinitely delays its domestic extremism thriller 'The Savant'",
    "url": "https://www.engadget.com/entertainment/streaming/apple-tv-indefinitely-delays-its-domestic-extremism-thriller-the-savant-223044979.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-09-23T22:30:44.000Z",
    "summary_long": "Apple has delayed the release of its new series The Savant just three days before it was supposed to premiere on September 26, Deadline reports. The series follows an investigator, played by Jessica Chastain, who infiltrates a domestic extremist group in the US. Apple hasn't provided a new release date for the show. \"After careful consideration, we have made the decision to postpone The Savant,\" the company shared in a statement to Deadline. Source: www.engadget.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:riots 2xko fighting game hits early access on october 7:2025-09-23T16:56:51.000Z",
    "title": "Riot's 2XKO fighting game hits early access on October 7",
    "url": "https://www.engadget.com/gaming/riots-2xko-fighting-game-hits-early-access-on-october-7-165651941.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2025-09-23T16:56:51.000Z",
    "summary_long": "Riot's long-awaited fighting game 2XKO, previously called Project L, will be released for PC as an early access title on October 7. That's just two weeks away. The company dropped a development update video that's filled with nods to the source material. 2XKO is set in the League of Legends universe and features many characters from across the franchise. Source: www.engadget.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta to launch national super pac against ai regulation:2025-09-23T15:45:37.000Z",
    "title": "Meta to launch national super PAC against AI regulation",
    "url": "https://www.engadget.com/big-tech/meta-to-launch-national-super-pac-against-ai-regulation-154537574.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2025-09-23T15:45:37.000Z",
    "summary_long": "Meta is launching a national super political action committee (PAC), according to a report by Axios. This super PAC will be committed to fighting \"onerous\" AI regulation across the country. It's called the American Technology Excellence Project and Meta spokesperson Rachel Holland said the company is investing \"tens of millions\" into the effort. The goal of the PAC is to elect pro AI state candidates from both parties. Source: www.engadget.com. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:circuit complexity from physical constraints scaling limitat:2025-09-23T15:40:36.000Z",
    "title": "Circuit Complexity From Physical Constraints: Scaling Limitations of Attention",
    "url": "http://arxiv.org/abs/2509.19161v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Benjamin Prada",
    "published_at": "2025-09-23T15:40:36.000Z",
    "summary_long": "We argue that the standard circuit complexity measures derived from $NC, AC, TC$ provide limited practical information and are now insufficient to further differentiate model expressivity. To address these new limitations, we define a novel notion of local uniformity and a family of circuit complexity classes $RC(\\cdot)$ that capture the fundamental constraints of scaling physical circuits. Through the lens of $RC(\\cdot)$, we show that attention mechanisms with $\\omega(n^{3/2})$ runtime cannot scale to accommodate the entropy of increasingly complex datasets. Our results simultaneously provide a methodology for defining meaningful bounds on transformer expressivity and naturally expose the restricted viability of attention. Source: arxiv.org. Date: 2025-09-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]