[
  {
    "id": "bigtech:when amazon badly needed a ride europes ariane 6 rocket deli:2026-02-13T00:34:29.000Z",
    "title": "When Amazon badly needed a ride, Europe's Ariane 6 rocket delivered",
    "url": "https://arstechnica.com/space/2026/02/when-amazon-badly-needed-a-ride-europes-ariane-6-rocket-delivered/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2026-02-13T00:34:29.000Z",
    "summary_long": "The heavy version of Europe's Ariane 6 rocket launched for the first time Thursday, hauling 32 spacecraft to low-Earth orbit for Amazon's satellite broadband constellation. The Ariane 6 rocket lifted off from the Guiana Space Center on the northeastern coast of South America at 11:45 am EST (16:45 UTC), quickly soaring into a clear sky at the tropical spaceport on the power of a hydrogen-fueled main engine and four strap-on solid rocket boosters. This Ariane 6 configuration, called Ariane 64, is the first to use the rocket's full complement of four boosters. Collectively, the rocket generated more than 3.4 million pounds of thrust (15,400 kilonewtons) of thrust as it steered northeast over the Atlantic Ocean. Source: arstechnica.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:openai sidesteps nvidia with unusually fast coding model on :2026-02-12T22:56:02.000Z",
    "title": "OpenAI sidesteps Nvidia with unusually fast coding model on plate-sized chips",
    "url": "https://arstechnica.com/ai/2026/02/openai-sidesteps-nvidia-with-unusually-fast-coding-model-on-plate-sized-chips/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2026-02-12T22:56:02.000Z",
    "summary_long": "On Thursday, OpenAI released its first production AI model to run on non-Nvidia hardware, deploying the new GPT-5.3-Codex-Spark coding model on chips from Cerebras. The model delivers code at more than 1,000 tokens (chunks of data) per second, which is reported to be roughly 15 times faster than its predecessor. To compare, Anthropic's Claude Opus 4.6 in its new premium-priced fast mode reaches about 2.5 times its standard speed of 68.2 tokens per second, although it is a larger and more capable model than Spark. \"Cerebras has been a great engineering partner, and we're excited about adding fast inference as a new platform capability,\" Sachin Katti, head of compute at OpenAI, said in a statement. Source: arstechnica.com. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:epa kills foundation of greenhouse gas regulations:2026-02-12T21:04:22.000Z",
    "title": "EPA kills foundation of greenhouse gas regulations",
    "url": "https://arstechnica.com/tech-policy/2026/02/as-expected-trumps-epa-guts-climate-endangerment-finding/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    John Timmer\n                ",
    "published_at": "2026-02-12T21:04:22.000Z",
    "summary_long": "In a widely expected move, the Environmental Protection Agency has announced that it is revoking an analysis of greenhouse gases that laid the foundation for regulating their emissions by cars, power plants, and industrial sources. The analysis, called an endangerment finding, was initially ordered by the US Supreme Court in 2007 and completed during the Obama administration; it has, in theory, served as the basis of all government regulations of carbon dioxide emissions since. In practice, lawsuits and policy changes between Democratic and Republican administrations have meant it has had little impact. In fact, the first Trump administration left the endangerment finding in place, deciding it was easier to respond to it with weak regulations than it was to challenge its scientific foundations, given the strength of the evidence for human-driven climate change. Source: arstechnica.com. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:ring calls off partnership with police surveillance provider:2026-02-13T03:17:17.000Z",
    "title": "Ring calls off partnership with police surveillance provider Flock Safety",
    "url": "https://www.engadget.com/home/ring-calls-off-partnership-with-police-surveillance-provider-flock-safety-031717605.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2026-02-13T03:17:17.000Z",
    "summary_long": "Ring has canceled its partnership with Flock Safety, after receiving backlash for running a Super Bowl ad touting its Search Party feature. If you’ll recall, Ring revealed back in October 2025 that it was entering a partnership with the surveillance company, which would make it possible for law enforcement to ask smart doorbell owners for videos captured by their devices. In its announcement, the company said that the “planned Flock Safety integration would require significantly more time and resources than anticipated.” The decision to call off the partnership was mutual, Ring added, and Flock Safety’s integration was never launched. Apparently, no Ring customer footage was ever sent to Flock. Source: www.engadget.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:mina the hollower resurfaces with a spring 2026 release wind:2026-02-12T22:43:27.000Z",
    "title": "Mina the Hollower resurfaces with a spring 2026 release window",
    "url": "https://www.engadget.com/gaming/playstation/mina-the-hollower-resurfaces-with-a-spring-2026-release-window-224327165.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2026-02-12T22:43:27.000Z",
    "summary_long": "Sony’s first State of Play stream of the year included an update on Mina the Hollower, the latest title from Shovel Knight studio Yacht Club Games. It’s now slated to arrive sometime this spring. The developer initially planned to release the retro-style action-adventure platformer on Halloween last year, but delayed it to “to apply some final polish and balancing to make the game truly shine.” While Mina the Hollower didn’t make its original Halloween release date, at least the new demo, which will be available for a limited time, is getting a eerily timed debut. It’ll hit PS5 tomorrow i.e. Source: www.engadget.com. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa selects vast for sixth private mission to space station:2026-02-12T21:11:19.000Z",
    "title": "NASA Selects Vast for Sixth Private Mission to Space Station",
    "url": "https://www.nasa.gov/news-release/nasa-selects-vast-for-sixth-private-mission-to-space-station/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Tiernan P. Doyle",
    "published_at": "2026-02-12T21:11:19.000Z",
    "summary_long": "Credit: NASA NASA and Vast have signed an order for the sixth private astronaut mission to the International Space Station, targeted to launch no earlier than summer 2027 from Florida. This private astronaut mission marks the company’s first selection to the orbiting laboratory, underscoring NASA’s ongoing investment in fostering a commercial space economy and expanding opportunities for private industry in low Earth orbit. “Private astronaut missions represent more than access to the International Space Station — they create opportunities for new ideas, companies, and capabilities that further enhance American leadership in low Earth orbit and open doors for what’s next,” said NASA Administrator Jared Isaacman. “We’re proud to welcome Vast to this growing community of commercial partners. Source: www.nasa.gov. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:bandit learning in matching markets with interviews:2026-02-12T18:03:37.000Z",
    "title": "Bandit Learning in Matching Markets with Interviews",
    "url": "https://arxiv.org/abs/2602.12224v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Amirmahdi Mirfakhar",
    "published_at": "2026-02-12T18:03:37.000Z",
    "summary_long": "Two-sided matching markets rely on preferences from both sides, yet it is often impractical to evaluate preferences. Participants, therefore, conduct a limited number of interviews, which provide early, noisy impressions and shape final decisions. We study bandit learning in matching markets with interviews, modeling interviews as \\textit{low-cost hints} that reveal partial preference information to both sides. Our framework departs from existing work by allowing firm-side uncertainty: firms, like agents, may be unsure of their own preferences and can make early hiring mistakes by hiring less preferred agents. Source: arxiv.org. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:introducing gpt53codexspark:2026-02-12T10:00:00.000Z",
    "title": "Introducing GPT-5.3-Codex-Spark",
    "url": "https://openai.com/index/introducing-gpt-5-3-codex-spark",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-02-12T10:00:00.000Z",
    "summary_long": "Introducing GPT-5.3-Codex-Spark Source: openai.com. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:highguard studio lays off most of its team just weeks after :2026-02-12T16:59:19.000Z",
    "title": "Highguard studio lays off 'most' of its team just weeks after the game went live",
    "url": "https://www.engadget.com/gaming/highguard-studio-lays-off-most-of-its-team-just-weeks-after-the-game-went-live-165919815.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2026-02-12T16:59:19.000Z",
    "summary_long": "Wildlight Entertainment, the studio behind Highguard, has laid off many staffers. Level designer Alex Graner wrote in a LinkedIn post that the layoffs impacted \"most of the team.\" The company says it's keeping a \"core group of developers to continue innovating on and supporting the game.\" That sounds like a skeleton crew. > Today we made an incredibly difficult decision to part ways with a number of our team members while keeping a core group of developers to continue innovating on and supporting the game. > > We're proud of the team, talent, and the product we've created together. Source: www.engadget.com. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:safeneuron neuronlevel safety alignment for large language m:2026-02-12T16:40:05.000Z",
    "title": "SafeNeuron: Neuron-Level Safety Alignment for Large Language Models",
    "url": "https://arxiv.org/abs/2602.12158v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Zhaoxin Wang",
    "published_at": "2026-02-12T16:40:05.000Z",
    "summary_long": "Large language models (LLMs) and multimodal LLMs are typically safety-aligned before release to prevent harmful content generation. However, recent studies show that safety behaviors are concentrated in a small subset of parameters, making alignment brittle and easily bypassed through neuron-level attacks. Moreover, most existing alignment methods operate at the behavioral level, offering limited control over the model's internal safety mechanisms. In this work, we propose SafeNeuron, a neuron-level safety alignment framework that improves robustness by redistributing safety representations across the network. Source: arxiv.org. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:shimmering light in egg nebula:2026-02-12T16:07:23.000Z",
    "title": "Shimmering Light in Egg Nebula",
    "url": "https://www.nasa.gov/image-article/shimmering-light-in-egg-nebula/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-02-12T16:07:23.000Z",
    "summary_long": "NASA’s Hubble Space Telescope reveals the clearest view yet of the Egg Nebula. This structure of gas and dust was created by a dying, Sun-like star. These newest observations were taken with Hubble’s Wide Field Camera 3. NASA, ESA, Bruce Balick (UWashington) This image from NASA’s Hubble Space Telescope released on Feb. Source: www.nasa.gov. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:gate ceo and founder lin han says banks have lost the war ag:2026-02-12T14:35:33.000Z",
    "title": "Gate CEO and founder Lin Han says banks have lost the war against stablecoins",
    "url": "https://www.coindesk.com/business/2026/02/12/gate-ceo-and-founder-lin-han-says-banks-have-lost-the-war-against-stablecoins",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2026-02-12T14:35:33.000Z",
    "summary_long": "Gate CEO and founder Lin Han says banks have lost the war against stablecoins Source: www.coindesk.com. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]