[
  {
    "id": "bigtech:nvidia ai chip challenger groq raises even more than expecte:2025-09-17T23:51:42.000Z",
    "title": "Nvidia AI chip challenger Groq raises even more than expected, hits $6.9B valuation",
    "url": "https://techcrunch.com/2025/09/17/nvidia-ai-chip-challenger-groq-raises-even-more-than-expected-hits-6-9b-valuation/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Julie Bort",
    "published_at": "2025-09-17T23:51:42.000Z",
    "summary_long": "Nvidia AI chip challenger Groq raises even more than expected, hits $6.9B valuation Source: techcrunch.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:meta launches hyperscape technology to turn realworld spaces:2025-09-18T00:43:31.000Z",
    "title": "Meta launches Hyperscape, technology to turn real-world spaces into VR",
    "url": "https://techcrunch.com/2025/09/17/meta-launches-hyperscape-technology-to-turn-real-world-spaces-into-vr/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Sarah Perez",
    "published_at": "2025-09-18T00:43:31.000Z",
    "summary_long": "Meta launches Hyperscape, technology to turn real-world spaces into VR Source: techcrunch.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:metas new rayban smart glasses have twice the battery life:2025-09-18T00:07:37.000Z",
    "title": "Meta’s new Ray-Ban smart glasses have twice the battery life",
    "url": "https://www.theverge.com/news/780012/meta-ray-ban-gen-2-smart-glasses-connect-2025",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Jay Peters",
    "published_at": "2025-09-18T00:07:37.000Z",
    "summary_long": "Meta has announced a new generation of its Ray-Ban smart glasses, featuring significantly improved battery life and the ability to record 3K video, which brings them up to par with the Oakley HSTN smart glasses. The new glasses, technically called the Ray-Ban Meta Gen 2, are available to order today and start at $379. Let’s dig in on battery, which is better on a few fronts. You can use the new Ray-Bans for up to eight hours on a single charge, which is twice the four-hour battery life of the previous generation. Source: www.theverge.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:mavryk network raises 10m for uae realestate tokenization pl:2025-09-17T14:26:00.000Z",
    "title": "Mavryk Network Raises $10M for UAE Real-Estate Tokenization Plans",
    "url": "https://www.coindesk.com/business/2025/09/17/mavryk-network-raises-usd10m-for-uae-real-estate-tokenization-plans",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jamie Crawley",
    "published_at": "2025-09-17T14:26:00.000Z",
    "summary_long": "Layer-1 network Mavryk said it raised $10 million in a strategic investment led by financial derivatives provider MultiBank Group to expand its real-world asset (RWA) tokenization plans. Mavryk Network and MultiBank have an existing partnership to tokenize over $10 billion worth of real estate in the United Arab Emirates through the latter's RWA platform. The two companies aim to broaden access to premium investments, such as real estate, according to an emailed announcement on Wednesday. The initiative is also supported by major digital asset custody provider Fireblocks, which provides the multiparty computation wallets that safeguard the tokenized assets on Mavryk's network. Source: www.coindesk.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:forward industries launches 4b atm offering to expand solana:2025-09-17T14:23:23.000Z",
    "title": "Forward Industries Launches $4B ATM Offering to Expand Solana Treasury",
    "url": "https://www.coindesk.com/business/2025/09/17/forward-industries-launches-usd4b-atm-offering-to-expand-solana-treasury",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-17T14:23:23.000Z",
    "summary_long": "Forward Industries (FORD), a publicly-traded design and manufacturing firm that’s building out a solana (SOL) treasury, has filed a $4 billion at-the-market (ATM) equity offering program with the SEC. The company will use any funds raised for working capital, business expansion and to bolster its SOL holdings, according to an announcement on Wednesday. The offering gives Forward a flexible way to sell new shares incrementally through Cantor Fitzgerald, the program’s designated agent. This step comes just weeks after Forward completed what it says was the largest Solana-focused treasury raise to date. Source: www.coindesk.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:apertus democratizing open and compliant llms for global lan:2025-09-17T17:59:21.000Z",
    "title": "Apertus: Democratizing Open and Compliant LLMs for Global Language Environments",
    "url": "http://arxiv.org/abs/2509.14233v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Alejandro Hernández-Cano",
    "published_at": "2025-09-17T17:59:21.000Z",
    "summary_long": "We present Apertus, a fully open suite of large language models (LLMs) designed to address two systemic shortcomings in today's open model ecosystem: data compliance and multilingual representation. Unlike many prior models that release weights without reproducible data pipelines or regard for content-owner rights, Apertus models are pretrained exclusively on openly available data, retroactively respecting robots.txt exclusions and filtering for non-permissive, toxic, and personally identifiable content. To mitigate risks of memorization, we adopt the Goldfish objective during pretraining, strongly suppressing verbatim recall of data while retaining downstream task performance. The Apertus models also expand multilingual coverage, training on 15T tokens from over 1800 languages, with ~40% of pretraining data allocated to non-English content. Source: arxiv.org. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta unveils its secondgen rayban smart glasses at connect:2025-09-18T00:14:56.000Z",
    "title": "Meta unveils its second-gen Ray-Ban smart glasses at Connect",
    "url": "https://www.engadget.com/wearables/meta-unveils-its-second-gen-ray-ban-smart-glasses-at-connect-000834325.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-09-18T00:14:56.000Z",
    "summary_long": "As expected, Meta has introduced new smart glasses during its Connect conference today. The announcements included a “Gen 2” of the Ray-Ban Meta glasses, which retail starting at $379. There are a bunch of upgrades over the $299 Ray-Ban Meta set that the duo released in 2023. Meta highlighted improvements to battery life, which it says now lasts up to eight hours with \"typical use.\" The included charging case now provides an additional 48 hours of juice, versus 32 hours for the current one. Source: www.engadget.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:improving cosmological reach of a gravitational wave observa:2025-09-17T14:22:43.000Z",
    "title": "Improving cosmological reach of a gravitational wave observatory using Deep Loop Shaping",
    "url": "http://arxiv.org/abs/2509.14016v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Jonas Buchli",
    "published_at": "2025-09-17T14:22:43.000Z",
    "summary_long": "Improved low-frequency sensitivity of gravitational wave observatories would unlock study of intermediate-mass black hole mergers, binary black hole eccentricity, and provide early warnings for multi-messenger observations of binary neutron star mergers. Today's mirror stabilization control injects harmful noise, constituting a major obstacle to sensitivity improvements. We eliminated this noise through Deep Loop Shaping, a reinforcement learning method using frequency domain rewards. We proved our methodology on the LIGO Livingston Observatory (LLO). Source: arxiv.org. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa artemis ii moon rocket ready to fly crew:2025-09-17T20:37:00.000Z",
    "title": "NASA Artemis II Moon Rocket Ready to Fly Crew",
    "url": "https://www.nasa.gov/directorates/esdmd/common-exploration-systems-development-division/space-launch-system/nasa-artemis-ii-moon-rocket-ready-to-fly-crew/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lee Mohon",
    "published_at": "2025-09-17T20:37:00.000Z",
    "summary_long": "NASA’s Artemis II SLS (Space Launch System) rocket poised to send four astronauts from Earth on a journey around the Moon next year may appear identical to the Artemis I SLS rocket. On closer inspection, though, engineers have upgraded the agency’s Moon rocket inside and out to improve performance, reliability, and safety. SLS flew a picture perfect first mission on the Artemis I test flight, meeting or exceeding parameters for performance, attitude control, and structural stability to an accuracy of tenths or hundredths of a percent as it sent an uncrewed Orion thousands of miles beyond the Moon. It also returned volumes of invaluable flight data for SLS engineers to analyze to drive improvements. Source: www.nasa.gov. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:lamigauss pitching radiative gaussian for sparseview xray la:2025-09-17T09:53:47.000Z",
    "title": "LamiGauss: Pitching Radiative Gaussian for Sparse-View X-ray Laminography Reconstruction",
    "url": "http://arxiv.org/abs/2509.13863v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Chu Chen",
    "published_at": "2025-09-17T09:53:47.000Z",
    "summary_long": "X-ray Computed Laminography (CL) is essential for non-destructive inspection of plate-like structures in applications such as microchips and composite battery materials, where traditional computed tomography (CT) struggles due to geometric constraints. However, reconstructing high-quality volumes from laminographic projections remains challenging, particularly under highly sparse-view acquisition conditions. In this paper, we propose a reconstruction algorithm, namely LamiGauss, that combines Gaussian Splatting radiative rasterization with a dedicated detector-to-world transformation model incorporating the laminographic tilt angle. LamiGauss leverages an initialization strategy that explicitly filters out common laminographic artifacts from the preliminary reconstruction, preventing redundant Gaussians from being allocated to false structures and thereby concentrating model capacity on representing the genuine object. Source: arxiv.org. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:house committee asks discord valve twitch and reddit to test:2025-09-17T18:41:00.000Z",
    "title": "House committee asks Discord, Valve, Twitch and Reddit to testify on online radicalization",
    "url": "https://www.engadget.com/social-media/house-committee-asks-discord-valve-twitch-and-reddit-to-testify-on-online-radicalization-184100470.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-09-17T18:41:00.000Z",
    "summary_long": "House Oversight and Government Reform Committee Chairman James Comer (R-KY) has asked the CEOs of Discord, Twitch, Valve and Reddit to testify at a hearing on online radicalization. The hearing will be held on October 8, 2025, and is in direct response to the assassination of political activist Charlie Kirk, an event some have tried to connect to the online communities the alleged shooter, Tyler Robinson, participated in. \"Congress has a duty to oversee the online platforms that radicals have used to advance political violence,\" Comer shared in the press release announcing the hearing. \"To prevent future radicalization and violence, the CEOs of Discord, Steam, Twitch, and Reddit must appear before the Oversight Committee and explain what actions they will take to ensure their platforms are not exploited for nefarious purposes.\" Following Kirk's death, law enforcement, regulators and the press have exerted significant effort to both understand Robinson's actions and structure them into a coherent narrative. Source: www.engadget.com. Date: 2025-09-17.",
    "tags": []
  },
  {
    "id": "fintech:fed cuts rate in risk management move as bitcoin eyes possib:2025-09-17T18:05:37.000Z",
    "title": "Fed Cuts Rate in 'Risk Management' Move as Bitcoin Eyes Possible Upside",
    "url": "https://www.coindesk.com/markets/2025/09/16/fed-cuts-fed-fund-rate-by-25-basis-points-in-first-reduction-since-december",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2025-09-17T18:05:37.000Z",
    "summary_long": "The Federal Reserve has returned to easing mode after ten months of taking a wait and see approach on the U.S. economy. In a widely expected move on Wednesday, the U.S. central bank cut its benchmark fed funds interest rate range by 25 basis points to 4%-4.25%, the lowest since December 2022, in what Fed chair Jerome Powell called a \"risk management cut.\" The Fed acknowledged that economic growth in the first half of the year \"moderated\" and the job market has \"slowed.\" This slowdown, Powell said during a press conference, is mostly due to changes in immigration. Source: www.coindesk.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]