[
  {
    "id": "bigtech:china just carried out its second reusable launch attempt in:2025-12-23T21:22:38.000Z",
    "title": "China just carried out its second reusable launch attempt in three weeks",
    "url": "https://arstechnica.com/space/2025/12/china-just-carried-out-its-second-reusable-launch-attempt-in-three-weeks/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-12-23T21:22:38.000Z",
    "summary_long": "For the second time this month, a Chinese rocket designed for reuse successfully soared into low-Earth orbit on its first flight Monday, defying the questionable odds that burden the debuts of new launch vehicles. The first Long March 12A rocket, roughly the same height and diameter of SpaceX's workhorse Falcon 9, lifted off from the Jiuquan Satellite Launch Center at 9:00 pm EST Monday (02:00 UTC Tuesday). Less than 10 minutes later, rocket's methane-fueled first stage booster hurtled through the atmosphere at supersonic speed, impacting in a remote region about 200 miles downrange from the Jiuquan spaceport in northwestern China. The booster failed to complete a braking burn to slow down for landing at a prepared location near the edge of the Gobi Desert. Source: arstechnica.com. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:marissa mayers new startup dazzle raises 8m led by forerunne:2025-12-23T16:48:45.000Z",
    "title": "Marissa Mayer’s new startup Dazzle raises $8M led by Forerunner’s Kirsten Green",
    "url": "https://techcrunch.com/2025/12/23/marissa-mayers-new-startup-dazzle-raises-8m-led-by-forerunners-kirsten-green/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Marina Temkin",
    "published_at": "2025-12-23T16:48:45.000Z",
    "summary_long": "Marissa Mayer’s new startup Dazzle raises $8M led by Forerunner’s Kirsten Green Source: techcrunch.com. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:trump administration bars former eu official and antidisinfo:2025-12-24T00:11:40.000Z",
    "title": "Trump administration bars former EU official and anti-disinformation and hate researchers from US",
    "url": "https://www.theverge.com/news/850067/us-sanctions-thierry-breton-content-moderation-censorship",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Richard Lawler",
    "published_at": "2025-12-24T00:11:40.000Z",
    "summary_long": "On Tuesday, the Trump Administration followed through on a threat of retaliation targeting foreigners who are involved in content moderation. The State Department announced sanctions barring US access for former EU commissioner Thierry Breton, as well as four researchers, while issuing an intentionally chilling threat to others, with Secretary of State Marco Rubio claiming, \"The State Department stands ready and willing to expand today's list if other foreign actors do not reverse course.\" One of the researchers the State Department says is banned and now deportable, is Imran Ahmed, who runs the Center for Countering Digital Hate (CCDH), an … Read the full story at The Verge. Source: www.theverge.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:strengthening supply chain security preparing for the next m:2025-12-23T23:52:08.000Z",
    "title": "Strengthening supply chain security: Preparing for the next malware campaign",
    "url": "https://github.blog/security/supply-chain-security/strengthening-supply-chain-security-preparing-for-the-next-malware-campaign/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Madison Oliver",
    "published_at": "2025-12-23T23:52:08.000Z",
    "summary_long": "The open source ecosystem continues to face organized, adaptive supply chain threats that spread through compromised credentials and malicious package lifecycle scripts. The most recent example is the multi-wave Shai-Hulud campaign. While individual incidents differ in their mechanics and speed, the pattern is consistent: Adversaries learn quickly, target maintainer workflows, and exploit trust boundaries in publication pipelines. This post distills durable lessons and actions to help maintainers and organizations harden their systems and prepare for the next campaign, not just respond to the last one. Source: github.blog. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:avoiding the price of adaptivity inference in linear context:2025-12-23T13:53:53.000Z",
    "title": "Avoiding the Price of Adaptivity: Inference in Linear Contextual Bandits via Stability",
    "url": "https://arxiv.org/abs/2512.20368v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Samya Praharaj",
    "published_at": "2025-12-23T13:53:53.000Z",
    "summary_long": "Statistical inference in contextual bandits is complicated by the adaptive, non-i.i.d. nature of the data. A growing body of work has shown that classical least-squares inference may fail under adaptive sampling, and that constructing valid confidence intervals for linear functionals of the model parameter typically requires paying an unavoidable inflation of order $\\sqrt{d \\log T}$. This phenomenon -- often referred to as the price of adaptivity -- highlights the inherent difficulty of reliable inference under general contextual bandit policies. Source: arxiv.org. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:tensions over el salvadors bitcoin holdings ease as imf prai:2025-12-23T18:40:00.000Z",
    "title": "Tensions over El Salvador's bitcoin holdings ease as IMF praises economic progress",
    "url": "https://www.coindesk.com/business/2025/12/23/tensions-over-el-salvador-s-bitcoin-holdings-ease-as-imf-praises-economic-progress",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2025-12-23T18:40:00.000Z",
    "summary_long": "Tensions over El Salvador's bitcoin holdings ease as IMF praises economic progress Source: www.coindesk.com. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:offline safe policy optimization from heterogeneous feedback:2025-12-23T09:07:53.000Z",
    "title": "Offline Safe Policy Optimization From Heterogeneous Feedback",
    "url": "https://arxiv.org/abs/2512.20173v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Ze Gong",
    "published_at": "2025-12-23T09:07:53.000Z",
    "summary_long": "Offline Preference-based Reinforcement Learning (PbRL) learns rewards and policies aligned with human preferences without the need for extensive reward engineering and direct interaction with human annotators. However, ensuring safety remains a critical challenge across many domains and tasks. Previous works on safe RL from human feedback (RLHF) first learn reward and cost models from offline data, then use constrained RL to optimize a safe policy. While such an approach works in the contextual bandits settings (LLMs), in long horizon continuous control tasks, errors in rewards and costs accumulate, leading to impairment in performance when used with constrained RL methods. Source: arxiv.org. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:odysseus jailbreaking commercial multimodal llmintegrated sy:2025-12-23T08:53:36.000Z",
    "title": "Odysseus: Jailbreaking Commercial Multimodal LLM-integrated Systems via Dual Steganography",
    "url": "https://arxiv.org/abs/2512.20168v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Songze Li",
    "published_at": "2025-12-23T08:53:36.000Z",
    "summary_long": "By integrating language understanding with perceptual modalities such as images, multimodal large language models (MLLMs) constitute a critical substrate for modern AI systems, particularly intelligent agents operating in open and interactive environments. However, their increasing accessibility also raises heightened risks of misuse, such as generating harmful or unsafe content. To mitigate these risks, alignment techniques are commonly applied to align model behavior with human values. Despite these efforts, recent studies have shown that jailbreak attacks can circumvent alignment and elicit unsafe outputs. Source: arxiv.org. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:xbox cloud gaming comes to newer amazon fire tv models:2025-12-23T16:35:17.000Z",
    "title": "Xbox cloud gaming comes to newer Amazon Fire TV models",
    "url": "https://www.engadget.com/gaming/xbox/xbox-cloud-gaming-comes-to-newer-amazon-fire-tv-models-163517432.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2025-12-23T16:35:17.000Z",
    "summary_long": "Xbox has brought cloud gaming gaming to some Amazon Fire TV models. These include the Fire TV 4-Series and the Fire TV Omni QLED Series. This lets people play Xbox games directly on the television, without needing a bulky console or even something like a Fire TV stick. Gamers do need a couple of things. Source: www.engadget.com. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:artemis ii crew launch day rehearsal:2025-12-23T16:18:41.000Z",
    "title": "Artemis II Crew Launch Day Rehearsal",
    "url": "https://www.nasa.gov/image-article/artemis-ii-crew-launch-day-rehearsal/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2025-12-23T16:18:41.000Z",
    "summary_long": "NASA/Aubrey Gemignani From left to right, CSA (Canadian Space Agency) astronaut Jeremy Hansen and NASA astronauts Christina Koch, Victor Glover, and Reid Wiseman stand outside before boarding their Orion spacecraft inside the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida as part of the Artemis II countdown demonstration test, Saturday, Dec. 20, 2025. Because the SLS (Space Launch System) rocket upon which they will launch is not yet at the launch pad, the crew boarded Orion inside NASA Kennedy’s Vehicle Assembly Building, where engineers are conducting final preparations on the spacecraft, rocket, and ground systems. During the rehearsal, teams went through all the steps that will be taken on launch day, winding the clock down to just a few seconds before liftoff. Source: www.nasa.gov. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:artemis ii flight crew teams conduct demonstration ahead of :2025-12-23T16:00:31.000Z",
    "title": "Artemis II Flight Crew, Teams Conduct Demonstration Ahead of Launch",
    "url": "https://www.nasa.gov/missions/artemis/artemis-2/artemis-ii-flight-crew-teams-conduct-demonstration-ahead-of-launch/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jason Costa",
    "published_at": "2025-12-23T16:00:31.000Z",
    "summary_long": "4 Min Read ARTEMIS II FLIGHT CREW, TEAMS CONDUCT DEMONSTRATION AHEAD OF LAUNCH NASA’s launch and mission teams, along with the Artemis II crew, completed a key test Dec. 20, a countdown demonstration test, ahead of the Artemis II flight around the Moon early next year. The astronauts, supported by launch and flight control teams, dressed in their launch and entry suits, boarded their spacecraft on top of its towering rocket at the agency’s Kennedy Space Center in Florida to validate their launch date timeline. Winding the clock down to a point just before liftoff, the rehearsal enabled NASA teams to practice the exact steps teams will take as they move toward launch of the test flight. Source: www.nasa.gov. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:russias central bank unveils new crypto rules to be adopted :2025-12-23T17:21:32.000Z",
    "title": "Russia’s central bank unveils new crypto rules to be adopted in 2026",
    "url": "https://www.coindesk.com/policy/2025/12/23/russia-s-central-bank-unveils-new-crypto-rules-to-be-adopted-in-2026",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2025-12-23T17:21:32.000Z",
    "summary_long": "Russia’s central bank unveils new crypto rules to be adopted in 2026 Source: www.coindesk.com. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]