[
  {
    "id": "bigtech:hackers can steal 2fa codes and private messages from androi:2025-10-13T21:36:35.000Z",
    "title": "Hackers can steal 2FA codes and private messages from Android phones",
    "url": "https://arstechnica.com/security/2025/10/no-fix-yet-for-attack-that-lets-hackers-pluck-2fa-codes-from-android-phones/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-10-13T21:36:35.000Z",
    "summary_long": "Android devices are vulnerable to a new attack that can covertly steal 2FA codes, location timelines, and other private data in less than 30 seconds. The new attack, named Pixnapping by the team of academic researchers who devised it, requires a victim to first install a malicious app on an Android phone or tablet. The app, which requires no system permissions, can then effectively read data that any other installed app displays on the screen. Pixnapping has been demonstrated on Google Pixel phones and the Samsung Galaxy S25 phone and likely could be modified to work on other models with additional work. Source: arstechnica.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:googles photoshopkiller ai model is coming to search photos :2025-10-13T19:52:23.000Z",
    "title": "Google’s Photoshop-killer AI model is coming to search, Photos, and NotebookLM",
    "url": "https://arstechnica.com/google/2025/10/googles-nano-banana-ai-image-editor-is-coming-to-search-photos-and-notebooklm/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2025-10-13T19:52:23.000Z",
    "summary_long": "Google began experimenting with conversational image editing earlier this year in the dev-focused AI studio, but the feature didn't remain experimental for long. Over the summer, Google rolled out the \"Nano Banana\" image-editing model in Gemini 2.5 Flash. You can use this feature to modify images with just a prompt, and now you don't even need to go to Gemini to use it. Google says Nano Banana is now coming to search, Google Photos, and NotebookLM. Source: arstechnica.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:starships elementary era ends today with megarockets 11th te:2025-10-13T19:27:10.000Z",
    "title": "Starship’s elementary era ends today with mega-rocket’s 11th test flight",
    "url": "https://arstechnica.com/science/2025/10/starships-elementary-era-ends-today-with-mega-rockets-11th-test-flight/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-10-13T19:27:10.000Z",
    "summary_long": "SpaceX is set to launch the 11th full-scale test flight of the company's Starship rocket Monday evening, with hopes of capping a tumultuous year with a successful one-hour voyage from South Texas to the Indian Ocean. Liftoff of the Super Heavy booster with the Starship upper stage is scheduled for 6:15 pm CDT (7:15 pm EDT; 23:15 UTC). SpaceX has a 75-minute window to launch Monday. You can watch a livestream of the flight here. Source: arstechnica.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:strategy bought 27m in bitcoin at 123k before crypto crash:2025-10-13T16:17:09.000Z",
    "title": "Strategy Bought $27M in Bitcoin at $123K Before Crypto Crash",
    "url": "https://www.coindesk.com/business/2025/10/13/strategy-bought-usd27m-in-bitcoin-at-usd123k-before-crypto-crash",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-10-13T16:17:09.000Z",
    "summary_long": "Strategy (MSTR), the world's largest corporate owner of bitcoin (BTC), appeared to miss out on capitalizing on last week's market rout to purchase the dip in prices. According to Monday's press release, the firm bought 220 BTC at an average price of $123,561. The company used the proceeds of selling its various preferred stocks (STRF, STRK, STRD), raising $27.3 million. That purchase price was well above the prices the largest crypto changed hands in the second half of the week. Source: www.coindesk.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:investment bank china renaissance plans 600m bnb treasury wi:2025-10-13T14:30:58.000Z",
    "title": "Investment Bank China Renaissance Plans $600M BNB Treasury With YZi Labs: Bloomberg",
    "url": "https://www.coindesk.com/business/2025/10/13/investment-bank-china-renaissance-plans-usd600m-bnb-treasury-with-yzi-labs-bloomberg",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-10-13T14:30:58.000Z",
    "summary_long": "Hong Kong-listed investment bank China Renaissance is seeking to raise $600 million to introduce a public crypto treasury focused on BNB, the native token of the BNB Chain that’s widely used for discounts on Binance fees. The project, if completed, would mark one of the largest single bets on BNB by a publicly listed entity. The largest BNB-focused treasuries among publicly traded companies currently belongs to CEA Industries, which earlier this month raised its total token holdings to 480,000. The proposed investment vehicle would be formed in the United States and structured as a publicly traded company, designed specifically to buy and hold BNB, Bloomberg reports citing sources familiar with the deal. Source: www.coindesk.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:wazirx restructuring cleared in massive relief for 230m hack:2025-10-13T13:21:14.000Z",
    "title": "WazirX Restructuring Cleared in Massive Relief for $230M Hack Victims",
    "url": "https://www.coindesk.com/markets/2025/10/13/wazirx-restructuring-cleared-in-massive-relief-for-usd230m-hack-victims",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Shaurya Malwa",
    "published_at": "2025-10-13T13:21:14.000Z",
    "summary_long": "Singapore’s High Court has approved Zettai Pte. Ltd.’s restructuring scheme, clearing the path for the reopening of Indian crypto exchange WazirX less than a year after it was crippled by the largest hack on any crypto business in the country. The sanction order followed an August re-vote that saw 95.7% of creditors by number and 94.6% by value support the plan. “As soon as the scheme is legally effective, we will restart platform operations within 10 business days,” WazirX founder Nischal Shetty claimed. Source: www.coindesk.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:uk regulator fines 4chan for ignoring online safety act dema:2025-10-14T04:50:26.000Z",
    "title": "UK regulator fines 4chan for ignoring Online Safety Act demands",
    "url": "https://www.engadget.com/cybersecurity/uk-regulator-fines-4chan-for-ignoring-online-safety-act-demands-045026169.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2025-10-14T04:50:26.000Z",
    "summary_long": "Ofcom has slapped 4chan with a £20,000 ($26,700) fine for failing to comply with the internet and telecommunications regulator's request for information under the UK's Online Safety Act of 2023. The regulator has released an update for 11 of the investigations it opened after the first of its online safety codes became enforceable in March this year. Apparently, 4chan has ignored its requests for a copy of its illegal harms risk assessment and to provide information about its qualifying worldwide revenue. This is the first fine Ofcom has handed down under the new law, which was designed to prevent children from accessing harmful content online and which has prompted websites like Reddit and X to put up age verification measures. Source: www.engadget.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex launches final version 2 starshipsuper heavy rocket:2025-10-14T03:26:43.000Z",
    "title": "SpaceX launches final Version 2 Starship-Super Heavy rocket",
    "url": "https://spaceflightnow.com/2025/10/14/spacex-launches-final-version-2-starship-super-heavy-rocket/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-14T03:26:43.000Z",
    "summary_long": "SpaceX closed a chapter in its Starship saga on Monday. It launched what appeared to be a nearly flawless suborbital mission with its Version 2 Starship-Super Heavy rocket, the final flight for this iteration of the launch vehicle. The more than 400-foot-tall rocket thundered away from Pad A at Starbase at 6:23 p.m. CDT (7:23 p.m. Source: spaceflightnow.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:mathbeyond a benchmark for rl to expand beyond the base mode:2025-10-13T17:30:54.000Z",
    "title": "MATH-Beyond: A Benchmark for RL to Expand Beyond the Base Model",
    "url": "http://arxiv.org/abs/2510.11653v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Prasanna Mayilvahanan",
    "published_at": "2025-10-13T17:30:54.000Z",
    "summary_long": "With the advent of DeepSeek-R1, a new wave of reinforcement learning (RL) methods has emerged that seem to unlock stronger mathematical reasoning. However, a closer look at the open-source ecosystem reveals a critical limitation: with sufficiently many draws (e.g., $\\texttt{pass@1024}$), many existing base models already solve nearly all questions on widely used math benchmarks such as MATH-500 and AIME 2024. This suggests that the RL fine-tuning methods prevalent in the LLM reasoning literature largely sharpen existing solution modes rather than discovering entirely new ones. Such sharpening stands in contrast to the broader promise of RL: to foster exploration and to acquire new skills. Source: arxiv.org. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:googles nano banana aiimage editing is coming to search note:2025-10-13T18:41:11.000Z",
    "title": "Google's Nano Banana AI-image editing is coming to Search, NotebookLM and Photos",
    "url": "https://www.engadget.com/ai/googles-nano-banana-ai-image-editing-is-coming-to-search-notebooklm-and-photos-184111046.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2025-10-13T18:41:11.000Z",
    "summary_long": "Google's Nano Banana AI image editor became something of a viral sensation when it launched last month. Now the tool is being integrated into a bunch of pre-existing Google products, like Search, NotebookLM and Photos. Perhaps the most notable integration here is with NotebookLM. Nano Banana is being used to drastically change up Video Overviews, offering up six new styles like watercolor and anime. Source: www.engadget.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex launches 24 amazon kuiper satellites following days o:2025-10-13T17:47:55.000Z",
    "title": "SpaceX launches 24 Amazon Kuiper satellites following days of weather delays",
    "url": "https://spaceflightnow.com/2025/10/13/live-coverage-spacex-poised-to-launch-24-amazon-kuiper-satellites-following-days-of-weather-delays/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-13T17:47:55.000Z",
    "summary_long": "Update Oct. 13, 11:27 p.m. EDT (0327 UTC): SpaceX confirmed deployment of the Kuiper satellites. After more than a week of launch delays, SpaceX launched its Falcon 9 rocket from Cape Canaveral Space Force Station with two dozen of Amazon’s Project Kuiper broadband internet satellites onboard Monday night. Source: spaceflightnow.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:california enacts agegate law for app stores:2025-10-13T17:28:02.000Z",
    "title": "California enacts age-gate law for app stores",
    "url": "https://www.engadget.com/california-enacts-age-gate-law-for-app-stores-172802711.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-13T17:28:02.000Z",
    "summary_long": "California has become the latest state to age-gate app stores and operating systems. AB 1043 is one of several internet regulation bills that Governor Gavin Newsom signed into law on Monday, including ones related to social media warning labels, chatbots and deepfake pornography. The State Assembly passed AB 1043 with a 58-0 vote in September. The legislation received backing from notable tech companies such as Google, OpenAI, Meta, Snap and Pinterest. Source: www.engadget.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]