[
  {
    "id": "bigtech:trumps energy secretary orders a washington state coal plant:2025-12-19T18:29:04.000Z",
    "title": "Trump’s energy secretary orders a Washington state coal plant to remain open",
    "url": "https://arstechnica.com/science/2025/12/trumps-energy-secretary-orders-a-washington-state-coal-plant-to-remain-open/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Blaine Harden, Inside Climate News\n                ",
    "published_at": "2025-12-19T18:29:04.000Z",
    "summary_long": "SEATTLE—The last coal-fired power plant in Washington state was set to go cold at the end of the year. It would then switch to natural gas, cutting carbon emissions in half. The shutdown had been in the works for 15 years and was mandated by state law. It required the Canadian energy company that owns the power plant, TransAlta, to retrain workers and ease the local community’s economic transition. Source: arstechnica.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:russia is about to do the most russia thing ever with its ne:2025-12-19T16:04:35.000Z",
    "title": "Russia is about to do the most Russia thing ever with its next space station",
    "url": "https://arstechnica.com/space/2025/12/russia-is-about-to-do-the-most-russia-thing-ever-with-its-next-space-station/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-12-19T16:04:35.000Z",
    "summary_long": "For several years now, in discussing plans for its human spaceflight program beyond the International Space Station, Russian officials would proudly bring up the Russian Orbital Station, or ROS. The first elements of ROS were to launch in 2027 so it would be ready for human habitation in 2028. Upon completion in the mid-2030s, the station would encompass seven shiny new modules, potentially including a private habitat for space tourists. It would be so sophisticated that the station could fly autonomously for months if needed. Source: arstechnica.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:rocket report russia pledges quick fix for soyuz launch pad :2025-12-19T15:30:51.000Z",
    "title": "Rocket Report: Russia pledges quick fix for Soyuz launch pad; Ariane 6 aims high",
    "url": "https://arstechnica.com/space/2025/12/rocket-report-russia-pledges-quick-fix-for-soyuz-launch-pad-ariane-6-aims-high/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-12-19T15:30:51.000Z",
    "summary_long": "Welcome to Edition 8.23 of the Rocket Report! Several new rockets made their first flights this year. Blue Origin’s New Glenn was the most notable debut, with a successful inaugural launch in January followed by an impressive second flight in November, culminating in the booster’s first landing on an offshore platform. Second on the list is China’s Zhuque-3, a partially reusable methane-fueled rocket developed by the quasi-commercial launch company LandSpace. Source: arstechnica.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:netflix is acquiring game avatar maker ready player me:2025-12-19T20:44:43.000Z",
    "title": "Netflix is acquiring game avatar maker Ready Player Me",
    "url": "https://www.engadget.com/gaming/netflix-is-acquiring-game-avatar-maker-ready-player-me-204443001.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-12-19T20:44:43.000Z",
    "summary_long": "Netflix is acquiring Estonian startup Ready Player Me, a company creating \"cross-game avatar tech\" that allows players to bring their digital personas with them to different games, the company's CEO Timmu Tõke shared in a LinkedIn post. The acquisition is part of Netflix's new games strategy, which puts an emphasis on approachable multiplayer titles and adaptations of the streaming service's IP. Ready Player Me's team of around 20 employees will be incorporated into Netflix's staff, TechCrunch writes, though Tõke is the only one of the startup's four founders who will continue on after the acquisition. Neither company has shared when the avatar tech will be incorporated into Netflix's games or what games will support the feature when they do. Source: www.engadget.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa shares spacex crew12 assignments for space station miss:2025-12-19T20:21:53.000Z",
    "title": "NASA Shares SpaceX Crew-12 Assignments for Space Station Mission",
    "url": "https://www.nasa.gov/news-release/nasa-shares-spacex-crew-12-assignments-for-space-station-mission/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jessica Taveau",
    "published_at": "2025-12-19T20:21:53.000Z",
    "summary_long": "From left to right, NASA astronauts Jessica Meir and Jack Hathaway, ESA (European Space Agency) astronaut Sophie Adenot, and Roscosmos cosmonaut Andrey Fedyaev. Credit: NASA As part of NASA’s SpaceX Crew-12 mission, four crew members from three space agencies will launch no earlier than Sunday, Feb. 15, 2026, to the International Space Station for a long-duration science expedition. NASA astronauts Jessica Meir and Jack Hathaway will serve as spacecraft commander and pilot, respectively, and will be accompanied by ESA (European Space Agency) astronaut Sophie Adenot and Roscosmos cosmonaut Andrey Fedyaev, who will both serve as mission specialists. Source: www.nasa.gov. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa johnsons 2025 milestones:2025-12-19T19:59:20.000Z",
    "title": "NASA Johnson’s 2025 Milestones",
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/nasa-johnsons-2025-milestones/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Sumer Loggins",
    "published_at": "2025-12-19T19:59:20.000Z",
    "summary_long": "NASA’s Johnson Space Center in Houston closed 2025 with major progress across human spaceflight, research, and exploration. From Artemis II mission preparations to science aboard the International Space Station, teams at Johnson helped prepare for future missions to the Moon and, ultimately, Mars. ORION STACKED FOR ARTEMIS II, ORION MISSION EVALUATION ROOM UNVEILED NASA’s Artemis II Orion spacecraft with its launch abort system is stacked atop the agency’s SLS (Space Launch System) rocket in High Bay 3 of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on Oct. 20, 2025. Source: www.nasa.gov. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas wideband technology demo proves space missions are fre:2025-12-19T19:57:34.000Z",
    "title": "NASA’s Wideband Technology Demo Proves Space Missions are Free to Roam",
    "url": "https://www.nasa.gov/humans-in-space/commercial-space/nasas-wideband-technology-demo-proves-space-missions-are-free-to-roam/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Molly Kearns",
    "published_at": "2025-12-19T19:57:34.000Z",
    "summary_long": "4 Min Read NASA’S WIDEBAND TECHNOLOGY DEMO PROVES SPACE MISSIONS ARE FREE TO ROAM An artist's concept of the Polylingual Experimental Terminal transmitting data in space. Credits: NASA/Morgan Johnson Just like your cellphone stays connected by roaming between networks, NASA’s Polylingual Experimental Terminal, or PExT, technology demonstration is proving space missions can do the same by switching seamlessly between government and commercial communications networks. NASA missions rely on critical data to navigate, monitor spacecraft health, and transmit scientific information back to Earth, and this game-changing technology could provide multiple benefits to government and commercial missions by enabling more reliable communications with fewer data interruptions. “This mission has reshaped what’s possible for NASA and the U.S. Source: www.nasa.gov. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:engadget podcast 2025 was the year of ai smartglasses and sp:2025-12-19T14:30:00.000Z",
    "title": "Engadget Podcast: 2025 was the year of AI, smartglasses and spineless Big Tech",
    "url": "https://www.engadget.com/social-media/engadget-podcast-2025-was-the-year-of-ai-smartglasses-and-spineless-big-tech-143000338.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Devindra Hardawar",
    "published_at": "2025-12-19T14:30:00.000Z",
    "summary_long": "This week, Engadget Managing Editor Cherlynn Low joins us to look back at some of the highlights (and lowlights) of 2025. We dive into our favorite gadgets of the year, the many ways Big Tech bowed to Trump, the disappointment of AI PCs and the rise of smart glasses. We also learn way too much about our skincare routines. * iTunes * Spotify * Pocket Casts * Stitcher * Google Podcasts TOPICS * Our favorite gadgets of 2025: Kindle Scribe Colorsoft, Airpods Pro 3, bluetooth lav mics and more – 2:26 * Favorite Media of 2025: Andor, self-improvement via podcast, and a shoutout to your library – 34:30 * iRobot declares bankruptcy – 47:29 * Warner Bros. Source: www.engadget.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:ai advertising company hacked:2025-12-19T12:02:43.000Z",
    "title": "AI Advertising Company Hacked",
    "url": "https://www.schneier.com/blog/archives/2025/12/ai-advertising-company-hacked.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2025-12-19T12:02:43.000Z",
    "summary_long": "At least some of this is coming to light: > Doublespeed, a startup backed by Andreessen Horowitz (a16z) that uses a phone farm to manage at least hundreds of AI-generated social media accounts and promote products has been hacked. The hack reveals what products the AI-generated accounts are promoting, often without the required disclosure that these are advertisements, and allowed the hacker to take control of more than 1,000 smartphones that power the company. > > The hacker, who asked for anonymity because he feared retaliation from the company, said he reported the vulnerability to Doublespeed on October 31. At the time of writing, the hacker said he still has access to the company’s backend, including the phone farm itself. Source: www.schneier.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:a starlink satellite just exploded and left trackable debris:2025-12-19T12:00:02.000Z",
    "title": "A Starlink satellite just exploded and left 'trackable' debris",
    "url": "https://www.engadget.com/science/space/a-starlink-satellite-just-exploded-and-left-trackable-debris-120002814.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2025-12-19T12:00:02.000Z",
    "summary_long": "SpaceX said it experienced an anomaly with one if its Starlink satellites that was likely caused by a small explosion. \"The anomaly led to venting of the propulsion tank, a rapid decay in semi-major axis by about 4 km [2.5 miles] and the release of a small number of trackable low relatively velocity objects,\" Starlink wrote in a post on X. Orbital tracking company LeoLabs assessed that the issue was caused by an \"internal energetic source rather than a collision with space debris or another object.\" SpaceX said it's working with NASA and the US Space Force to track the remains of the object. \"The satellite is largely intact, tumbling and will reenter the Earth's atmosphere and fully demise within weeks,\" the company said. Source: www.engadget.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:wall street bank jpmorgan says stablecoin market could grow :2025-12-19T14:54:30.000Z",
    "title": "Wall Street bank JPMorgan says stablecoin market could grow to $600 billion by 2028",
    "url": "https://www.coindesk.com/markets/2025/12/19/wall-street-bank-jpmorgan-says-stablecoin-market-could-grow-to-usd600-billion-by-2028",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-12-19T14:54:30.000Z",
    "summary_long": "Wall Street bank JPMorgan says stablecoin market could grow to $600 billion by 2028 Source: www.coindesk.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:sbfs cohorts at ftx take last sec hit ellison banned from co:2025-12-19T18:09:08.000Z",
    "title": "SBF's cohorts at FTX take last SEC hit, Ellison banned from company roles for decade",
    "url": "https://www.coindesk.com/policy/2025/12/19/sbf-s-cohorts-at-ftx-take-last-sec-hit-ellison-banned-from-company-roles-for-decade",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jesse Hamilton",
    "published_at": "2025-12-19T18:09:08.000Z",
    "summary_long": "SBF's cohorts at FTX take last SEC hit, Ellison banned from company roles for decade Source: www.coindesk.com. Date: 2025-12-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]