[
  {
    "id": "bigtech:us gives local police a facescanning app similar to one used:2025-11-04T21:26:03.000Z",
    "title": "US gives local police a face-scanning app similar to one used by ICE agents",
    "url": "https://arstechnica.com/tech-policy/2025/11/us-gives-local-police-a-face-scanning-app-similar-to-one-used-by-ice-agents/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-11-04T21:26:03.000Z",
    "summary_long": "US Customs and Border Protection (CBP) launched a face-scanning app for local law enforcement agencies that assist the federal government with immigration-enforcement operations. The Mobile Identify app was released on the Google Play store on October 30. “This app facilitates functions authorized by Section 287(g) of the Immigration and Nationality Act (INA),” a US law that lets Immigration and Customs Enforcement (ICE) delegate immigration-officer duties to state and local law enforcement, according to the Mobile Identify app’s description on the Google Play store. “Through a formal agreement, or Memorandum of Agreement (MOA), with DHS [Department of Homeland Security], participating agencies like your Sheriff’s Department can have designated officers who are trained, certified, and authorized to perform certain immigration enforcement functions, helping to identify and process individuals who may be in the country unlawfully. Source: arstechnica.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:amazon sends legal threats to perplexity over agentic browsi:2025-11-04T23:05:04.000Z",
    "title": "Amazon sends legal threats to Perplexity over agentic browsing",
    "url": "https://techcrunch.com/2025/11/04/amazon-sends-legal-threats-to-perplexity-over-agentic-browsing/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Julie Bort, Rebecca Bellan",
    "published_at": "2025-11-04T23:05:04.000Z",
    "summary_long": "Amazon sends legal threats to Perplexity over agentic browsing Source: techcrunch.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:openais sora app is now available on android:2025-11-04T19:17:22.000Z",
    "title": "OpenAI's Sora app is now available on Android",
    "url": "https://www.engadget.com/ai/openais-sora-app-is-now-available-on-android-191722821.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-04T19:17:22.000Z",
    "summary_long": "Sora is now available to Android users on the Google Play Store. The iOS version of OpenAI's text-to-video generative AI app is still only available in select markets and requires an invitation, but people are still extremely excited about making slop of their own; the app reportedly reached more than 1 million downloads in less than five days. And it didn't take long for the company to land in hot water over users creating disrespectful clips of Martin Luther King Jr. and drawing censure from the Japanese government over copycats of famous manga and anime. Source: www.engadget.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:whatsapp launches longawaited apple watch app:2025-11-04T15:00:00.000Z",
    "title": "WhatsApp launches long-awaited Apple Watch app",
    "url": "https://techcrunch.com/2025/11/04/whatsapp-launches-long-awaited-apple-watch-app/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Aisha Malik",
    "published_at": "2025-11-04T15:00:00.000Z",
    "summary_long": "WhatsApp launches long-awaited Apple Watch app Source: techcrunch.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:reddit will be included in australias looming under16 social:2025-11-04T21:30:52.000Z",
    "title": "Reddit will be included in Australia's looming under-16 social media ban",
    "url": "https://www.engadget.com/reddit-will-be-included-in-australias-looming-under-16-social-media-ban-213052856.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-04T21:30:52.000Z",
    "summary_long": "Reddit won't escape Australia's child social media ban. The Guardian reports that Communications Minister Anika Wells announced Reddit's addition on Wednesday. The nation's law, which blocks children under 16 from major social media sites, is scheduled to go into effect on December 10. Alongside Reddit, Wells said Australian streaming site Kick would also be included. Source: www.engadget.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apples live translation feature is finally coming to airpods:2025-11-04T20:13:52.000Z",
    "title": "Apple's Live Translation feature is finally coming to AirPods in the EU",
    "url": "https://www.engadget.com/audio/headphones/apples-live-translation-feature-is-finally-coming-to-airpods-in-the-eu-201352038.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-04T20:13:52.000Z",
    "summary_long": "After a delay, Apple has announced that it's bringing its AI-powered Live Translation feature to the European Union in December. The expansion is notable, not only because Live Translation was a key selling point of the recently released AirPods Pro 3, but also because the company warned in September that complying with the EU's Digital Markets Act could delay the feature. When Live Translation becomes available in the EU on AirPods Pro 3, Pro 2 and AirPods 4 with ANC next month, the feature will automatically translate a speaker's voice between English, French, German, Portuguese, Spanish, Italian, Chinese (Simplified and Traditional Mandarin), Japanese and Korean. Live Translation can also seamlessly translate between pairs of AirPods, intelligently lowering a speaker's voice so the translation is easier to hear. Source: www.engadget.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:appeals court seems unmoved by sam bankmanfrieds claims of a:2025-11-04T19:06:28.000Z",
    "title": "Appeals Court Seems Unmoved by Sam Bankman-Fried’s Claims of an Unfair Trial",
    "url": "https://www.coindesk.com/policy/2025/11/04/appeals-court-seems-unmoved-by-sam-bankman-fried-s-claims-of-an-unfair-trial",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Cheyenne Ligon",
    "published_at": "2025-11-04T19:06:28.000Z",
    "summary_long": "Appeals Court Seems Unmoved by Sam Bankman-Fried’s Claims of an Unfair Trial Source: www.coindesk.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:oolong evaluating long context reasoning and aggregation cap:2025-11-04T18:42:12.000Z",
    "title": "Oolong: Evaluating Long Context Reasoning and Aggregation Capabilities",
    "url": "http://arxiv.org/abs/2511.02817v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Amanda Bertsch",
    "published_at": "2025-11-04T18:42:12.000Z",
    "summary_long": "As model context lengths continue to grow, concerns about whether models effectively use the full context length have persisted. While several carefully designed long-context evaluations have recently been released, these evaluations tend to rely on retrieval from one or more sections of the context, which allows nearly all of the context tokens to be disregarded as noise. This represents only one type of task that might be performed with long context. We introduce Oolong, a benchmark of long-context reasoning tasks that require analyzing individual chunks of text on an atomic level, and then aggregating these analyses to answer distributional questions. Source: arxiv.org. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:chainlinks link tumbles 6 as technical breakdown trumps ubs :2025-11-04T18:38:28.000Z",
    "title": "Chainlink's LINK Tumbles 6% as Technical Breakdown Trumps UBS, FTSE Partnership",
    "url": "https://www.coindesk.com/markets/2025/11/04/chainlink-s-link-tumbles-6-as-technical-breakdown-trumps-ubs-ftse-partnership",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-11-04T18:38:28.000Z",
    "summary_long": "Chainlink's LINK Tumbles 6% as Technical Breakdown Trumps UBS, FTSE Partnership Source: www.coindesk.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:enhancing federated learning privacy with qubo:2025-11-04T18:06:30.000Z",
    "title": "Enhancing Federated Learning Privacy with QUBO",
    "url": "http://arxiv.org/abs/2511.02785v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Andras Ferenczi",
    "published_at": "2025-11-04T18:06:30.000Z",
    "summary_long": "Federated learning (FL) is a widely used method for training machine learning (ML) models in a scalable way while preserving privacy (i.e., without centralizing raw data). Prior research shows that the risk of exposing sensitive data increases cumulatively as the number of iterations where a client's updates are included in the aggregated model increase. Attackers can launch membership inference attacks (MIA; deciding whether a sample or client participated), property inference attacks (PIA; inferring attributes of a client's data), and model inversion attacks (MI; reconstructing inputs), thereby inferring client-specific attributes and, in some cases, reconstructing inputs. In this paper, we mitigate risk by substantially reducing per client exposure using a quantum computing-inspired quadratic unconstrained binary optimization (QUBO) formulation that selects a small subset of client updates most relevant for each training round. Source: arxiv.org. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:veccomp vector computing via mimo digital overtheair computa:2025-11-04T17:46:11.000Z",
    "title": "VecComp: Vector Computing via MIMO Digital Over-the-Air Computation",
    "url": "http://arxiv.org/abs/2511.02765v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Saeed Razavikia",
    "published_at": "2025-11-04T17:46:11.000Z",
    "summary_long": "Recently, the ChannelComp framework has proposed digital over-the-air computation by designing digital modulations that enable the computation of arbitrary functions. Unlike traditional analog over-the-air computation, which is restricted to nomographic functions, ChannelComp enables a broader range of computational tasks while maintaining compatibility with digital communication systems. This framework is intended for applications that favor local information processing over the mere acquisition of data. However, ChannelComp is currently designed for scalar function computation, while numerous data-centric applications necessitate vector-based computations, and it is susceptible to channel fading. Source: arxiv.org. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:olas launches pearl v1 the first ai agent app store:2025-11-04T17:00:00.000Z",
    "title": "Olas Launches Pearl v1, the First 'AI Agent App Store'",
    "url": "https://www.coindesk.com/tech/2025/11/04/olas-launches-pearl-v1-the-first-ai-agent-app-store",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-11-04T17:00:00.000Z",
    "summary_long": "Olas Launches Pearl v1, the First 'AI Agent App Store' Source: www.coindesk.com. Date: 2025-11-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]