[
  {
    "id": "space:department of the air force faa clear spacex to launch up to:2025-09-12T17:31:45.000Z",
    "title": "Department of the Air Force, FAA clear SpaceX to launch up to 120 Falcon 9 rockets annually from Cape Canaveral",
    "url": "https://spaceflightnow.com/2025/09/12/department-of-the-air-force-faa-clear-spacex-to-launch-up-to-120-falcon-9-rockets-annually-from-cape-canaveral/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-09-12T17:31:45.000Z",
    "summary_long": "The Federal Aviation Administration and the Department of the Air Force gave the green light for SpaceX to more than double its launch cadence from its workhorse launch pad in Florida and construct a new landing zone for its Falcon rocket boosters. On Sept. 3, the FAA published documents supporting SpaceX’s proposal to launch up to 120 times using its Falcon 9 rocket at Space Launch Complex 40 (SLC-40) at Cape Canaveral Space Force Station. It also gave the environmental thumbs up for SpaceX’s plan to construct a new landing zone adjacent to its launch pad. Source: spaceflightnow.com. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:tucker carlson asks sam altman if an openai employee was mur:2025-09-13T00:19:28.000Z",
    "title": "Tucker Carlson asks Sam Altman if an OpenAI employee was murdered &#8216;on your orders&#8217;",
    "url": "https://www.theverge.com/news/777666/tucker-carlson-altman-openai-interview",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Richard Lawler",
    "published_at": "2025-09-13T00:19:28.000Z",
    "summary_long": "While interviewing OpenAI CEO Sam Altman this week, former Fox News host Tucker Carlson brought up his belief in a conspiracy theory that former OpenAI researcher Suchir Balaji was “definitely murdered.” The researcher’s death in November 2024, which was ruled a suicide by the San Francisco police, followed his release of statements online and in a New York Times article calling out OpenAI’s tech for alleged copyright violations. In their back-and-forth about a half-hour into the chat, Carlson bluntly explains his reasons for believing the theory, and that “[Balji’s] mother claims he was murdered on your orders.” Altman brings up the police reports and their findings after an investigation, later remarking, “I feel strange and sad debating this, and having to defend myself seems totally crazy, and you are a little bit accusing me,” even as Carlson denies doing so. Balaji had said that he was able to, using mathematical analysis, support the conclusion that “OpenAI’s use of copyrighted data…",
    "tags": []
  },
  {
    "id": "space:nasa awards third glenn facility and engineering services co:2025-09-12T20:20:42.000Z",
    "title": "NASA Awards Third Glenn Facility and Engineering Services Contract",
    "url": "https://www.nasa.gov/news-release/nasa-awards-third-glenn-facility-and-engineering-services-contract/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Tiernan P. Doyle",
    "published_at": "2025-09-12T20:20:42.000Z",
    "summary_long": "Credit: NASA NASA has selected Troy Sierra JV, LLC of Huntsville, Alabama, to provide engineering, research, and scientific support at the agency’s Glenn Research Center in Cleveland. The Test Facility Operations, Maintenance, and Engineering Services III contract is a cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract with a maximum potential value of approximately $388.3 million. The performance period begins Jan. 1, 2026, with a three-year base period followed by a two-year option, and a potential six-month extension through June 2031. Source: www.nasa.gov. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:pilot union urges faa to reject rainmakers drone cloudseedin:2025-09-12T20:42:12.000Z",
    "title": "Pilot union urges FAA to reject Rainmaker’s drone cloud-seeding plan",
    "url": "https://techcrunch.com/2025/09/12/pilot-union-urges-faa-to-reject-rainmakers-drone-cloud-seeding-plan/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Aria Alamalhodaei, Tim De Chant",
    "published_at": "2025-09-12T20:42:12.000Z",
    "summary_long": "Pilot union urges FAA to reject Rainmaker’s drone cloud-seeding plan Source: techcrunch.com. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:rfk jrs cdc may limit covid shots to 75 and up claim they ki:2025-09-12T22:00:53.000Z",
    "title": "RFK Jr.’s CDC may limit COVID shots to 75 and up, claim they killed kids",
    "url": "https://arstechnica.com/health/2025/09/covid-shot-access-could-tighten-rfk-jr-may-claim-they-cause-child-deaths/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2025-09-12T22:00:53.000Z",
    "summary_long": "Under ardent anti-vaccine activist Robert F. Kennedy Jr, federal health officials are working to link COVID-19 mRNA vaccines to the deaths of 25 children, and may further restrict access to the shots, possibly recommending them for people aged 75 and up, instead of 65 and up, according to The Washington Post. Four unnamed sources close to the situation told the Post that Trump administration health officials appear to be using information from the Vaccine Adverse Event Reporting System (VAERS) to make the claim that COVID-19 vaccines have killed children. VAERS is a system in which anyone can report anything they think is an adverse event related to a vaccination. Source: arstechnica.com. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:scientists its do or die time for americas primacy exploring:2025-09-12T23:48:17.000Z",
    "title": "Scientists: It’s do or die time for America’s primacy exploring the Solar System",
    "url": "https://arstechnica.com/space/2025/09/scientists-its-do-or-die-time-for-americas-primacy-exploring-the-solar-system/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-09-12T23:48:17.000Z",
    "summary_long": "Federal funding is about to run out for 19 active space missions studying Earth's climate, exploring the Solar System, and probing mysteries of the Universe. This year's budget expires at the end of this month, and Congress must act before October 1 to avert a government shutdown. If Congress passes a budget before then, it will most likely be in the form of a continuing resolution, an extension of this year's funding levels into the first few weeks or months of fiscal year 2026. The White House's budget request for fiscal year 2026 calls for a 25 percent cut to NASA's overall budget, and a nearly 50 percent reduction in funding for the agency's Science Mission Directorate. Source: arstechnica.com. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas x59 moves toward first flight at speed of safety:2025-09-12T18:37:32.000Z",
    "title": "NASA’s X-59 Moves Toward First Flight at Speed of Safety",
    "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasas-x-59-moves-toward-first-flight-at-speed-of-safety/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Dede Dinius",
    "published_at": "2025-09-12T18:37:32.000Z",
    "summary_long": "5 Min Read NASA’S X-59 MOVES TOWARD FIRST FLIGHT AT SPEED OF SAFETY NASA’s X-59 quiet supersonic research aircraft is seen at dawn with firetrucks and safety personnel nearby during a hydrazine safety check at U.S. Air Force Plant 42 in Palmdale, California, on Aug. 18, 2025. The operation highlights the extensive precautions built into the aircraft’s safety procedures for a system that serves as a critical safeguard, ensuring the engine can be restarted in flight as the X-59 prepares for its first flight. Source: www.nasa.gov. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa war department partnership tests boundaries of autonomo:2025-09-12T18:22:46.000Z",
    "title": "NASA, War Department Partnership Tests Boundaries of Autonomous Drone Operations",
    "url": "https://www.nasa.gov/centers-and-facilities/ames/nasa-war-department-partnership-tests-boundaries-of-autonomous-drone-operations/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Tara Friesen",
    "published_at": "2025-09-12T18:22:46.000Z",
    "summary_long": "3 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) Researchers in the Verification and Validation Lab at NASA’s Ames Research Center in California’s Silicon Valley monitor a simulated drone’s flight path during a test of the FUSE demonstration. NASA/Brandon Torres Navarrete Through an ongoing collaboration, NASA and the Department of War are working to advance the future of modern drones to support long distance cargo transportation that could increase efficiency, reduce human workload, and enhance safety. Researchers from NASA’s Ames Research Center in California’s Silicon Valley recently participated in a live flight demonstration showcasing how drones can successfully fly without their operators being able to see them, a concept known as beyond visual line of sight (BVLOS). Cargo drones, a type of Unmanned Aerial Systems (UAS), carried various payloads more than 75 miles across North Dakota, between Grand Forks Air Force Base and Cavalier Space Force Station. Source: www.nasa.gov. Date: 2025-09-12.",
    "tags": []
  },
  {
    "id": "bigtech:modder injects ai dialogue into 2002s animal crossing using :2025-09-12T21:36:48.000Z",
    "title": "Modder injects AI dialogue into 2002’s Animal Crossing using memory hack",
    "url": "https://arstechnica.com/gaming/2025/09/animal-crossing-mod-uses-ai-to-orchestrate-anti-tom-nook-villager-revolt/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-09-12T21:36:48.000Z",
    "summary_long": "When software engineer Joshua Fonseca recently connected the GameCube simulation classic Animal Crossing to a modern AI language model like the kind that powers ChatGPT, he decided to shake things up. By programming the AI to roleplay as villagers growing aware of their debt situation, and giving them a shared memory to track conversations, Fonseca orchestrated a scenario where the residents began to organize against their raccoon landlord. In Animal Crossing, Tom Nook runs the town shop and provides home loans (paid out in bells, the in-game currency) that keep players perpetually in debt, which is a core mechanic of the game. \"Predictably, it escalated into an anti-Tom Nook movement,\" Fonseca wrote in a detailed post documenting his hack that bridges a 2002 game to cloud-based AI without modifying any game code. Source: arstechnica.com. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:curiosity blog sols 46494654 ridges hollows and nodules oh m:2025-09-12T22:57:37.000Z",
    "title": "Curiosity Blog, Sols 4649-4654: Ridges, Hollows and Nodules, Oh My",
    "url": "https://science.nasa.gov/blog/curiosity-blog-sols-4649-4654-ridges-hollows-and-nodules-oh-my/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-09-12T22:57:37.000Z",
    "summary_long": "Curiosity Navigation * Curiosity Home * Mission Overview * Where is Curiosity? * Mission Updates * Science * Overview * Instruments * Highlights * Exploration Goals * News and Features * Multimedia * Curiosity Raw Images * Images * Videos * Audio * Mosaics * More Resources * Mars Missions * Mars Sample Return * Mars Perseverance Rover * Mars Curiosity Rover * MAVEN * Mars Reconnaissance Orbiter * Mars Odyssey * More Mars Missions * Mars Home 2 min read CURIOSITY BLOG, SOLS 4649-4654: RIDGES, HOLLOWS AND NODULES, OH MY NASA’s Mars rover Curiosity acquired this image using its Left Navigation Camera, showing the transition from smoother ridge bedrock (right) to more nodular bedrock (bottom left to top middle) on the edge of a shallow hollow (top left). Curiosity, whose masthead shadow is also visible, captured this image on Sept. 5, 2025 — Sol 4650, or Martian day 4,650 of the Mars Science Laboratory mission — at 00:22:34 UTC.…",
    "tags": []
  },
  {
    "id": "bigtech:ram ends ev pickup truck plans:2025-09-12T22:56:16.000Z",
    "title": "Ram ends EV pickup truck plans",
    "url": "https://techcrunch.com/2025/09/12/ram-ends-ev-pickup-truck-plans/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Kirsten Korosec",
    "published_at": "2025-09-12T22:56:16.000Z",
    "summary_long": "Ram ends EV pickup truck plans Source: techcrunch.com. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:feds try to dodge lawsuit against their bogus climate report:2025-09-12T20:58:03.000Z",
    "title": "Feds try to dodge lawsuit against their bogus climate report",
    "url": "https://arstechnica.com/science/2025/09/department-of-energy-gets-rid-of-climate-skeptics-group-to-dodge-lawsuit/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    John Timmer\n                ",
    "published_at": "2025-09-12T20:58:03.000Z",
    "summary_long": "While the Trump administration has continued to refer to efforts to avoid the worst impacts of climate change as a scam, it has done almost nothing to counter the copious scientific evidence that demonstrates that climate change is real and doing real damage to the citizens of the US. The lone exception has been a draft Department of Energy report prepared by a handful of carefully chosen fringe figures that questioned the mainstream understanding of climate change. The shoddy work and questionable conclusions of that report were so extensive that an analysis of it required over 450 pages to detail all of its shortcomings. But its shortcomings may not have been limited to the science, as a lawsuit alleges that its preparation violated a law that regulates the activities of federal advisory panels. Source: arstechnica.com. Date: 2025-09-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]