[
  {
    "id": "bigtech:stoke space gives us another reason to take it very seriousl:2025-10-08T22:42:39.000Z",
    "title": "Stoke Space gives us another reason to take it very seriously",
    "url": "https://arstechnica.com/space/2025/10/stoke-space-gives-us-another-reason-to-take-it-very-seriously/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-10-08T22:42:39.000Z",
    "summary_long": "Stoke Space announced a significant capital raise on Wednesday, a total of $510 million as part of Series D funding. The new financing doubles the total capital raised by Stoke Space, founded in 2020, to $990 million. The infusion of money will provide the company with \"the runway to complete development\" of the Nova rocket and demonstrate its capability through its first flights, said Andy Lapsa, the company's co-founder and chief executive, in a news release characterizing the new funding. Stoke is working toward a 2026 launch of the medium-lift Nova rocket. Source: arstechnica.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:one nasa science mission saved from trumps cuts but others s:2025-10-08T23:56:33.000Z",
    "title": "One NASA science mission saved from Trump’s cuts, but others still in limbo",
    "url": "https://arstechnica.com/space/2025/10/one-nasa-science-mission-saved-from-trumps-cuts-but-others-still-in-limbo/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-10-08T23:56:33.000Z",
    "summary_long": "NASA has thrown a lifeline to scientists working on a mission to visit an asteroid that will make an unusually close flyby of the Earth in 2029, reversing the Trump administration's previous plan to shut it down. This mission, named OSIRIS-APEX, was one of 19 operating NASA science missions the White House proposed canceling in a budget blueprint released earlier this year. \"We were called for cancellation as part to the president's budget request, and we were reinstated and given a plan to move ahead in FY26 (Fiscal Year 2026) just two weeks ago,\" said Dani DellaGiustina, principal investigator for OSIRIS-APEX at the University of Arizona. \"Our spacecraft appears happy and healthy.\" Read full article Comments Source: arstechnica.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:bank of england warns ai stock bubble rivals 2000 dotcom pea:2025-10-08T21:18:30.000Z",
    "title": "Bank of England warns AI stock bubble rivals 2000 dotcom peak",
    "url": "https://arstechnica.com/ai/2025/10/bank-of-england-warns-ai-stock-bubble-rivals-2000-dotcom-peak/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-10-08T21:18:30.000Z",
    "summary_long": "AI bubble talk is in the air, and among the chorus of voices warning of an AI-fueled market bubble (which includes OpenAI CEO Sam Altman and Amazon's Jeff Bezos) is the Bank of England, which warned on Wednesday that global financial markets could face a sharp correction if investor sentiment turns negative on AI. The UK central bank said US stock valuations resemble those seen near the peak of the dotcom bubble on some measures, with AI-focused companies making up an unprecedented portion of market value. In its quarterly report derived from a meeting of its Financial Policy Committee that took place last week, BoE wrote that \"the risk of a sharp market correction has increased.\" Reuters notes that it's the BoE's strongest warning to date about potential AI-driven market declines. The committee, chaired by Governor Andrew Bailey, said spillover risks to Britain's financial system from such a shock were \"material.\" Read full article Comments Source: arstechnica.com. Date: 2025-10-08.",
    "tags": []
  },
  {
    "id": "fintech:pantera backs transcrypts with 15m seed round to expand bloc:2025-10-08T21:07:46.000Z",
    "title": "Pantera Backs TransCrypts with $15M Seed Round to Expand Blockchain Identity Platform",
    "url": "https://www.coindesk.com/markets/2025/10/08/pantera-backs-transcrypts-with-usd15m-seed-round-to-expand-blockchain-identity-platform",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2025-10-08T21:07:46.000Z",
    "summary_long": "TransCrypts, a blockchain startup building tools for people to own and share verified credentials, has raised a $15 million seed round led by Pantera Capital. The round included Lightspeed Faction, Alpha Edison, Motley Fool Ventures, and a mix of returning investors such as Mark Cuban and Protocol Labs. The funding follows a strong summer for the San Francisco-based company. In September, TransCrypts won CoinDesk’s Pitchfest at Consensus Hong Kong, taking home $10,000 in tokens, a trophy, and ten coaching sessions. Source: www.coindesk.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:the protocol 77 of bitcoin holders have never used btcfi sur:2025-10-08T16:13:58.000Z",
    "title": "The Protocol: 77% of Bitcoin Holders Have Never Used BTCFi, Survey Reveals",
    "url": "https://www.coindesk.com/tech/2025/10/08/the-protocol-77-of-bitcoin-holders-have-never-used-btcfi-survey-reveals",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Margaux Nijkerk",
    "published_at": "2025-10-08T16:13:58.000Z",
    "summary_long": "Welcome to The Protocol, CoinDesk's weekly wrap of the most important stories in cryptocurrency tech development. I’m Margaux Nijkerk, a reporter at CoinDesk. In this issue: * BTCFi’s Big Problem: 77% of Bitcoin Holders Haven’t Even Tried It, Says Survey * Ethereum’s Fusaka Upgrade Passes Holesky Test, Moves Closer To Mainnet * DoubleZero Mainnet Goes Live With 22% of Staked SOL on Board * Bee Maps Raises $32M to Scale Solana-Powered Decentralized Mapping Network Unknown block type \"divider\", specify a component for it in the `components.types` option NETWORK NEWS BITCOIN HOLDERS HESITANT TO EXPLORE BTC DEFI : Bitcoin decentralized finance (DeFi), also known as BTCFi, has been touted as the next wave of innovation for the world’s largest cryptocurrency. However, research suggests bitcoin holders themselves are barely engaging. Source: www.coindesk.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:avalanche crutrade tokenize 60m of collectable bottles of fi:2025-10-08T14:58:33.000Z",
    "title": "Avalanche, CruTrade Tokenize $60M of Collectable Bottles of Fine Wine",
    "url": "https://www.coindesk.com/business/2025/10/08/avalanche-crutrade-tokenize-usd60m-of-collectable-bottles-of-fine-wine",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Ian Allison",
    "published_at": "2025-10-08T14:58:33.000Z",
    "summary_long": "CruTrade, a new marketplace built on the Avalanche blockchain, has launched with more than $60 million worth of tokenized fine wine, marking what it calls the world’s largest live pool of on-chain luxury assets. The platform brings over 200,000 bottles from 250 producers — most of whom are verified in Burgundy — to collectors who can now trade ownership instantly while the bottles remain safely stored. The $9 billion secondary wine market has long struggled with high fees, slow trades, and spoilage from poor storage. CruTrade addresses those problems by keeping bottles in professional storage and transferring ownership digitally. Source: www.coindesk.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:mlesmith scaling mle tasks with automated multiagent pipelin:2025-10-08T17:57:19.000Z",
    "title": "MLE-Smith: Scaling MLE Tasks with Automated Multi-Agent Pipeline",
    "url": "http://arxiv.org/abs/2510.07307v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Rushi Qiang",
    "published_at": "2025-10-08T17:57:19.000Z",
    "summary_long": "While Language Models (LMs) have made significant progress in automating machine learning engineering (MLE), the acquisition of high-quality MLE training data is significantly constrained. Current MLE benchmarks suffer from low scalability and limited applicability because they rely on static, manually curated tasks, demanding extensive time and manual effort to produce. We introduce MLE-Smith, a fully automated multi-agent pipeline, to transform raw datasets into competition-style MLE challenges through an efficient generate-verify-execute paradigm for scaling MLE tasks with verifiable quality, real-world usability, and rich diversity. The proposed multi-agent pipeline in MLE-Smith drives structured task design and standardized refactoring, coupled with a hybrid verification mechanism that enforces strict structural rules and high-level semantic soundness. Source: arxiv.org. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:molga molecular graph adaptation with pretrained 2d graph en:2025-10-08T17:46:22.000Z",
    "title": "MolGA: Molecular Graph Adaptation with Pre-trained 2D Graph Encoder",
    "url": "http://arxiv.org/abs/2510.07289v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Xingtong Yu",
    "published_at": "2025-10-08T17:46:22.000Z",
    "summary_long": "Molecular graph representation learning is widely used in chemical and biomedical research. While pre-trained 2D graph encoders have demonstrated strong performance, they overlook the rich molecular domain knowledge associated with submolecular instances (atoms and bonds). While molecular pre-training approaches incorporate such knowledge into their pre-training objectives, they typically employ designs tailored to a specific type of knowledge, lacking the flexibility to integrate diverse knowledge present in molecules. Hence, reusing widely available and well-validated pre-trained 2D encoders, while incorporating molecular domain knowledge during downstream adaptation, offers a more practical alternative. Source: arxiv.org. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:online rubrics elicitation from pairwise comparisons:2025-10-08T17:44:59.000Z",
    "title": "Online Rubrics Elicitation from Pairwise Comparisons",
    "url": "http://arxiv.org/abs/2510.07284v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "MohammadHossein Rezaei",
    "published_at": "2025-10-08T17:44:59.000Z",
    "summary_long": "Rubrics provide a flexible way to train LLMs on open-ended long-form answers where verifiable rewards are not applicable and human preferences provide coarse signals. Prior work shows that reinforcement learning with rubric-based rewards leads to consistent gains in LLM post-training. Most existing approaches rely on rubrics that remain static over the course of training. Such static rubrics, however, are vulnerable to reward-hacking type behaviors and fail to capture emergent desiderata that arise during training. Source: arxiv.org. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:opensource tool predicts wind farm power fluctuations with g:2025-10-08T17:42:39.000Z",
    "title": "Open-source tool predicts wind farm power fluctuations with greater short-term accuracy",
    "url": "https://techxplore.com/news/2025-10-source-tool-farm-power-fluctuations.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-08T17:42:39.000Z",
    "summary_long": "Researchers from TU Delft, a partner of the SUDOCO project, in collaboration with the Université catholique de Louvain (Belgium) and the National Renewable Energy Laboratory of Golden (U.S.), have developed a new open-source wake modeling framework called \"OFF,\" enhancing existing models such as OnWARDS, FLORIDyn, and FLORIS. Source: techxplore.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:hardware vulnerability allows attackers to hack ai training :2025-10-08T16:30:04.000Z",
    "title": "Hardware vulnerability allows attackers to hack AI training data",
    "url": "https://techxplore.com/news/2025-10-hardware-vulnerability-hack-ai.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-08T16:30:04.000Z",
    "summary_long": "Hardware vulnerability allows attackers to hack AI training data Source: techxplore.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:blue origin transports new glenn booster to launch site ahea:2025-10-08T16:03:25.000Z",
    "title": "Blue Origin transports New Glenn booster to launch site ahead of Mars-bound mission",
    "url": "https://spaceflightnow.com/2025/10/08/blue-origin-transports-new-glenn-booster-to-launch-site-ahead-of-mars-bound-mission/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-08T16:03:25.000Z",
    "summary_long": "Blue Origin is one step closer to its second ever launch of its New Glenn rocket. On Wednesday morning, teams rolled the 189-foot-tall (57.5 m) booster from its faculties at Rocket Park near the Kennedy Space Center Visitor Complex to begin its journey out to Launch Complex 36 at Cape Canaveral Space Force Station. The company announced that the rocket was on the move around 8:30 a.m. EDT (1230 UTC) as it was simultaneously launching six space tourists on a suborbital New Shepard launch from West Texas. Source: spaceflightnow.com. Date: 2025-10-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]