[
  {
    "id": "bigtech:blast from the past 15 movie gems of 1985:2025-11-27T12:15:18.000Z",
    "title": "Blast from the past: 15 movie gems of 1985",
    "url": "https://arstechnica.com/culture/2025/11/blast-from-the-past-15-movie-gems-of-1985/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jennifer Ouellette\n                ",
    "published_at": "2025-11-27T12:15:18.000Z",
    "summary_long": "Peruse a list of films released in 1985 and you’ll notice a surprisingly high number of movies that have become classics in the ensuing 40 years. Sure, there were blockbusters like Back to the Future, The Goonies, Pale Rider, The Breakfast Club and Mad Max: Beyond Thunderdome, but there were also critical arthouse favorites like Kiss of the Spider Woman and Akira Kurosawa’s masterpiece, Ran. Since we’re going into a long Thanksgiving weekend, I’ve made a list, in alphabetical order, of some of the quirkier gems from 1985 that have stood the test of time. (Some of the films first premiered at film festivals or in smaller international markets in 1984, but they were released in the US in 1985.) (Some spoilers below but no major reveals.) AFTER HOURS Credit: Warner Bros. Source: arstechnica.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:watch how apple made its new puppetpacked holiday ad:2025-11-27T16:18:17.000Z",
    "title": "Watch how Apple made its new puppet-packed holiday ad",
    "url": "https://www.theverge.com/news/831431/apple-a-critter-carol-holiday-ad-puppets-practical-effects",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Andrew Liszewski",
    "published_at": "2025-11-27T16:18:17.000Z",
    "summary_long": "While companies like Coca-Cola turned to generative AI to create “visually jarring” holiday ads this year, Apple continues to embrace practical effects with its new festive short film called A Critter Carol featuring a forest full of tech-savvy woodland creatures. In the ad a hiker drops their iPhone 17 Pro, which is found by a curious raccoon who uses it to shoot an impromptu performance of the song “Friends” by Flight of the Conchords, along with other animals including a bear, wolf, owl, deer, squirrel, and rabbit. The phone is eventually retrieved by the hiker, who uses their Apple Watch to locate it. Similar to how the new Apple TV intro was created by filming a glass model of the logo illuminated with colored lights, Apple released a behind-the-scenes look at the practical effects used to make A Critter Carol. Source: www.theverge.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:a humanoid robotshaped bubble is forming china warns:2025-11-27T15:57:49.000Z",
    "title": "A humanoid robot-shaped bubble is forming, China warns",
    "url": "https://www.theverge.com/news/831451/china-humanoid-robotics-bubble",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Robert Hart",
    "published_at": "2025-11-27T15:57:49.000Z",
    "summary_long": "A humanoid robot bubble could be brewing, warned China’s leading economic planning agency on Thursday. The alert comes amid growing fears that a bubble in a related industry — AI — is about to burst. Speaking at a press briefing, National Development and Reform Commission spokesperson Li Chao said China’s humanoid robotics industry needs to balance “the speed of growth against the risk of bubbles.” Investment has been pouring into the sector despite there being few proven use cases for the bots, Li said, risking a flood of “highly similar” models as funding for research and development shrinks. More than 150 humanoid robotics companies are operating in China, Li said. Source: www.theverge.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:google limits free nano banana pro image generation usage du:2025-11-27T22:34:42.000Z",
    "title": "Google limits free Nano Banana Pro image generation usage due to 'high demand'",
    "url": "https://www.engadget.com/ai/google-limits-free-nano-banana-pro-image-generation-usage-due-to-high-demand-223442929.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Igor Bonifacic",
    "published_at": "2025-11-27T22:34:42.000Z",
    "summary_long": "If you were hoping to create some silly images this long holiday weekend with Google's new Nano Banana Pro model, I have some bad news: the company is restricting free usage of the AI system. In a support document spotted by 9to5Google, Google notes free users can currently generate two images daily, down from three per day previously. \"Image generation and editing is in high demand,\" the company writes. \"Limits may change frequently and will reset daily.\" It would appear Google is also limiting free Gemini 3 Pro usage, with the document stating non-paying users will get “basic access — daily limits may change frequently\" as well. Source: www.engadget.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:new insight into why llms are not great at cracking password:2025-11-27T15:00:01.000Z",
    "title": "New insight into why LLMs are not great at cracking passwords",
    "url": "https://techxplore.com/news/2025-11-insight-llms-great-passwords.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-27T15:00:01.000Z",
    "summary_long": "Large language models (LLMs), such as the model underpinning the functioning of OpenAI's conversational platform ChatGPT, have proved to perform well on various language-related and coding tasks. Some computer scientists have recently been exploring the possibility that these models could also be used by malicious users and hackers to plan cyber-attacks or access people's personal data. Source: techxplore.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa astronaut chris williams crewmates arrive at space stat:2025-11-27T12:50:49.000Z",
    "title": "NASA Astronaut Chris Williams, Crewmates Arrive at Space Station",
    "url": "https://www.nasa.gov/news-release/nasa-astronaut-chris-williams-crewmates-arrive-at-space-station/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lauren E. Low",
    "published_at": "2025-11-27T12:50:49.000Z",
    "summary_long": "The Soyuz rocket launches to the International Space Station with Expedition 74 crew members: NASA astronaut Chris Williams, and Roscosmos cosmonauts Sergey Kud-Sverchkov and Sergei Mikaev, on Thursday, Nov. 27, 2025, at the Baikonur Cosmodrome in Kazakhstan. NASA/Bill Ingalls NASA astronaut Chris Williams, accompanied by Roscosmos cosmonauts Sergey Kud-Sverchkov and Sergei Mikaev, safely arrived at the International Space Station on Thursday, expanding the orbiting laboratory’s crew to 10 for the next two weeks. The trio launched aboard the Soyuz MS-28 spacecraft at 4:27 a.m. Source: www.nasa.gov. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa astronaut two cosmonauts take thanksgiving day ride to :2025-11-27T12:33:59.000Z",
    "title": "NASA astronaut, two cosmonauts take Thanksgiving Day ride to space station",
    "url": "https://spaceflightnow.com/2025/11/27/nasa-astronaut-two-cosmonauts-take-thanksgiving-day-ride-to-space-station/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "William Harwood",
    "published_at": "2025-11-27T12:33:59.000Z",
    "summary_long": "Astronomer-turned-medical physicist and now NASA astronaut Chris Williams joined two Russian cosmonauts aboard a Soyuz ferry ship Thursday for a Thanksgiving Day flight to the International Space Station, kicking off a planned eight-month stay in orbit. With commander Sergey Kud-Sverchkov at the controls of the Soyuz MS-28/74S spacecraft, flanked on his left by flight engineer Sergey Mikaev and on the right by Williams, the crew’s Soyuz 2.1a booster roared to life at 4:27 a.m. EST and smoothly climbed away from the Baikonur Cosmodrome in Kazakhstan. Nine minutes and 45 seconds later, the Soyuz spacecraft was released from the booster’s upper stage, its two solar wings unfolded and the crew set off after the space station. Source: spaceflightnow.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:europe is dismantling its digital rights from within:2025-11-27T08:30:57.000Z",
    "title": "Europe is dismantling its digital rights from within",
    "url": "https://edri.org/our-work/europe-is-dismantling-its-digital-rights-from-within/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2025-11-27T08:30:57.000Z",
    "summary_long": "The European Commission’s new Digital Omnibus is presented as simple “streamlining”, but in practice it dismantles key safeguards in the GDPR, ePrivacy rules and the AI Act. It would make access to device data easier, weaken limits on automated decision-making and lower protections against discriminatory AI. The post Europe is dismantling its digital rights from within appeared first on European Digital Rights (EDRi). Source: edri.org. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:south korea suspects north korealinked lazarus behind 36m up:2025-11-28T05:18:56.000Z",
    "title": "South Korea Suspects North Korea-Linked Lazarus Behind $36M Upbit Hack",
    "url": "https://www.coindesk.com/markets/2025/11/28/south-korea-suspects-north-korea-linked-lazarus-behind-usd36m-upbit-hack",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Omkar Godbole",
    "published_at": "2025-11-28T05:18:56.000Z",
    "summary_long": "South Korea Suspects North Korea-Linked Lazarus Behind $36M Upbit Hack Source: www.coindesk.com. Date: 2025-11-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:beer giant asahi not engaging with hackers after cyberattack:2025-11-27T09:20:02.000Z",
    "title": "Beer giant Asahi not engaging with hackers after cyberattack",
    "url": "https://techxplore.com/news/2025-11-beer-giant-asahi-engaging-hackers.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-27T09:20:02.000Z",
    "summary_long": "Beer giant Asahi not engaging with hackers after cyberattack Source: techxplore.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:doge underperforms majors as support failure confirms bearis:2025-11-28T04:24:52.000Z",
    "title": "DOGE Underperforms Majors as Support Failure Confirms Bearish Shift",
    "url": "https://www.coindesk.com/markets/2025/11/28/doge-underperforms-majors-as-support-failure-confirms-bearish-shift",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Shaurya Malwa",
    "published_at": "2025-11-28T04:24:52.000Z",
    "summary_long": "DOGE Underperforms Majors as Support Failure Confirms Bearish Shift Source: www.coindesk.com. Date: 2025-11-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:us patent office says generative ai is equivalent to other t:2025-11-27T21:17:00.000Z",
    "title": "US patent office says generative AI is equivalent to other tools in inventors' belts",
    "url": "https://www.engadget.com/ai/us-patent-office-says-generative-ai-is-equivalent-to-other-tools-in-inventors-belts-211700837.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2025-11-27T21:17:00.000Z",
    "summary_long": "While generative AI systems cannot be considered inventors under US patent laws, the US Patent and Trademark Office has updated its guidelines on how they can be used in the process of creating innovations. The agency's director, John Squires, said in a notice obtained by Reuters that the USPTO deems genAI to be \"analogous\" to other tools that inventors might use in their process, including lab equipment, software and research databases. \"AI systems, including generative AI and other computational models, are instruments used by human inventors,\" Squires wrote. \"They may provide services and generate ideas, but they remain tools used by the human inventor who conceived the claimed invention.\" The notice [PDF], which is set to be published in the Federal Register on November 28, notes that there's no separate process for evaluating whether an AI-assisted invention qualifies for a patent. Source: www.engadget.com. Date: 2025-11-27. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  }
]