[
  {
    "id": "bigtech:mrna cancer vaccine shows protection at 5year followup moder:2026-01-21T22:51:26.000Z",
    "title": "mRNA cancer vaccine shows protection at 5-year follow-up, Moderna and Merck say",
    "url": "https://arstechnica.com/health/2026/01/mrna-cancer-vaccine-shows-protection-at-5-year-follow-up-moderna-and-merck-say/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2026-01-21T22:51:26.000Z",
    "summary_long": "In a small clinical trial, customized mRNA vaccines against high-risk skin cancers appeared to reduce the risk of cancer recurrence and death by nearly 50 percent over five years when compared with standard treatment alone. That's according to Moderna and Merck, the two pharmaceutical companies that have collaborated on the experimental cancer vaccine, called intismeran autogene (mRNA-4157 or V940). So far, the companies have only reported the top-line results in a press release this week. However, the results align closely with previous, more detailed analyses from the trial, which examined rates of recurrence and death at earlier time points, specifically at two years and three years after the treatment. Source: arstechnica.com. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:hundreds of creatives warn against an ai slop future:2026-01-22T05:01:00.000Z",
    "title": "Hundreds of creatives warn against an AI slop future",
    "url": "https://www.theverge.com/ai-artificial-intelligence/864951/human-artistry-campaign-ai-licensing-artists",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Mia Sato",
    "published_at": "2026-01-22T05:01:00.000Z",
    "summary_long": "Around 800 artists, writers, actors, and musicians signed on to a new campaign against what they call \"theft at a grand scale\" by AI companies. The signatories of the campaign - called \"Stealing Isn't Innovation\" - include authors George Saunders and Jodi Picoult, actors Cate Blanchett and Scarlett Johansson, and musicians like the band R.E.M., Billy Corgan, and The Roots. \"Driven by fierce competition for leadership in the new GenAI technology, profit-hungry technology companies, including those among the richest in the world as well as private equity-backed ventures, have copied a massive amount of creative content online without authori … Read the full story at The Verge. Source: www.theverge.com. Date: 2026-01-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:blue origins starlink rival terawave promises 6terabit satel:2026-01-21T23:22:57.000Z",
    "title": "Blue Origin’s Starlink rival TeraWave promises 6-terabit satellite internet",
    "url": "https://www.theverge.com/news/865282/blue-origin-terawave-satellite-6tb",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Richard Lawler",
    "published_at": "2026-01-21T23:22:57.000Z",
    "summary_long": "SpaceX has the most internet-beaming satellites in its constellation, but the competition is coming, and now Jeff Bezos' space company, Blue Origin, has announced the TeraWave network. It says TeraWave will offer bandwidth of up to 6Tb available anywhere on Earth, for both upload and download. The only wrinkle? Even after satellite deployments are scheduled to start near the end of 2027, you probably won't be able to connect directly. Source: www.theverge.com. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bitgo prices ipo at 18 pitching custody growth over crypto t:2026-01-22T03:54:57.000Z",
    "title": "BitGo prices IPO at $18, pitching custody growth over crypto trading swings",
    "url": "https://www.coindesk.com/markets/2026/01/21/bitgo-prices-ipo-at-usd18-pitching-custody-growth-over-crypto-trading-swings",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Sam Reynolds",
    "published_at": "2026-01-22T03:54:57.000Z",
    "summary_long": "BitGo prices IPO at $18, pitching custody growth over crypto trading swings Source: www.coindesk.com. Date: 2026-01-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:cleaner selfpurified trajectories boost agentic reinforcemen:2026-01-21T16:14:30.000Z",
    "title": "CLEANER: Self-Purified Trajectories Boost Agentic Reinforcement Learning",
    "url": "https://arxiv.org/abs/2601.15141v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Tianshi Xu",
    "published_at": "2026-01-21T16:14:30.000Z",
    "summary_long": "Agentic Reinforcement Learning (RL) has empowered Large Language Models (LLMs) to utilize tools like Python interpreters for complex problem-solving. However, for parameter-constrained models (e.g., 4B--7B), the exploration phase is often plagued by frequent execution failures, creating noisy trajectories that hinder policy optimization. Under standard outcome-based reward settings, this noise leads to a critical credit assignment issue, where erroneous actions are inadvertently reinforced alongside successful outcomes. Existing mitigations face a dilemma: dense rewards often trigger reward hacking, while supersampling incurs prohibitive computational costs. Source: arxiv.org. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:bangla music genre classification using bidirectional lstms:2026-01-21T15:25:44.000Z",
    "title": "Bangla Music Genre Classification Using Bidirectional LSTMS",
    "url": "https://arxiv.org/abs/2601.15083v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Muntakimur Rahaman",
    "published_at": "2026-01-21T15:25:44.000Z",
    "summary_long": "Bangla music is enrich in its own music cultures. Now a days music genre classification is very significant because of the exponential increase in available music, both in digital and physical formats. It is necessary to index them accordingly to facilitate improved retrieval. Automatically classifying Bangla music by genre is essential for efficiently locating specific pieces within a vast and diverse music library. Source: arxiv.org. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch first west coast starlink mis:2026-01-21T23:15:01.000Z",
    "title": "Live coverage: SpaceX to launch first West Coast Starlink mission of 2026",
    "url": "https://spaceflightnow.com/2026/01/21/live-coverage-spacex-to-launch-first-west-coast-starlink-mission-of-2026/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-21T23:15:01.000Z",
    "summary_long": "Update Jan. 21 11:55 p.m. EST (0455 UTC): SpaceX pushed back the T-0 liftoff time. SpaceX is set to launch its first West Coast Starlink mission of the year and will send its satellites into a polar low Earth orbit. Source: spaceflightnow.com. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas artemis ii mission to fly legacy keepsakes with astron:2026-01-21T22:48:06.000Z",
    "title": "NASA’s Artemis II Mission to Fly Legacy Keepsakes with Astronaut Crew",
    "url": "https://www.nasa.gov/missions/artemis/artemis-2/nasas-artemis-ii-mission-to-fly-legacy-keepsakes-with-astronaut-crew/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Erika Peters",
    "published_at": "2026-01-21T22:48:06.000Z",
    "summary_long": "This image shows NASA’s SLS (Space Launch System) and Orion spacecraft rolling out of the Vehicle Assembly Building at NASA’s Kennedy Space Center. NASA’s massive crawler-transporter, upgraded for the Artemis program, carries the powerful SLS rocket and Orion spacecraft on the Mobile Launcher from the Vehicle Assembly Building to Launch Pad 39B at Kennedy Space Center in preparation for the Artemis II mission. NASA/Brandon Hancock As America approaches its 250th anniversary of declaring independence, NASA’s Artemis II mission will carry a host of mementos that reflect the nation’s long tradition of exploration, innovation, and leadership in its official flight kit. The items will fly aboard the Orion spacecraft, launched on top of the Space Launch System (SLS) rocket, as it carries four astronauts around the Moon on the first crewed test flight of the agency’s Artemis campaign. Source: www.nasa.gov. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "ai_data:a comprehensive benchmark of language models on unicode and :2026-01-21T12:58:46.000Z",
    "title": "A Comprehensive Benchmark of Language Models on Unicode and Romanized Sinhala",
    "url": "https://arxiv.org/abs/2601.14958v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Minuri Rajapakse",
    "published_at": "2026-01-21T12:58:46.000Z",
    "summary_long": "The performance of Language Models (LMs) on lower-resource, morphologically rich languages like Sinhala remains under-explored, particularly for Romanized Sinhala, which is prevalent in digital communication. This paper presents a comprehensive benchmark of modern LMs on a diverse corpus of Unicode and Romanized Sinhala. We evaluate open-source models using perplexity, a measure of how well a model predicts a text, and leading closed-source models via a qualitative analysis of sentence completion. Our findings reveal that the Mistral-Nemo-Base-2407 model achieves the strongest predictive performance on Unicode text and the Mistral-7B-v0.3 model for Romanized text. Source: arxiv.org. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apple is reportedly overhauling siri to be an ai chatbot:2026-01-21T20:53:03.000Z",
    "title": "Apple is reportedly overhauling Siri to be an AI chatbot",
    "url": "https://www.engadget.com/ai/apple-is-reportedly-overhauling-siri-to-be-an-ai-chatbot-205303818.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-21T20:53:03.000Z",
    "summary_long": "Apple has been spinning its wheels for many months over its approach to artificial intelligence, but a strategy finally appears to be emerging for the company. Bloomberg's Mark Gurman reported today that Apple's long-awaited Siri overhaul will allegedly involve transforming the voice assistant into an AI chatbot, internally called Campos. Sources have reportedly told Gurman that Apple chatbot will completely replace the current Siri interface in favor of a more interactive model similar to those used by OpenAI's ChatGPT and Google's Gemini. He also cited sources who claimed that while Apple has been testing a standalone Campos app, the company doesn't plan to release it for customers. Source: www.engadget.com. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:microsoft ports the xbox app to armbased windows pcs:2026-01-21T19:10:49.000Z",
    "title": "Microsoft ports the Xbox app to Arm-based Windows PCs",
    "url": "https://www.engadget.com/gaming/pc/microsoft-ports-the-xbox-app-to-arm-based-windows-pcs-191049475.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2026-01-21T19:10:49.000Z",
    "summary_long": "Microsoft has announced that the Xbox app is now available on all Arm-based Windows 11 PCs. The app's release follows an update Microsoft made to its Prism emulator in December 2025, which translates x86 and x64 apps to Arm, and now includes support for AVX and AVX2. Both extensions play a role in making games run efficiently on Windows. Windows on Arm users will be able to use the Xbox app to purchase, download and stream PC games, and Microsoft says that \"more than 85 percent of the Game Pass catalog\" now runs on Arm PCs. Source: www.engadget.com. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas artemis ii rocket and spacecraft make their way to lau:2026-01-21T17:38:45.000Z",
    "title": "NASA’s Artemis II Rocket and Spacecraft Make Their Way to Launch Pad",
    "url": "https://www.nasa.gov/image-article/nasas-artemis-ii-rocket-and-spacecraft-make-their-way-to-launch-pad/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-01-21T17:38:45.000Z",
    "summary_long": "NASA/Sam Lott This Jan. 17, 2026, image shows NASA’s SLS (Space Launch System) and Orion spacecraft rolling out of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida. NASA’s massive Crawler-Transporter, upgraded for the Artemis program, carries the powerful SLS rocket and Orion spacecraft to Launch Pad 39B in preparation for the Artemis II mission. Moving at a maximum speed of just 0.82 mph, the crawler carried the towering Moon rocket and spacecraft slowly but surely toward the pad, reaching its destination at 6:42 p.m. Source: www.nasa.gov. Date: 2026-01-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]