[
  {
    "id": "bigtech:the 28 best labor day deals you still can grab for 100 or le:2025-09-01T20:17:05.000Z",
    "title": "The 28 best Labor Day deals you still can grab for $100 or less",
    "url": "https://www.theverge.com/tech/767824/best-labor-day-sales-cheap-tech-deals-under-100-2025",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Sheena Vasani",
    "published_at": "2025-09-01T20:17:05.000Z",
    "summary_long": "[https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/Anker-Laptop-Power-Bank-Retractable.jpg?quality=90&strip=all&crop=0,0,100,100] Labor Day has finally arrived, and after a week of early discounts trickling in, the sales are now in full swing. We’ve put together an expansive guide detailing nearly 100 deals we think are worth the money — including everything from big-screen OLED TVs to back-to-school essentials like the latest MacBook Air — but we also recognize that spending a couple a hundred dollars on a new gadget isn’t always feasible in these inflationary, tariff-riddled times. Fortunately for those on a budget, there are plenty of worthwhile deals to be had for $100 or less. To make sifting through them easier, we’ve rounded up a few of our favorites, including the latest Kindle, the entry-level AirPods 4, and Anker’s beefy Laptop Power Bank. We also pulled together a handful of excellent gaming deals, not to mention a steep discount on what has become our favorite budget video doorbell. ---------------------------------------- AIRPODS 4 Apple’s AirPods 4 are the latest update to…",
    "tags": []
  },
  {
    "id": "consumer:chinese social media platforms roll out labels for aigenerat:2025-09-01T19:48:03.000Z",
    "title": "Chinese social media platforms roll out labels for AI-generated material",
    "url": "https://www.engadget.com/ai/chinese-social-media-platforms-roll-out-labels-for-ai-generated-material-194803979.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2025-09-01T19:48:03.000Z",
    "summary_long": "Major social media platforms in China have started rolling out labels for AI-generated content to comply with a law that took effect on Monday. Users of the likes of WeChat, Douyin, Weibo and RedNote (aka Xiaohongshu) are now seeing such labels on posts. These denote the use of generative AI in text, images, audio, video and other types of material, according to the South China Morning Post. Identifiers such as watermarks have to be included in metadata too. WeChat has told users they must proactively apply labels to their AI-generated content. They're also prohibited from removing, tampering with or hiding any AI labels that WeChat applies itself, or to use \"AI to produce or spread false information, infringing content or any illegal activities.\" ByteDance's Douyin — the Chinese version of TikTok — similarly urged users to apply a label to every post of theirs that includes AI-generated material while noting it's able to use metadata to detect where a piece…",
    "tags": []
  },
  {
    "id": "bigtech:behind the scenes and frontrow access volunteer at techcrunc:2025-09-01T19:41:46.000Z",
    "title": "Behind the scenes and front-row access: Volunteer at TechCrunch Disrupt 2025 while you still can",
    "url": "https://techcrunch.com/2025/09/01/behind-the-scenes-and-front-row-access-volunteer-at-techcrunch-disrupt-2025-while-you-still-can/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "TechCrunch Events",
    "published_at": "2025-09-01T19:41:46.000Z",
    "summary_long": "With just over a month until TechCrunch Disrupt 2025 hits San Francisco, we’re calling on students, aspiring founders, marketers, and event pros to help the TechCrunch events team pull off one of the largest and most anticipated startup events of the year. With just over a month until TechCrunch Disrupt 2025 hits San Francisco, we’re calling on students, aspiring founders, marketers, and event pros to help the TechCrunch events team pull off one of the largest and most anticipated startup events of the year.. Why it matters: highlight the impact on technology, business, or society. Source: techcrunch.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01.",
    "tags": []
  },
  {
    "id": "nextfrontiers:three reports released supporting namibias green hydrogen am:2025-09-01T19:15:06.000Z",
    "title": "Three reports released supporting Namibia's green hydrogen ambitions",
    "url": "https://techxplore.com/news/2025-09-namibia-green-hydrogen-ambitions.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T19:15:06.000Z",
    "summary_long": "The GreeN-H2-Namibia project has published three new reports that together provide key insights for Namibia's emerging green economy. Covering topics from Power-to-X (PtX) technologies to regional water infrastructure, the reports address both technical and socio-economic challenges that decision-makers face in building a sustainable hydrogen sector. The GreeN-H2-Namibia project has published three new reports that together provide key insights for Namibia's emerging green economy. Covering topics from Power-to-X (PtX) technologies to regional water infrastructure, the reports address both technical and socio-economic challenges that decision-makers face in building a sustainable hydrogen sector.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01.",
    "tags": []
  },
  {
    "id": "nextfrontiers:snapthrough effect helps engineers solve soft material motio:2025-09-01T19:14:32.000Z",
    "title": "Snap-through effect helps engineers solve soft material motion trade-off",
    "url": "https://techxplore.com/news/2025-09-snap-effect-soft-material-motion.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T19:14:32.000Z",
    "summary_long": "Everyday occurrences like snapping hair clips or clicking retractable pens feature a mechanical phenomenon known as \"snap-through.\" Small insects and plants like the Venus flytrap cleverly use this snap-through effect to amplify their limited physical force, rapidly releasing stored elastic energy for swift, powerful movements. Everyday occurrences like snapping hair clips or clicking retractable pens feature a mechanical phenomenon known as \"snap-through.\" Small insects and plants like the Venus flytrap cleverly use this snap-through effect to amplify their limited physical force, rapidly releasing stored elastic energy for swift, powerful movements.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01.",
    "tags": []
  },
  {
    "id": "fintech:xrp price holds near 275 as analyst maps path between 240 ri:2025-09-01T17:57:37.000Z",
    "title": "XRP Price Holds Near $2.75 as Analyst Maps Path Between $2.40 Risk and $3.70 Upside",
    "url": "https://www.coindesk.com/markets/2025/09/01/xrp-price-holds-near-usd2-75-as-analyst-maps-path-between-usd2-40-risk-and-usd3-70-upside",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-09-01T17:57:37.000Z",
    "summary_long": "XRP hovered near $2.75 on Monday, down 2.38% over 24 hours, as traders weighed key support and resistance levels flagged by crypto analyst Ali Martinez. In a post on Aug. 31, Martinez stressed that XRP “must hold above $2.77” or risk falling toward $2.40. His chart illustrated a clear floor around $2.77 that had previously attracted buying interest. Breaking beneath that zone, he suggested, would take away the safety net and leave the token vulnerable to deeper losses. For non-technical readers, the message was straightforward: $2.77 represents the line where bulls need to show strength, and if they don’t, the next major level of support sits all the way down at $2.40. Chart marking XRP $2.77 support and $2.40 risk. [https://cdn.sanity.io/images/s3y3vcno/production/e0b2a03c24ffab5a17c7a6bced242bd94885a1f7-2352x1649.jpg?auto=format] In a post on Sept. 1, Martinez followed up with a more optimistic roadmap. His chart highlighted $2.70 as a crucial level to defend, a slightly lower support zone than before, and $2.90 as the barrier that XRP would…",
    "tags": []
  },
  {
    "id": "fintech:bnb slips below 860 as traders brace for us jobs data:2025-09-01T17:10:13.000Z",
    "title": "BNB Slips Below $860 as Traders Brace for U.S. Jobs Data",
    "url": "https://www.coindesk.com/markets/2025/09/01/bnb-slips-below-usd860-as-traders-brace-for-u-s-jobs-data",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-09-01T17:10:13.000Z",
    "summary_long": "The price of BNB saw sharp intraday swings over the past 24-hour period as it continued to drop from an all-time high of $900 seen late last month. Over a 24-hour window, the asset traded between $849.88 and $868.76, a 2% move that began with bullish momentum but ended with signs of fatigue near resistance. The volatility follows filings with the U.S. Securities and Exchange Commission by REX Shares late last month, along with the rise of BNB-focused treasury firms. The latest, B Strategy, aims to hold up to $1 billion worth of BNB with backing from the investment firm led by Binance co-founders Changpeng Zhao and Yi He. While BNB failed to hold on to its gains from earlier, underlying network activity surged. Daily active wallet addresses on BNB Chain more than doubled, climbing to near 2.5 million according to DeFiLlama data. Yet, transaction volumes have been dropping steadily since late June, data from the same source shows. BNB’s…",
    "tags": []
  },
  {
    "id": "consumer:the best noisecanceling earbuds for 2025:2025-09-01T19:00:35.000Z",
    "title": "The best noise-canceling earbuds for 2025",
    "url": "https://www.engadget.com/audio/headphones/best-noise-canceling-earbuds-150026857.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Billy Steele",
    "published_at": "2025-09-01T19:00:35.000Z",
    "summary_long": "Whether you're commuting, working in a bustling café or just trying to tune out the world, the best noise-canceling earbuds can help you focus on what matters — your music, podcasts or a bit of peace and quiet. With advanced noise reduction and features like active noise cancellation, these compact in-ear buds are designed to block out distractions and deliver immersive sound, even in the most noisy environments. Today’s top models offer everything from seamless Bluetooth connectivity and customizable ear tips to long-lasting batteries with a pocketable charging case — some even charge via USB-C and come with added perks like touch controls and water resistance. Whether you're a casual listener or a true audiophile, there’s a pair out there that fits your lifestyle and budget. TABLE OF CONTENTS * Best noise-cancelling earbuds for 2025 * How to choose the best noise-canceling earbuds for you * How we test noise-canceling earbuds BEST NOISE-CANCELLING EARBUDS FOR 2025 HOW TO CHOOSE THE…",
    "tags": []
  },
  {
    "id": "bigtech:the 95 best labor day sales happening now:2025-09-01T18:47:36.000Z",
    "title": "The 95 best Labor Day sales happening now",
    "url": "https://www.theverge.com/tech/756227/best-labor-day-sales-deals-2025",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Brandt Ranj",
    "published_at": "2025-09-01T18:47:36.000Z",
    "summary_long": "[https://platform.theverge.com/wp-content/uploads/sites/2/2025/08/257912_labor_day_deals__CVirginia.jpg?quality=90&strip=all&crop=0,0,100,100] Labor Day marks the unofficial end of summer, and while the prospect of cooler weather and shorter days can be a tough adjustment for some, at least there is always a great selection of deals to combat the post-summer blues. Lucky for you, we’ve gone ahead and rounded up the best discounts you can get on a variety of Verge-approved gadgets and goods, from earbuds and 4K TVs to the latest e-readers. Being that it’s now September, it’s also a good reminder that the holidays will be here before you know it. Thankfully, some gadgets — including the latest Kindle Colorsoft, the M4 MacBook Air 13, and Sony’s WH-CH520 headphones — have fallen to their lowest price to date, making now an excellent time to get a head start on your holiday shopping. After all, there’s no guarantee they’ll drop lower in price, even when Black Friday and Cyber Monday roll around. 1. Speaker deals 2. Headphone and earbuds…",
    "tags": []
  },
  {
    "id": "nextfrontiers:scientists develop the worlds first 6g chip capable of 100 g:2025-09-01T17:30:43.000Z",
    "title": "Scientists develop the world's first 6G chip, capable of 100 Gbps speeds",
    "url": "https://techxplore.com/news/2025-09-scientists-world-6g-chip-capable.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T17:30:43.000Z",
    "summary_long": "Sixth generation, or 6G, wireless technology is one step closer to reality with news that Chinese researchers have unveiled the world's first \"all-frequency\" 6G chip. The chip is capable of delivering mobile internet speeds exceeding 100 gigabits per second (Gbps) and was developed by a team led by scientists from Peking University and the City University of Hong Kong. Sixth generation, or 6G, wireless technology is one step closer to reality with news that Chinese researchers have unveiled the world's first \"all-frequency\" 6G chip. The chip is capable of delivering mobile internet speeds exceeding 100 gigabits per second (Gbps) and was developed by a team led by scientists from Peking University and the City University of Hong Kong.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch.…",
    "tags": []
  },
  {
    "id": "nextfrontiers:humanoid robots showcase skills at ancient olympia but theyr:2025-09-01T17:30:25.000Z",
    "title": "Humanoid robots showcase skills at Ancient Olympia. But they're on a long road to catch up to AI",
    "url": "https://techxplore.com/news/2025-09-humanoid-robots-showcase-skills-ancient.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T17:30:25.000Z",
    "summary_long": "With jerky determination, robots played soccer, wowed children with shadow-boxing skills and shot arrows on Monday at the birthplace of the Olympic Games. With jerky determination, robots played soccer, wowed children with shadow-boxing skills and shot arrows on Monday at the birthplace of the Olympic Games.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "consumer:apples mls season pass drops to as low as 25 for the rest of:2025-09-01T17:08:56.000Z",
    "title": "Apple's MLS Season Pass drops to as low as $25 for the rest of 2025",
    "url": "https://www.engadget.com/entertainment/streaming/apples-mls-season-pass-drops-to-as-low-as-25-for-the-rest-of-2025-170855008.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2025-09-01T17:08:56.000Z",
    "summary_long": "The end of any sports season is usually the most exciting part, and MLS fans can watch the climax of the 2025 campaign for a discount. As it has done each year around this time since it locked up the rights to the top North American soccer league, Apple is offering the MLS Season Pass at a discount for the remainder of the season. Apple TV+ subscribers can get access for $25, while everyone else can snag the season pass for $29. This is just the latest MLS Season Pass price cut of 2025, as Apple slashed it in half to $49 in July. However, it's not quite as great a deal as latecomers got on the pass last year. Apple's end-of-season discount for 2024 saw the season pass drop to just $10 in early September. We're now well over halfway through the 2025 season. Teams have between five and nine games of the regular season left to play. Inter…",
    "tags": []
  },
  {
    "id": "nextfrontiers:over 16000 compromised servers uncovered using secure shell :2025-09-01T16:37:04.000Z",
    "title": "Over 16,000 compromised servers uncovered using Secure Shell key probing method",
    "url": "https://techxplore.com/news/2025-09-compromised-servers-uncovered-shell-key.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T16:37:04.000Z",
    "summary_long": "An international research team from the Max Planck Institute (MPI) for Informatics in Saarbrücken, Germany, and the Delft University of Technology in the Netherlands has developed a method to detect compromised hosts at an internet scale by probing servers with public SSH keys previously observed in attacker operations. An international research team from the Max Planck Institute (MPI) for Informatics in Saarbrücken, Germany, and the Delft University of Technology in the Netherlands has developed a method to detect compromised hosts at an internet scale by probing servers with public SSH keys previously observed in attacker operations.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01.",
    "tags": []
  },
  {
    "id": "fintech:xlm plunges 5 in wild trading session before staging sharp r:2025-09-01T16:27:22.000Z",
    "title": "XLM Plunges 5% in Wild Trading Session Before Staging Sharp Recovery",
    "url": "https://www.coindesk.com/markets/2025/09/01/xlm-plunges-5-in-wild-trading-session-before-staging-sharp-recovery",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-09-01T16:27:22.000Z",
    "summary_long": "Stellar’s native token XLM endured heavy selling pressure over the past 24 hours, trading in a tight but punishing 5% range between $0.34 and $0.36. The session began with relative stability before a late-evening selloff knocked the token from its $0.36 peak to $0.34. Trading volume surged past 57 million units at midnight as the market tested support around the $0.34–$0.35 zone. Buyers stepped back in early the next morning, briefly lifting XLM back to $0.36 on the back of what appeared to be institutional accumulation, with volumes swelling to 70 million units. Despite the recovery, price action stalled around $0.36, creating a range-bound structure that technical traders say often precedes a directional breakout. The final hour of trading on Sept. 1 showed bearish momentum regaining control, with XLM slipping 1% as the consolidation pattern broke down. Intraday data highlighted an acceleration of selling pressure between 13:45 and 13:46, when more than 1.28 million tokens changed hands at the day’s…",
    "tags": []
  },
  {
    "id": "fintech:hbar shares drop 4 as institutional selling intensifies:2025-09-01T16:16:25.000Z",
    "title": "HBAR Shares Drop 4% as Institutional Selling Intensifies",
    "url": "https://www.coindesk.com/markets/2025/09/01/hbar-shares-drop-4-as-institutional-selling-intensifies",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-09-01T16:16:25.000Z",
    "summary_long": "Hedera’s HBAR token faced renewed selling pressure as institutional investors trimmed exposure, pushing the asset down about 4% between Aug. 31 and Sept. 1. Trading activity was concentrated around the $0.22 mark, with intraday swings ranging from $0.23 highs to $0.22 lows. The heaviest selling emerged during after-hours, when more than 110 million tokens exchanged hands, underscoring signs of coordinated divestment. Market makers sought to stabilize the price in the $0.21–$0.22 range, but resistance hardened just above $0.22, capping any meaningful recovery. Despite the downturn, Hedera continues to position itself as a platform for enterprise adoption. Daily trading volume fell 46% to $172.85 million while the network maintained a market capitalization near $9.5 billion. Selling pressure accelerated into the final hour of Sept. 1 trading, when HBAR briefly breached multiple support levels. Roughly 3.5 million tokens changed hands in a single minute as the token slid below its $0.22 resistance, closing the session near its lows. With sellers maintaining control…",
    "tags": []
  },
  {
    "id": "consumer:masterclass labor day sale get 50 percent off subscriptions:2025-09-01T16:01:26.000Z",
    "title": "MasterClass Labor Day sale: Get 50 percent off subscriptions",
    "url": "https://www.engadget.com/deals/masterclass-labor-day-sale-get-50-percent-off-subscriptions-133223226.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-09-01T16:01:26.000Z",
    "summary_long": "MasterClass promises online learning with instructors who are the very best in their fields, and an annual subscription is currently 50 percent off across all tiers. Subscribers to MasterClass will have access to over 200 classes taught by iconic authors, chefs, athletes and leaders representing a diverse collection of skill sets and backgrounds. With a subscription, you could watch a class on writing taught by James Patterson, or learn cooking techniques from Thomas Keller. If you're trying to impress at your next pickup basketball game you could learn about shooting, ball-handling and scoring from Steph Curry. Each class includes around 20 video lessons that run about 10 minutes long on average, as well as an in-depth workbook. MasterClass has also begun producing some original series for its platform. The series Business Rebels features different CEOs walking viewers through the strategies that helped them disrupt their industries. One entitled Skin Health features top dermatologists and a cosmetic chemist walking viewers through…",
    "tags": []
  },
  {
    "id": "nextfrontiers:styrofoambased hydrogen storage new process offers safe reus:2025-09-01T15:56:03.000Z",
    "title": "Styrofoam-based hydrogen storage: New process offers safe, reusable solution",
    "url": "https://techxplore.com/news/2025-09-styrofoam-based-hydrogen-storage-safe.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-01T15:56:03.000Z",
    "summary_long": "A research team affiliated with UNIST has unveiled a novel technology that enables hydrogen to be stored within polystyrene-derived materials, particularly those originating from Styrofoam. The research is published in the journal ACS Catalysis. A research team affiliated with UNIST has unveiled a novel technology that enables hydrogen to be stored within polystyrene-derived materials, particularly those originating from Styrofoam. The research is published in the journal ACS Catalysis.. Why it matters: highlight the impact on technology, business, or society. Source: techxplore.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-01. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "fintech:polygon leads crypto gains with 16 weekend surge as coindesk:2025-09-01T15:52:43.000Z",
    "title": "Polygon Leads Crypto Gains With 16% Weekend Surge as CoinDesk 20 Index Holds Steady",
    "url": "https://www.coindesk.com/markets/2025/09/01/polygon-leads-crypto-gains-with-16-surge-as-coindesk-20-index-holds-steady",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-09-01T15:52:43.000Z",
    "summary_long": "The native token of Polygon (POL), an Ethereum scaling network, led gains through the weekend in the broad-market crypto benchmark CoinDesk 20 Index (CD20). POL surged 16% from Friday through early Monday, topping $0.29 for the first time since early March, CoinDesk data shows. Recently, it pared back some of the advance slipping below $0.28. The move happened as the CD20 remained little changed with bitcoin (BTC) and Ethereum's ether (ETH) posting only modest gains. CoinDesk 20 performance Aug. 29 - Sep. 1 (CoinDesk Indices) [https://cdn.sanity.io/images/s3y3vcno/production/87c33d34ab3781feb222e8ad87ddb9c472851c39-800x800.png?auto=format] While there wasn't any clear catalyst behind POL's surge, some positive developments may have bolstered the token's performance. Polygon was one of the chains mentioned last week in the U.S. government's initiative to release key economic data such as GDP on blockchain rails. The network also announced an integration last week with USDT0, a Tether-focused cross-chain stablecoin protocol, that could help boost the network's position as a key liquidity hub for stablecoin flows. On…",
    "tags": []
  }
]