[
  {
    "id": "bigtech:via raises 4929m in ipo and german automakers go on the offe:2025-09-14T16:05:00.000Z",
    "title": "Via raises $492.9M in IPO, and German automakers go on the offensive",
    "url": "https://techcrunch.com/2025/09/14/via-raises-492-9m-in-ipo-and-german-automakers-go-on-the-offensive/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Kirsten Korosec",
    "published_at": "2025-09-14T16:05:00.000Z",
    "summary_long": "Via raises $492.9M in IPO, and German automakers go on the offensive Source: techcrunch.com. Date: 2025-09-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch new improved northrop grumman:2025-09-14T13:00:19.000Z",
    "title": "Live coverage: SpaceX to launch new, improved Northrop Grumman Cygnus XL resupply ship to the space station",
    "url": "https://spaceflightnow.com/2025/09/14/live-coverage-spacex-to-launch-new-improved-northrop-grumman-cygnus-xl-resupply-ship-to-the-space-station/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-09-14T13:00:19.000Z",
    "summary_long": "The next cargo resupply mission to the International Space Station is launching Sunday and will feature a new iteration of the Cygnus spacecraft from Northrop Grumman. The mission, NASA’s NG-23, is the latest flight fulfilling NASA’s Commercial Resupply Services-2 contract with Northrop Grumman. The Cygnus XL spacecraft making its debut is capable of carrying 33 percent more cargo than the previous version of the Cygnus vehicle. SpaceX is scheduled to launch the cargo craft atop a Falcon 9 rocket from pad 40 at Cape Canaveral Space Force Station at 6:11 a.m. Source: spaceflightnow.com. Date: 2025-09-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:feds sept 17 rate cut could spark shortterm jitters but supe:2025-09-13T18:36:20.000Z",
    "title": "Fed’s Sept. 17 Rate Cut Could Spark Short-Term Jitters but Supercharge Bitcoin, Gold and Stocks Long Term",
    "url": "https://www.coindesk.com/markets/2025/09/13/fed-s-sept-17-rate-cut-could-spark-short-term-jitters-but-supercharge-bitcoin-gold-and-stocks-long-term",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-09-13T18:36:20.000Z",
    "summary_long": "Investors are counting down to the Federal Reserve’s Sept. 17 monetary policy decision; markets expect a quarter-point rate cut that could trigger short-term volatility but potentially fuel longer-term gains across risk assets. The economic backdrop highlights the Fed’s delicate balancing act. According to the latest CPI report released by the U.S. Source: www.coindesk.com. Date: 2025-09-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:in silksong spite is my motivation to keep playing:2025-09-14T13:00:00.000Z",
    "title": "In Silksong, spite is my motivation to keep playing",
    "url": "https://www.theverge.com/games/777653/silksong-impressions-team-cherry-metroidvania-sherma-is-cool",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Ash Parrish",
    "published_at": "2025-09-14T13:00:00.000Z",
    "summary_long": "I would not call the time I'm having with Hollow Knight: Silksong \"fun,\" and yet I'm still playing. In the depths of The Marrow, the second major area of Silksong, there's a particularly nasty midboss. I eventually beat him, but my reward wasn't a new ability, item, or a bench where I could rest and save my progress. All I got was pain, suffering, and death. Source: www.theverge.com. Date: 2025-09-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:phone batteries are getting more compact but the us is missi:2025-09-14T12:00:00.000Z",
    "title": "Phone batteries are getting more compact, but the US is missing out",
    "url": "https://www.theverge.com/the-stepback-newsletter/776517/silicon-carbon-batteries-phones",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Dominic Preston",
    "published_at": "2025-09-14T12:00:00.000Z",
    "summary_long": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on phones and other tech outside the US, follow Dominic Preston. Opt in for The Stepback here. HOW IT STARTED Smartphone batteries are bigger than ever, while the phones themselves are shrinking. Source: www.theverge.com. Date: 2025-09-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:ai mining news gpu gold rush why bitcoin miners are powering:2025-09-14T09:00:00.000Z",
    "title": "AI, Mining News: GPU Gold Rush: Why Bitcoin Miners Are Powering AI’s Expansion",
    "url": "https://www.coindesk.com/markets/2025/09/14/ai-mining-news-gpu-gold-rush-why-bitcoin-miners-are-powering-ai-s-expansion",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "James Van Straten",
    "published_at": "2025-09-14T09:00:00.000Z",
    "summary_long": "When Core Scientific signed a $3.5 billion deal to host artificial intelligence (AI) data centers earlier this year, it wasn’t chasing the next crypto token — it was chasing a steadier paycheck. Once known for its vast fleets of bitcoin mining rigs, the company is now part of a growing trend: converting energy-intensive mining operations into high-performance AI facilities. Bitcoin miners like Core, Hut 8 (HUT) and TeraWulf (WULF) are swapping ASIC machines — the dedicated bitcoin mining computer — for GPU clusters, driven by the lure of AI’s explosive growth and the harsh economics of crypto mining. POWER PLAY It's no secret that bitcoin mining requires an extensive amount of energy, which is the biggest cost of minting a new digital asset. Source: www.coindesk.com. Date: 2025-09-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:your company probably doesnt need its own l2:2025-09-13T18:00:00.000Z",
    "title": "Your Company Probably Doesn’t Need Its Own L2",
    "url": "https://www.coindesk.com/opinion/2025/09/09/your-company-probably-doesn-t-need-its-own-l2",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Paul Brody",
    "published_at": "2025-09-13T18:00:00.000Z",
    "summary_long": "More and more companies are attracted to the idea of launching their own Ethereum layer 2 network. Most of them shouldn’t bother. There’s already a staggering number of them — over 150. Quite a few of these are centralized and linked to a single enterprise and several companies such as Robinhood have recently announced plans to launch their own layer 2 networks. Source: www.coindesk.com. Date: 2025-09-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:the motif hand a tool advancing the capabilities of previous:2025-09-14T14:20:01.000Z",
    "title": "The MOTIF Hand: A tool advancing the capabilities of previous robot hand technology",
    "url": "https://techxplore.com/news/2025-09-motif-tool-advancing-capabilities-previous.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-14T14:20:01.000Z",
    "summary_long": "The MOTIF Hand: A tool advancing the capabilities of previous robot hand technology Source: techxplore.com. Date: 2025-09-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:roblox hit with wrongful death lawsuit following a teen play:2025-09-13T20:15:01.000Z",
    "title": "Roblox hit with wrongful death lawsuit following a teen player's suicide",
    "url": "https://www.engadget.com/gaming/roblox-hit-with-wrongful-death-lawsuit-following-a-teen-players-suicide-201501296.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-09-13T20:15:01.000Z",
    "summary_long": "Following her son's suicide, Becca Dallas filed a potentially groundbreaking lawsuit against Roblox and Discord, accusing the platforms of wrongful death. As first reported by The New York Times, the lawsuit recounts the events leading up to Ethan Dallas' death, detailing his interactions with a player named Nate. According to the report, Nate was likely a 37-year-old man named Timothy O'Connor, who was previously arrested on charges of \"possessing child pornography and transmitting harmful material to minors.\" The report added that Ethan opened up about these incidents to his mom before committing suicide four months after the confession. The lawsuit could be the first of its kind against Roblox, according to NYTimes, considering it attributes some blame to the gaming platform that's home to tens of millions of underaged players. Source: www.engadget.com. Date: 2025-09-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:kodaks mini camera fits on your keyring and is smaller than :2025-09-13T18:42:27.000Z",
    "title": "Kodak's mini camera fits on your keyring and is smaller than an AirPods case",
    "url": "https://www.engadget.com/cameras/kodaks-mini-camera-fits-on-your-keyring-and-is-smaller-than-an-airpods-case-184227505.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-09-13T18:42:27.000Z",
    "summary_long": "Kodak has shrunk a camera to fit onto a keyring, but it still manages to shoot both photo and video. It's hard not to compare the Kodak Charmera to the ubiquitous Labubu craze, considering the highly collectible nature of Reto Pro selling these officially licensed mini cameras as a single blind box for $29.99 or a full set of six for $179.94. The keyring cameras, which only weigh 30 grams, are already sold out on the Reto Pro website, but are expected to be restocked. The blind box can be unwrapped for one of seven designs, including one secret version that has a transparent shell to show off the tiny camera's internals. Source: www.engadget.com. Date: 2025-09-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:californias age verification bill for app stores and operati:2025-09-13T21:43:39.000Z",
    "title": "California's age verification bill for app stores and operating systems takes another step forward",
    "url": "https://www.engadget.com/big-tech/californias-age-verification-bill-for-app-stores-and-operating-systems-takes-another-step-forward-214339759.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Cheyenne MacDonald",
    "published_at": "2025-09-13T21:43:39.000Z",
    "summary_long": "A California bill that would require operating system and app store providers to verify users' ages before they can download apps has cleared the Assembly 58-0, and will now move on to Gov. Gavin Newsom, Politico reports. The Digital Age Assurance Act (AB 1043), introduced by Assemblymember Buffy Wicks, does not require photo identification for verification, but puts the onus on the platforms to provide tools for parents to indicate the user's age during a device's setup, and use this information steer kids toward age-appropriate content and screen time. It comes after Utah and Texas both adopted app store age verification laws earlier this year that have been criticized as posing potential privacy risks, and faced opposition from the likes of Google and Apple. Source: www.engadget.com. Date: 2025-09-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:upcoming speaking engagements:2025-09-14T16:02:45.000Z",
    "title": "Upcoming Speaking Engagements",
    "url": "https://www.schneier.com/blog/archives/2025/09/upcoming-speaking-engagements-48.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "B. Schneier",
    "published_at": "2025-09-14T16:02:45.000Z",
    "summary_long": "This is a current list of where and when I am scheduled to speak: * I’m speaking and signing books at the Cambridge Public Library on October 22, 2025 at 6 PM ET. The event is sponsored by Harvard Bookstore. * I’m giving a virtual talk about my book Rewiring Democracy at 1 PM ET on October 23, 2025. The event is hosted by Data & Society. Source: www.schneier.com. Date: 2025-09-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]