[
  {
    "id": "bigtech:openai desperate to avoid explaining why it deleted pirated :2025-12-01T22:16:28.000Z",
    "title": "OpenAI desperate to avoid explaining why it deleted pirated book datasets",
    "url": "https://arstechnica.com/tech-policy/2025/12/openai-desperate-to-avoid-explaining-why-it-deleted-pirated-book-datasets/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-12-01T22:16:28.000Z",
    "summary_long": "OpenAI may soon be forced to explain why it deleted a pair of controversial datasets composed of pirated books, and the stakes could not be higher. At the heart of a class-action lawsuit from authors alleging that ChatGPT was illegally trained on their works, OpenAI’s decision to delete the datasets could end up being a deciding factor that gives the authors the win. It’s undisputed that OpenAI deleted the datasets, known as “Books 1” and “Books 2,” prior to ChatGPT’s release in 2022. Created by former OpenAI employees in 2021, the datasets were built by scraping the open web and seizing the bulk of its data from a shadow library called Library Genesis (LibGen). Source: arstechnica.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:supreme court hears case that could trigger big crackdown on:2025-12-01T22:33:25.000Z",
    "title": "Supreme Court hears case that could trigger big crackdown on Internet piracy",
    "url": "https://arstechnica.com/tech-policy/2025/12/supreme-court-debates-whether-isps-must-kick-pirates-off-the-internet/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-12-01T22:33:25.000Z",
    "summary_long": "Supreme Court justices expressed numerous concerns today in a case that could determine whether Internet service providers must terminate the accounts of broadband users accused of copyright infringement. Oral arguments were held in the case between cable Internet provider Cox Communications and record labels led by Sony. Some justices were skeptical of arguments that ISPs should have no legal obligation under the Digital Millennium Copyright Act (DMCA) to terminate an account when a user’s IP address has been repeatedly flagged for downloading pirated music. But justices also seemed hesitant to rule in favor of record labels, with some of the debate focusing on how ISPs should handle large accounts like universities where there could be tens of thousands of users. Source: arstechnica.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:the missile meant to strike fear in russias enemies fails on:2025-12-01T23:36:50.000Z",
    "title": "The missile meant to strike fear in Russia’s enemies fails once again",
    "url": "https://arstechnica.com/space/2025/12/the-missile-meant-to-strike-fear-in-russias-enemies-fails-once-again/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-12-01T23:36:50.000Z",
    "summary_long": "A Russian intercontinental ballistic missile (ICBM) fired from an underground silo on the country’s southern steppe Friday on a scheduled test to deliver a dummy warhead to a remote impact zone nearly 4,000 miles away. The missile didn’t even make it 4,000 feet. Russia’s military has been silent on the accident, but the missile’s crash was seen and heard for miles around the Dombarovsky air base in Orenburg Oblast near the Russian-Kazakh border. A video posted by the Russian blog site MilitaryRussia.ru on Telegram and widely shared on other social media platforms showed the missile veering off course immediately after launch before cartwheeling upside down, losing power, and then crashing a short distance from the launch site. Source: arstechnica.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:funding grants for new research into ai and mental health:2025-12-01T12:00:00.000Z",
    "title": "Funding grants for new research into AI and mental health",
    "url": "https://openai.com/index/ai-mental-health-research-grants",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2025-12-01T12:00:00.000Z",
    "summary_long": "Funding grants for new research into AI and mental health Source: openai.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:india will require a stateowned cybersecurity app to be inst:2025-12-01T19:23:05.000Z",
    "title": "India will require a state-owned cybersecurity app to be installed on all smartphones",
    "url": "https://www.engadget.com/cybersecurity/india-will-require-a-state-owned-cybersecurity-app-to-be-installed-on-all-smartphones-192305599.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-12-01T19:23:05.000Z",
    "summary_long": "Telecom regulators in India have reportedly asked smartphone manufacturers to preload a state-owned cybersecurity app that cannot be deleted onto all new devices, and push the app to existing devices via a software update. Reuters reports that, according to a non-public government order sent to manufacturers, Apple, Samsung, Xiaomi and others were given 90 days to comply. The app in question is called Sanchar Saathi (meaning Communication Companion), and is primarily aimed at fraud prevention with tools that allow users to report and lock lost or stolen devices. According to Reuters, the app has a reported 5 million downloads since its release and has helped block 3.7 million stolen or lost phones in India. Source: www.engadget.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:crypto hacks price drops often outweigh direct losses:2025-12-01T22:01:20.000Z",
    "title": "Crypto hacks: Price drops often outweigh direct losses",
    "url": "https://techxplore.com/news/2025-12-crypto-hacks-price-outweigh-losses.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-01T22:01:20.000Z",
    "summary_long": "In the crypto world, reports of cyberattacks tend to focus mainly on the funds that vanish immediately. A new study by researchers at the Complexity Science Hub (CSH) now shows that the indirect consequences—such as falling token prices and eroding trust—can multiply the financial impact of such attacks, with investors bearing the brunt. The work is published in The Journal of Finance and Data Science. Source: techxplore.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:arianespace launches south korean earth observation satellit:2025-12-02T04:02:48.000Z",
    "title": "Arianespace launches South Korean Earth observation satellite on Vega-C flight",
    "url": "https://spaceflightnow.com/2025/12/02/arianespace-launches-south-korean-earth-observation-satellite-on-vega-c-flight/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-12-02T04:02:48.000Z",
    "summary_long": "South Korea’s latest Earth observation satellite was delivered into a Sun-synchronous orbit Monday afternoon following a launch onboard a Vega-C rocket by Arianespace. The KOrea Multi-Purpose SATellite-7 (KOMPSAT-7) mission launched from Europe’s Spaceport. The 35-meter-tall (115 ft) rocket zipped away from the pad under the power of a P120C solid rocket motor. About 44 minutes after liftoff, the KOMPSAT-7 satellite was deployed into SSO an altitude of 576 km. Source: spaceflightnow.com. Date: 2025-12-02. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:texas ag opens probe into shein:2025-12-02T00:08:12.000Z",
    "title": "Texas AG opens probe into Shein",
    "url": "https://www.engadget.com/big-tech/texas-ag-opens-probe-into-shein-000812688.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2025-12-02T00:08:12.000Z",
    "summary_long": "Texas Attorney General Ken Paxton has opened an investigation into online fast fashion retailer Shein. The probe will examine whether the company violated state laws related to labor practices and product safety. According to a release, Paxton's office wants to know if Shein uses toxic or hazardous materials and whether it misleads consumers about product safety and ethical sourcing. The Texas investigation will also look into privacy concerns and data collection at Shein, which isn't the first time those topics have arisen for the business. Source: www.engadget.com. Date: 2025-12-02. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:kalshi launches tokenized event bets on solana blockchain cn:2025-12-01T20:25:50.000Z",
    "title": "Kalshi Launches Tokenized Event Bets on Solana Blockchain: CNBC",
    "url": "https://www.coindesk.com/business/2025/12/01/kalshi-launches-tokenized-event-bets-on-solana-blockchain-cnbc",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-12-01T20:25:50.000Z",
    "summary_long": "Kalshi Launches Tokenized Event Bets on Solana Blockchain: CNBC Source: www.coindesk.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch 60th falcon 9 rocket from van:2025-12-01T20:06:23.000Z",
    "title": "Live coverage: SpaceX to launch 60th Falcon 9 rocket from Vandenberg SFB in 2025",
    "url": "https://spaceflightnow.com/2025/12/01/live-coverage-spacex-to-launch-60th-falcon-9-rocket-from-vandenberg-sfb-in-2025/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-12-01T20:06:23.000Z",
    "summary_long": "SpaceX aims to launch its 60th Falcon 9 rocket of the year from Vandenberg Space Force Base on Monday evening. The Starlink 15-10 mission is set to add another 27 broadband internet satellites to the company’s massive low Earth orbit constellation. By the end of November, it had launched more than 2,800 Starlink satellites this year alone. SpaceX is targeting liftoff from Space Launch Complex 4 East at 9:28 p.m. Source: spaceflightnow.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:sagittarius b2 molecular cloud:2025-12-01T17:44:24.000Z",
    "title": "Sagittarius B2 Molecular Cloud",
    "url": "https://www.nasa.gov/image-article/sagittarius-b2-molecular-cloud/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2025-12-01T17:44:24.000Z",
    "summary_long": "NASA, ESA, CSA, STScI, Adam Ginsburg (University of Florida), Nazar Budaiev (University of Florida), Taehwa Yoo (University of Florida); Image Processing: Alyssa Pagan (STScI) The Mid-Infrared Instrument (MIRI) on NASA’s James Webb Space Telescope captured glowing cosmic dust heated by very young massive stars in unprecedented detail in this image of the Sagittarius B2 (Sgr B2) molecular cloud released on Sept. 24, 2025. Sgr B2 is the most massive, and active star-forming region in our galaxy, located only a few hundred light years from our central supermassive black hole. While Sgr B2 has only 10% of the galactic center’s gas, it produces 50% of its stars. Source: www.nasa.gov. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:chainlinks link slides 11 as technical breakdown overshadows:2025-12-01T16:59:39.000Z",
    "title": "Chainlink's LINK Slides 11% as Technical Breakdown Overshadows ETF Launch News",
    "url": "https://www.coindesk.com/markets/2025/12/01/chainlink-s-link-slides-11-as-technical-breakdown-overshadows-etf-launch-news",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-12-01T16:59:39.000Z",
    "summary_long": "Chainlink's LINK Slides 11% as Technical Breakdown Overshadows ETF Launch News Source: www.coindesk.com. Date: 2025-12-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]