[
  {
    "id": "bigtech:ai starts autonomously writing prescription refills in utah:2026-01-07T22:20:08.000Z",
    "title": "AI starts autonomously writing prescription refills in Utah",
    "url": "https://arstechnica.com/health/2026/01/utah-allows-ai-to-autonomously-prescribe-medication-refills/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2026-01-07T22:20:08.000Z",
    "summary_long": "The state of Utah is allowing artificial intelligence to prescribe medication refills to patients without direct human oversight in a pilot program public advocates call \"dangerous.\" The program is through the state's \"regulatory sandbox\" framework, which allows businesses to trial \"innovative\" products or services with state regulations temporarily waived. The Utah Department of Commerce partnered with Doctronic, a telehealth startup with an AI chatbot. Doctronic offers a nationwide service that allows patients to chat with its \"AI doctor\" for free, then, for $39, book a virtual appointment with a real doctor licensed in their state. But patients must go through the AI chatbot first to get an appointment. Source: arstechnica.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:bose opensources its soundtouch home theater smart speakers :2026-01-07T18:51:37.000Z",
    "title": "Bose open-sources its SoundTouch home theater smart speakers ahead of end-of-life",
    "url": "https://arstechnica.com/gadgets/2026/01/bose-open-sources-its-soundtouch-home-theater-smart-speakers-ahead-of-eol/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Scharon Harding\n                ",
    "published_at": "2026-01-07T18:51:37.000Z",
    "summary_long": "Bose released the Application Programming Interface (API) documentation for its SoundTouch speakers today, putting a silver lining around the impending end-of-life (EoL) of the expensive home theater devices. In October, Bose announced that its SoundTouch Wi-Fi speakers and soundbars would become dumb speakers on February 18. At the time, Bose said that the speakers would only work if a device was connected via AUX, HDMI, or Bluetooth (which has higher latency than Wi-Fi). After that date, the speakers would stop receiving security and software updates and lose cloud connectivity and their companion app, the Framingham, Massachusetts-based company said. Source: arstechnica.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:expired certificate completely breaks macos logitech apps us:2026-01-07T18:15:27.000Z",
    "title": "Expired certificate completely breaks macOS Logitech apps, user customizations",
    "url": "https://arstechnica.com/gadgets/2026/01/expired-certificate-completely-breaks-macos-logitech-apps-user-customizations/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-01-07T18:15:27.000Z",
    "summary_long": "If you're a Mac user with Logitech accessories and you've noticed that your settings and customizations seem to have gone away this week, you're not alone. The company's Logi Options+ and G Hub apps for macOS abruptly stopped functioning on Monday, refusing to launch and reverting all accessories' settings to their built-in defaults. The culprit, according to both a Logitech support page and Reddit posts from Logitech Head of Global Marketing Joe Santucci, was a security certificate that was inadvertently allowed to expire, rendering both apps non-functional. Read full article Comments Source: arstechnica.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:babylon labs raises 15 million from a16z crypto to develop b:2026-01-07T13:43:09.000Z",
    "title": "Babylon Labs raises $15 million from a16z crypto to develop Bitcoin collateral infrastructure",
    "url": "https://www.coindesk.com/business/2026/01/07/babylon-labs-raises-usd15-million-from-a16z-crypto-to-develop-bitcoin-collateral-infrastructure",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2026-01-07T13:43:09.000Z",
    "summary_long": "Babylon Labs raises $15 million from a16z crypto to develop Bitcoin collateral infrastructure Source: www.coindesk.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:bluettis charger 2 uses solar and engine power to charge you:2026-01-07T23:00:00.000Z",
    "title": "Bluetti's Charger 2 uses solar and engine power to charge your portable battery",
    "url": "https://www.engadget.com/general/bluettis-charger-2-uses-solar-and-engine-power-to-charge-your-portable-battery-230000270.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Daniel Cooper",
    "published_at": "2026-01-07T23:00:00.000Z",
    "summary_long": "If you’re off-roading, it’s a neat idea to use your engine to top up your battery, which prompted Bluetti to launch the Charger. You could hook it to your alternator and draw off energy as you drove to make sure you turned up to your campsite with full batteries. But if you’re also toting around solar panels on your roof, then it’s a shame you can’t also use that power to top up. This omission is what prompted Bluetti to turn up to CES 2026 with the Charger 2, which will take power from your engine and your solar panels at the same time. Source: www.engadget.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:this haptic wristband pairs with meta smart glasses to decod:2026-01-07T21:43:05.000Z",
    "title": "This haptic wristband pairs with Meta smart glasses to decode facial expressions",
    "url": "https://www.engadget.com/wearables/this-haptic-wristband-pairs-with-meta-smart-glasses-to-decode-facial-expressions-214305431.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Karissa Bell",
    "published_at": "2026-01-07T21:43:05.000Z",
    "summary_long": "It's only been a few months since Meta announced that it would open its smart glasses platform to third-party developers. But one startup at CES is already showing off how the glasses can help power an intriguing set of accessibility features. Hapware has created Aleye, a haptic wristband that, when paired with Ray-Ban Meta smart glasses, can help people understand the facial expressions and other nonverbal cues of the people they are talking to. The company says the device could help people who are blind, low vision or neurodivergent unlock a type of communication that otherwise wouldn't be available. Source: www.engadget.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:grasshopper wings inspire gliding robot design:2026-01-07T21:10:01.000Z",
    "title": "Grasshopper wings inspire gliding robot design",
    "url": "https://techxplore.com/news/2026-01-grasshopper-wings-gliding-robot.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-07T21:10:01.000Z",
    "summary_long": "A collaboration between Princeton University engineers and entomologists at the University of Illinois Urbana-Champaign began with the researchers chasing grasshoppers in a hot parking lot. Their eventual focus on the hindwings of one species of grasshopper, Schistocerca americana, the American grasshopper, is inspiring a new approach to untethered gliding flight. Source: techxplore.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:chatgpt is launching a new dedicated health portal:2026-01-07T21:01:50.000Z",
    "title": "ChatGPT is launching a new dedicated Health portal",
    "url": "https://www.engadget.com/ai/chatgpt-is-launching-a-new-dedicated-health-portal-210150083.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-07T21:01:50.000Z",
    "summary_long": "OpenAI is launching a new facet for its AI chatbot called ChatGPT Health. This new feature will allow users to connect medical records and wellness apps to ChatGPT in order to get more tailored responses to queries about their health. The company noted that there will be additional privacy safeguards for this separate space within ChatGPT, and said that it will not use conversations held in Health for training foundational models. ChatGPT Health is currently in a testing stage, and there are some regional restrictions on which health apps can be connected to the AI company's platform. Source: www.engadget.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:how tolan builds voicefirst ai with gpt51:2026-01-07T10:00:00.000Z",
    "title": "How Tolan builds voice-first AI with GPT-5.1",
    "url": "https://openai.com/index/tolan",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-01-07T10:00:00.000Z",
    "summary_long": "How Tolan builds voice-first AI with GPT-5.1 Source: openai.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch its falcon 9 rocket on midday:2026-01-08T03:39:51.000Z",
    "title": "Live coverage: SpaceX to launch its Falcon 9 rocket on midday Starlink mission from Cape Canaveral",
    "url": "https://spaceflightnow.com/2026/01/08/live-coverage-spacex-to-launch-its-falcon-9-rocket-on-midday-starlink-mission-from-cape-canaveral/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-08T03:39:51.000Z",
    "summary_long": "SpaceX is set to launch its Falcon 9 rocket on an early afternoon flight to deliver more of its Starlink satellites into low Earth orbit from Cape Canaveral Space Force Station. The Starlink 6-96 mission will add another 29 Starlink V2 Mini Optimized satellites to the megaconstellation. According to astronomer and expert orbital tracker Jonathan McDowell, there were more than 9,400 Starlink satellites in orbit as of Jan. 5. Source: spaceflightnow.com. Date: 2026-01-08. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:solana mobile sets jan 21 launch date for skr token confirms:2026-01-07T18:38:41.000Z",
    "title": "Solana Mobile sets Jan. 21 launch date for SKR token, confirms airdrop",
    "url": "https://www.coindesk.com/markets/2026/01/07/solana-mobile-sets-jan-21-launch-date-for-skr-token-confirms-airdrop",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Margaux Nijkerk",
    "published_at": "2026-01-07T18:38:41.000Z",
    "summary_long": "Solana Mobile sets Jan. 21 launch date for SKR token, confirms airdrop Source: www.coindesk.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:the protocol ledger customer data breached from globale plat:2026-01-07T16:20:38.000Z",
    "title": "The Protocol: Ledger customer data breached from Global-e platform",
    "url": "https://www.coindesk.com/tech/2026/01/07/the-protocol-ledger-customer-data-breached-from-global-e-platform",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Margaux Nijkerk",
    "published_at": "2026-01-07T16:20:38.000Z",
    "summary_long": "The Protocol: Ledger customer data breached from Global-e platform Source: www.coindesk.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]