[
  {
    "id": "bigtech:the 43 billion space telescope trump tried to cancel is now :2025-12-16T21:25:05.000Z",
    "title": "The $4.3 billion space telescope Trump tried to cancel is now complete",
    "url": "https://arstechnica.com/space/2025/12/the-4-3-billion-space-telescope-trump-tried-to-cancel-is-now-complete/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-12-16T21:25:05.000Z",
    "summary_long": "A few weeks ago, technicians inside a cavernous clean room in Maryland made the final connection to complete assembly of NASA’s Nancy Grace Roman Space Telescope. Parts of this new observatory, named for NASA’s first chief astronomer, recently completed a spate of tests to ensure it can survive the shaking and intense sound of a rocket launch. Engineers placed the core of the telescope inside a thermal vacuum chamber, where it withstood the airless conditions and extreme temperature swings it will see in space. Then, on November 25, teams at NASA’s Goddard Space Flight Center in Greenbelt, Maryland, joined the inner and outer portions of the Roman Space Telescope. Source: arstechnica.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:texas sues biggest tv makers alleging smart tvs spy on users:2025-12-16T21:57:55.000Z",
    "title": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
    "url": "https://arstechnica.com/tech-policy/2025/12/texas-sues-biggest-tv-makers-alleging-smart-tvs-spy-on-users-without-consent/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-12-16T21:57:55.000Z",
    "summary_long": "Texas Attorney General Ken Paxton sued five large TV manufacturers yesterday, alleging that their smart TVs spy on viewers without consent. Paxton sued Samsung, the longtime TV market share leader, along with LG, Sony, Hisense, and TCL. “These companies have been unlawfully collecting personal data through Automated Content Recognition (‘ACR’) technology,” Paxton’s office alleged in a press release that contains links to all five lawsuits. “ACR in its simplest terms is an uninvited, invisible digital invader. Source: arstechnica.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:senators count the shady ways data centers pass energy costs:2025-12-16T20:25:57.000Z",
    "title": "Senators count the shady ways data centers pass energy costs on to Americans",
    "url": "https://arstechnica.com/tech-policy/2025/12/shady-data-center-deals-doom-americans-to-higher-energy-bills-senators-say/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-12-16T20:25:57.000Z",
    "summary_long": "Senators launched a probe Tuesday demanding that tech companies explain exactly how they plan to prevent data center projects from increasing electricity bills in communities where prices are already skyrocketing. In letters to seven AI firms, Senators Elizabeth Warren (D-Mass.), Chris Van Hollen (D-Md.), and Richard Blumenthal (D-Conn.) cited a study estimating that “electricity prices have increased by as much as 267 percent in the past five years” in “areas located near significant data center activity.” Prices increase, senators noted, when utility companies build out extra infrastructure to meet data centers’ energy demands—which can amount to one customer suddenly consuming as much power as an entire city. They also increase when demand for local power outweighs supply. In some cases, residents are blindsided by higher bills, not even realizing a data center project was approved, because tech companies seem intent on dodging backlash and frequently do not allow terms of deals to be publicly disclosed. Source: arstechnica.com. Date: 2025-12-16.",
    "tags": []
  },
  {
    "id": "consumer:paypal applies to become a bank under trumps looser financia:2025-12-16T14:30:25.000Z",
    "title": "PayPal applies to become a bank under Trump's looser financial rules",
    "url": "https://www.engadget.com/big-tech/paypal-applies-to-become-a-bank-under-trumps-looser-financial-rules-143025772.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Sarah Fielding",
    "published_at": "2025-12-16T14:30:25.000Z",
    "summary_long": "PayPal is the latest company looking to become a bank in the US. On Monday, the company announced it had submitted applications for PayPal Bank to the Federal Deposit Insurance Corporation (FDIC) and the Utah Department of Financial Institutions (UDFI). PayPal is already a bank in Europe, based in Luxembourg. According to PayPal, it has provided \"over $30 billion in loans and working capital\" for more than 420,000 business accounts globally. Source: www.engadget.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:internet shutdowns are increasing dramatically in africaa ne:2025-12-17T05:00:06.000Z",
    "title": "Internet shutdowns are increasing dramatically in Africa—a new book explains why",
    "url": "https://techxplore.com/news/2025-12-internet-shutdowns-africa.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-17T05:00:06.000Z",
    "summary_long": "Between 2016 and 2024 there were 193 internet shutdowns imposed in 41 African countries. This form of social control is a growing trend in the continent, according to a new open-access source book. It has provided the first-ever comparative analysis of how and why African states use blackouts—written by African researchers. Source: techxplore.com. Date: 2025-12-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex preps sunrise starlink launch from kenn:2025-12-16T23:14:15.000Z",
    "title": "Live coverage: SpaceX preps sunrise Starlink launch from Kennedy Space Center",
    "url": "https://spaceflightnow.com/2025/12/16/live-coverage-spacex-preps-sunrise-starlink-from-kennedy-space-center/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-12-16T23:14:15.000Z",
    "summary_long": "Live coverage: SpaceX preps sunrise Starlink launch from Kennedy Space Center Source: spaceflightnow.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa launches research program for students to explore big i:2025-12-16T21:01:46.000Z",
    "title": "NASA Launches Research Program for Students to Explore Big Ideas",
    "url": "https://www.nasa.gov/learning-resources/research-program-for-students/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Sandra May",
    "published_at": "2025-12-16T21:01:46.000Z",
    "summary_long": "2 Min Read NASA LAUNCHES RESEARCH PROGRAM FOR STUDENTS TO EXPLORE BIG IDEAS NASA is now accepting concepts for a new research challenge. The Opportunities in Research, Business, Innovation, and Technology (ORBIT) challenge is a multi-phase innovation competition designed to empower university and college students to develop next-generation solutions that benefit life on Earth and deep-space exploration. With up to $380,000 in total prize funding, NASA’s ORBIT challenges student teams to bring their most forward-thinking concepts to the table, either utilizing NASA intellectual property or conceptualizing their own. Teams are tasked with conducting targeted research, designing early mockups or models, and performing feasibility analyses to refine their ideas. Source: www.nasa.gov. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:parametric urban design a promising method to create daily e:2025-12-16T20:50:26.000Z",
    "title": "Parametric urban design: A promising method to create daily environments supporting health",
    "url": "https://techxplore.com/news/2025-12-parametric-urban-method-daily-environments.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-16T20:50:26.000Z",
    "summary_long": "Cardiometabolic diseases, such as heart attack, obesity, and diabetes, are responsible for nearly one-third of deaths worldwide annually. These diseases are influenced not only by personal habits, such as exercise and diet, but also by individuals' surroundings. Specifically, the way urban areas are designed could impact individuals' behaviors (like walking instead of driving) and environmental exposures (like air pollution and traffic noise), which in turn could affect cardiometabolic health. Source: techxplore.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the last xbox update of 2025 includes a handy wireless heads:2025-12-16T20:45:00.000Z",
    "title": "The last Xbox update of 2025 includes a handy Wireless Headset upgrade",
    "url": "https://www.engadget.com/gaming/xbox/the-last-xbox-update-of-2025-includes-a-handy-wireless-headset-upgrade-204500386.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-12-16T20:45:00.000Z",
    "summary_long": "As part of its last Xbox-focused software update of the year, Microsoft is improving the Bluetooth performance of the Xbox Wireless Headset to make it work even better with Windows 11. Microsoft released the latest Wireless Headset as an accessory for Xbox Series X/S and PC, but as of this update, Xbox Wireless Headset owners on Windows will now have a leg up on their console counterparts thanks to support for Bluetooth Low Energy (LE) Audio. Microsoft says that supporting Bluetooth LE Audio will let the headset offer lower latency audio, better battery life, richer stereo sound and the ability to share audio across multiple compatible Bluetooth accessories at the same time. Not revolutionary updates, but still nice to have if you bought a $110 Xbox Wireless Headset back in 2024. Source: www.engadget.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa ignites new golden age of exploration innovation in 202:2025-12-16T19:48:18.000Z",
    "title": "NASA Ignites New Golden Age of Exploration, Innovation in 2025",
    "url": "https://www.nasa.gov/news-release/nasa-ignites-new-golden-age-of-exploration-innovation-in-2025/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jessica Taveau",
    "published_at": "2025-12-16T19:48:18.000Z",
    "summary_long": "Artemis II NASA astronauts (left to right) Reid Wiseman, Victor Glover, and Christina Koch, and CSA (Canadian Space Agency) astronaut Jeremy Hansen stand in the white room on the crew access arm of the mobile launcher at Launch Pad 39B as part of an integrated ground systems test at the agency’s Kennedy Space Center in Florida on Sept. 20, 2023. Credit: NASA/Frank Michaux With a second Trump Administration at the helm in 2025, NASA marked significant progress toward the Artemis II test flight early next year, which is the first crewed mission around the Moon in more than 50 years, as well as built upon its momentum toward a human return to the lunar surface in preparation to send the first astronauts — Americans — to Mars. As part of the agency’s Golden Age of innovation and exploration, NASA and its partners landed two robotic science missions on the Moon; garnered more signatories for the Artemis Accords with 59 nations…",
    "tags": []
  },
  {
    "id": "ai_data:chip adaptive compliance for humanoid control through hindsi:2025-12-16T18:56:04.000Z",
    "title": "CHIP: Adaptive Compliance for Humanoid Control through Hindsight Perturbation",
    "url": "https://arxiv.org/abs/2512.14689v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sirui Chen",
    "published_at": "2025-12-16T18:56:04.000Z",
    "summary_long": "Recent progress in humanoid robots has unlocked agile locomotion skills, including backflipping, running, and crawling. Yet it remains challenging for a humanoid robot to perform forceful manipulation tasks such as moving objects, wiping, and pushing a cart. We propose adaptive Compliance Humanoid control through hIsight Perturbation (CHIP), a plug-and-play module that enables controllable end-effector stiffness while preserving agile tracking of dynamic reference motions. CHIP is easy to implement and requires neither data augmentation nor additional reward tuning. Source: arxiv.org. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:chatgpt image generation is now faster and better at followi:2025-12-16T18:00:00.000Z",
    "title": "ChatGPT image generation is now faster and better at following tweaks",
    "url": "https://www.engadget.com/ai/chatgpt-image-generation-is-now-faster-and-better-at-following-tweaks-180000750.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Igor Bonifacic",
    "published_at": "2025-12-16T18:00:00.000Z",
    "summary_long": "Following the release of GPT-5.2 last week, OpenAI has begun rolling out a new image generation model. The company says the updated ChatGPT Images is four times faster than its predecessor. If you're a frequent ChatGPT user, you'll know it can sometimes take a while for OpenAI's servers to create images, particularly during peak times and if you're not paying for ChatGPT Plus. In that respect, any improvement in speed is welcome. Source: www.engadget.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]