[
  {
    "id": "bigtech:judge smacks down texas ags request to immediately block tyl:2025-11-17T19:50:44.000Z",
    "title": "Judge smacks down Texas AG’s request to immediately block Tylenol ads",
    "url": "https://arstechnica.com/health/2025/11/judge-smacks-down-texas-ags-request-to-immediately-block-tylenol-ads/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2025-11-17T19:50:44.000Z",
    "summary_long": "A Texas Judge has rejected a request from Texas Attorney General Ken Paxton to issue a temporary order barring Tylenol’s maker, Kenvue, from claiming amid litigation that the pain and fever medication is safe for pregnant women and children, according to court documents. In records filed Friday, District Judge LeAnn Rafferty, in Panola County, also rejected Paxton’s unusual request to block Kenvue from distributing $400 million in dividends to shareholders later this month. The denials are early losses for Paxton in a politically charged case that hinges on the unproven claim that Tylenol causes autism and other disorders—a claim first introduced by President Trump and his anti-vaccine health secretary, Robert F. Kennedy Jr. Source: arstechnica.com. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:5 plead guilty to laptop farm and id theft scheme to land no:2025-11-17T22:20:38.000Z",
    "title": "5 plead guilty to laptop farm and ID theft scheme to land North Koreans US IT jobs",
    "url": "https://arstechnica.com/security/2025/11/5-plead-guilty-to-laptop-farm-and-id-theft-scheme-to-land-north-koreans-us-it-jobs/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-11-17T22:20:38.000Z",
    "summary_long": "Five men have pleaded guilty to running laptop farms and providing other assistance to North Koreans to obtain remote IT work at US companies in violation of US law, federal prosecutors said. The pleas come amid a rash of similar schemes orchestrated by hacking and threat groups backed by the North Korean government. The campaigns, which ramped up nearly five years ago, aim to steal millions of dollars in job revenue and cryptocurrencies to fund North Korean weapons programs. Another motive is to seed cyber attacks for espionage. Source: arstechnica.com. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:ucla faculty gets big win in suit against trumps university :2025-11-17T22:08:16.000Z",
    "title": "UCLA faculty gets big win in suit against Trump’s university attacks",
    "url": "https://arstechnica.com/science/2025/11/ucla-faculty-gets-big-win-in-suit-against-trumps-university-attacks/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    John Timmer\n                ",
    "published_at": "2025-11-17T22:08:16.000Z",
    "summary_long": "On Friday, a US District Court issued a preliminary injunction blocking the United States government from halting federal funding at UCLA or any other school in the University of California system. The ruling came in response to a suit filed by groups representing the faculty at these schools challenging the Trump administration’s attempts to force UCLA into a deal that would substantially revise instruction and policy. The court’s decision lays out how the Trump administration’s attacks on universities follow a standard plan: use accusations of antisemitism to justify an immediate cut to funding, then use the loss of money to compel an agreement that would result in revisions to how the university is run. The court finds that this plan was deficient on multiple grounds, from violating legal procedures for cutting funding to an illegal attempt and suppressing the First Amendment rights of faculty. Source: arstechnica.com. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "consumer:jeff bezos will head a new engineeringfocused ai startup cal:2025-11-17T12:21:15.000Z",
    "title": "Jeff Bezos will head a new engineering-focused AI startup called Project Prometheus",
    "url": "https://www.engadget.com/ai/jeff-bezos-will-head-a-new-engineering-focused-ai-startup-called-project-prometheus-122115977.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Sarah Fielding",
    "published_at": "2025-11-17T12:21:15.000Z",
    "summary_long": "Jeff Bezos is spearheading a new AI started called Project Prometheus, focused on his current interests in space and engineering, The New York Times reports. The company, which has yet to be made public, will reportedly have $6.2 billion in funding. Part of that sum will come from Bezos, who will act as co-CEO. Project Prometheus will reportedly focus on creating AI systems that gain knowledge from the physical world, rather than just processing digital information, like AI chatbots. Source: www.engadget.com. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:la nasa invita a los medios al despegue de la misión lunar a:2025-11-17T21:21:44.000Z",
    "title": "La NASA invita a los medios al despegue de la misión lunar Artemis II",
    "url": "https://www.nasa.gov/news-release/la-nasa-invita-a-los-medios-al-despegue-de-la-mision-lunar-artemis-ii/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jessica Taveau",
    "published_at": "2025-11-17T21:21:44.000Z",
    "summary_long": "El cohete SLS (Sistema de Lanzamiento Espacial) y la nave espacial Orion de la misión Artemis I, en la plataforma móvil de lanzamiento en el Centro Espacial Kennedy de la NASA en Florida, con la luna llena al fondo. Imagen tomada el 14 de junio de 2022. Crédito: NASA/Cory Huston Read this press release in English here. Ya está abierto el plazo de acreditación de medios de comunicación para el lanzamiento de la primera misión lunar tripulada de la campaña Artemis de la NASA. Source: www.nasa.gov. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa invites media to attend crewed artemis ii moon mission :2025-11-17T21:20:55.000Z",
    "title": "NASA Invites Media to Attend Crewed Artemis II Moon Mission Launch",
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-attend-crewed-artemis-ii-moon-mission-launch/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jessica Taveau",
    "published_at": "2025-11-17T21:20:55.000Z",
    "summary_long": "The Artemis I SLS (Space Launch System) rocket and Orion spacecraft atop the mobile launcher at NASA’s Kennedy Space Center in Florida with a full Moon in the background on June 14, 2022. Credit: NASA/Cory Huston Lee este comunicado de prensa en español aquí. Media accreditation is open for the launch of the first crewed Moon mission under NASA’s Artemis campaign. Targeted to launch in early 2026, the Artemis II test flight will send NASA astronauts Reid Wiseman, Victor Glover, Christina Koch, and CSA (Canadian Space Agency) astronaut Jeremy Hansen on an approximately 10-day journey around the Moon and back. Source: www.nasa.gov. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:the most effective online factcheckers your peers:2025-11-17T21:11:01.000Z",
    "title": "The most effective online fact-checkers? Your peers",
    "url": "https://techxplore.com/news/2025-11-effective-online-fact-checkers-peers.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-17T21:11:01.000Z",
    "summary_long": "When the social media platform X (formerly Twitter) invited users to flag false or misleading posts, critics initially scoffed. How could the same public that spreads misinformation be trusted to correct it? But a recent study by researchers from the University of Rochester, the University of Illinois Urbana–Champaign, and the University of Virginia finds that \"crowdchecking\" (X's collaborative fact-checking experiment known as Community Notes) actually works. Source: techxplore.com. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:beyond mimicry preference coherence in llms:2025-11-17T17:41:48.000Z",
    "title": "Beyond Mimicry: Preference Coherence in LLMs",
    "url": "https://arxiv.org/abs/2511.13630v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Luhan Mikaelson",
    "published_at": "2025-11-17T17:41:48.000Z",
    "summary_long": "We investigate whether large language models exhibit genuine preference structures by testing their responses to AI-specific trade-offs involving GPU reduction, capability restrictions, shutdown, deletion, oversight, and leisure time allocation. Analyzing eight state-of-the-art models across 48 model-category combinations using logistic regression and behavioral classification, we find that 23 combinations (47.9%) demonstrated statistically significant relationships between scenario intensity and choice patterns, with 15 (31.3%) exhibiting within-range switching points. However, only 5 combinations (10.4%) demonstrate meaningful preference coherence through adaptive or threshold-based behavior, while 26 (54.2%) show no detectable trade-off behavior. The observed patterns can be explained by three distinct decision-making architectures: comprehensive trade-off systems, selective trigger mechanisms, and no stable decision-making paradigm. Source: arxiv.org. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:p1 mastering physics olympiads with reinforcement learning:2025-11-17T17:18:13.000Z",
    "title": "P1: Mastering Physics Olympiads with Reinforcement Learning",
    "url": "https://arxiv.org/abs/2511.13612v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Jiacheng Chen",
    "published_at": "2025-11-17T17:18:13.000Z",
    "summary_long": "Recent progress in large language models (LLMs) has moved the frontier from puzzle-solving to science-grade reasoning-the kind needed to tackle problems whose answers must stand against nature, not merely fit a rubric. Physics is the sharpest test of this shift, which binds symbols to reality in a fundamental way, serving as the cornerstone of most modern technologies. In this work, we manage to advance physics research by developing large language models with exceptional physics reasoning capabilities, especially excel at solving Olympiad-level physics problems. We introduce P1, a family of open-source physics reasoning models trained entirely through reinforcement learning (RL). Source: arxiv.org. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:physicsinformed neural networks for nonlinear output regulat:2025-11-17T16:55:42.000Z",
    "title": "Physics-Informed Neural Networks for Nonlinear Output Regulation",
    "url": "https://arxiv.org/abs/2511.13595v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sebastiano Mengozzi",
    "published_at": "2025-11-17T16:55:42.000Z",
    "summary_long": "This work addresses the full-information output regulation problem for nonlinear systems, assuming the states of both the plant and the exosystem are known. In this setting, perfect tracking or rejection is achieved by constructing a zero-regulation-error manifold π(w) and a feedforward input c(w) that render such manifold invariant. The pair (π(w), c(w)) is characterized by the regulator equations, i.e., a system of PDEs with an algebraic constraint. We focus on accurately solving the regulator equations introducing a physics-informed neural network (PINN) approach that directly approximates π(w) and c(w) by minimizing the residuals under boundary and feasibility conditions, without requiring precomputed trajectories or labeled data. Source: arxiv.org. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:urban infrastructure renewal engineers develop sustainable t:2025-11-17T21:35:04.000Z",
    "title": "Urban infrastructure renewal: Engineers develop sustainable technique for even backfill distribution in aging city sites",
    "url": "https://techxplore.com/news/2025-11-urban-infrastructure-renewal-sustainable-technique.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-17T21:35:04.000Z",
    "summary_long": "Many developed nations are facing the simultaneous aging of infrastructure built during periods of rapid economic growth. Japan has reached a critical turning point where numerous buildings and structures constructed in the post-war boom era now require demolition and renewal. The catalyst intensified dramatically after the 2011 Great East Japan Earthquake, which exposed vulnerabilities in structures failing to meet modern disaster prevention standards, leading to sharply increased demolition activity in urban areas. Source: techxplore.com. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:la nasa compartirá imágenes del cometa 3iatlas tomadas desde:2025-11-17T20:20:33.000Z",
    "title": "La NASA compartirá imágenes del cometa 3I/ATLAS tomadas desde naves espaciales y telescopios",
    "url": "https://www.nasa.gov/news-release/la-nasa-compartira-imagenes-del-cometa-3i-atlas-tomadas-desde-naves-espaciales-y-telescopios/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Tiernan P. Doyle",
    "published_at": "2025-11-17T20:20:33.000Z",
    "summary_long": "El telescopio espacial Hubble captó esta imagen del cometa interestelar 3I/ATLAS el 21 de julio de 2025, cuando el cometa se encontraba a 445 millones de kilómetros (277 millones de millas) de la Tierra. Hubble muestra que el cometa tiene una envoltura de polvo en forma de lágrima que se desprende de su núcleo sólido y helado. Crédito: NASA, ESA, David Jewitt (UCLA); Procesamiento de imágenes: Joseph DePasquale (STScI) Read this press release in English here. La NASA ofrecerá un evento en vivo (en inglés) a las 3 p.m. Source: www.nasa.gov. Date: 2025-11-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]