[
  {
    "id": "bigtech:condé nast user database reportedly breached ars unaffected:2025-12-30T18:45:54.000Z",
    "title": "Condé Nast user database reportedly breached, Ars unaffected",
    "url": "https://arstechnica.com/information-technology/2025/12/conde-nast-user-database-reportedly-breached-ars-unaffected/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ken Fisher\n                ",
    "published_at": "2025-12-30T18:45:54.000Z",
    "summary_long": "Earlier this month, a hacker named Lovely claimed to have breached a Condé Nast user database and released a list of more than 2.3 million user records from our sister publication WIRED. The released materials contain demographic information (name, email, address, phone, etc.) but no passwords. The hacker also says that they will release an additional 40 million records for other Condé Nast properties, including our other sister publications Vogue, The New Yorker, Vanity Fair, and more. Of critical note to our readers, Ars Technica was not affected as we run on our own bespoke tech stack. Source: arstechnica.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:two cybersecurity employees plead guilty to carrying out ran:2025-12-30T18:32:27.000Z",
    "title": "Two cybersecurity employees plead guilty to carrying out ransomware attacks",
    "url": "https://www.theverge.com/news/851467/cybersecurity-employees-plead-guilty-alphv-blackcat-ransomware",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Emma Roth",
    "published_at": "2025-12-30T18:32:27.000Z",
    "summary_long": "Two former employees at cybersecurity firms - one of whom was a ransomware negotiator - have pleaded guilty to carrying out a series of ransomware attacks in 2023. The Department of Justice announced the guilty pleas on Tuesday, saying 40-year-old Ryan Goldberg and 36-year-old Kevin Martin extorted $1.2 million in Bitcoin from a medical device company and targeted several others. Goldberg, Martin, and an unnamed co-conspirator were indicted for the attacks in October, which involved using ALPHV / BlackCat ransomware to encrypt and steal data from their victims. As reported by the Chicago Sun-Times, Martin and the third conspirator worked as … Read the full story at The Verge. Source: www.theverge.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:the onexsugar wallet is the first gaming handheld with a fol:2025-12-30T17:52:38.000Z",
    "title": "The OneXSugar Wallet is the first gaming handheld with a folding screen",
    "url": "https://www.theverge.com/news/851401/one-netbook-onexsugar-gaming-handheld-wallet-folding-oled-screen-android",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Andrew Liszewski",
    "published_at": "2025-12-30T17:52:38.000Z",
    "summary_long": "Folding OLED displays are still most commonly found on premium smartphones and laptops, but One-Netbook is bringing the tech to a new gaming device. Its new OneXSugar Wallet is reminiscent of the company's folding OneXSugar Sugar 1 handheld that launched earlier this year. But instead of two screens, the Wallet handheld unfolds to reveal just one big 8.01-inch OLED screen with a 4:3 aspect ratio, as spotted by Retro Handhelds. The OneXSugar Wallet was announced on China's Weibo yesterday, but with few details about its features and capabilities. Source: www.theverge.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:idc warns of major pc market downturn due to memory crunch:2025-12-30T21:45:10.000Z",
    "title": "IDC warns of major PC market downturn due to memory crunch",
    "url": "https://www.engadget.com/computing/idc-warns-of-major-pc-market-downturn-due-to-memory-crunch-214510197.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-12-30T21:45:10.000Z",
    "summary_long": "The demand building out AI infrastructure has placed on PC component makers has already led to the death of one consumer-facing RAM brand, but a new report from the International Data Corporation (IDC) suggests it could have an even worse impact on the PC industry at large. In its worst-case-scenario model, the IDC predicts PC shipments could shrink by up to 8.9 percent in 2026 because of the high cost of memory. \"Instead of expanding conventional DRAM and NAND used in smartphones, PCs and other consumer electronics, major memory makers have shifted production toward memory used in AI data centers, such as high-bandwidth (HBM) and high-capacity DDR5,\" IDC writes. That's continued to drive up the price of the RAM that is available for PC makers, which has naturally led to them to raise the price of their own products to stay above water. Source: www.engadget.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "fintech:grayscale sees regulation not quantum fears shaping crypto m:2025-12-30T13:42:31.000Z",
    "title": "Grayscale sees regulation, not quantum fears, shaping crypto markets in 2026",
    "url": "https://www.coindesk.com/markets/2025/12/30/grayscale-sees-regulation-not-quantum-fears-shaping-crypto-markets-in-2026",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-12-30T13:42:31.000Z",
    "summary_long": "Grayscale sees regulation, not quantum fears, shaping crypto markets in 2026 Source: www.coindesk.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the morning after what to expect at ces 2026:2025-12-30T12:15:11.000Z",
    "title": "The Morning After: What to expect at CES 2026",
    "url": "https://www.engadget.com/general/the-morning-after-engadget-newsletter-121511445.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mat Smith",
    "published_at": "2025-12-30T12:15:11.000Z",
    "summary_long": "CES 2026 is right around the corner, and the pre-show hype cycle/ early reveals suggest, yes, there’s going to be an awful lot of AI-powered insert-product-category-here alongside, thankfully, some major announcements from the likes of Intel, Sony and NVIDIA. Intel is finally unveiling its Panther Lake (Core Ultra Series 3) chips. The first chips built on Intel’s 2nm process could offer a 50 percent performance boost, which is sorely needed amid intense competition. NVIDIA’s Jensen Huang is taking the stage for a keynote expected to feature a lot of AI hype, while AMD’s Lisa Su will likely counter with new Ryzen 9000-series chips and the latest on AI upscaling tech. Source: www.engadget.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:lighter dex launches lit token with 25 airdrop:2025-12-30T07:43:17.000Z",
    "title": "Lighter DEX launches LIT token with 25% airdrop",
    "url": "https://www.coindesk.com/markets/2025/12/30/lighter-dex-launches-lit-token-with-25-airdrop",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Omkar Godbole",
    "published_at": "2025-12-30T07:43:17.000Z",
    "summary_long": "Lighter DEX launches LIT token with 25% airdrop Source: www.coindesk.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:traders split over whether lighters lit clears 3 billion fdv:2025-12-30T09:51:19.000Z",
    "title": "Traders split over whether Lighter’s LIT clears $3 billion FDV after launch",
    "url": "https://www.coindesk.com/markets/2025/12/30/traders-split-over-whether-lighter-s-lit-clears-usd3-billion-fdv-after-launch",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Sam Reynolds",
    "published_at": "2025-12-30T09:51:19.000Z",
    "summary_long": "Traders split over whether Lighter’s LIT clears $3 billion FDV after launch Source: www.coindesk.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:lg announces new line of xboom speakers ahead of ces:2025-12-31T01:00:52.000Z",
    "title": "LG announces new line of xboom speakers ahead of CES",
    "url": "https://www.engadget.com/audio/speakers/lg-announces-new-line-of-xboom-speakers-ahead-of-ces-010052598.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2025-12-31T01:00:52.000Z",
    "summary_long": "LG just revealed several new speakers in the xboom line ahead of CES 2026. These speakers are part of an ongoing collaboration with will.i.am from Black Eyed Peas, who is on board as the \"experimental architect\" involved with \"development, design and brand marketing.\" These speakers are fairly different from one another, but they all have AI in common. Each speaker includes an algorithm that automatically adjusts the EQ after analyzing the audio content and the listening space. Many also feature an AI algorithm for ambient lighting, which will adjust the lights to match the song being played. Source: www.engadget.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:passengers brain signals may help selfdriving cars make safe:2025-12-30T18:31:11.000Z",
    "title": "Passengers' brain signals may help self-driving cars make safer choices",
    "url": "https://techxplore.com/news/2025-12-passengers-brain-cars-safer-choices.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-30T18:31:11.000Z",
    "summary_long": "Passengers' brain signals may help self-driving cars make safer choices Source: techxplore.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:agentic ai mcp and specdriven development top blog posts of :2025-12-30T17:20:10.000Z",
    "title": "Agentic AI, MCP, and spec-driven development: Top blog posts of 2025",
    "url": "https://github.blog/developer-skills/agentic-ai-mcp-and-spec-driven-development-top-blog-posts-of-2025/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Natalie Guevara",
    "published_at": "2025-12-30T17:20:10.000Z",
    "summary_long": "As the editor of the GitHub Blog, I get a front-row seat to everything that’s published here. As we wrap up 2025, I’m marking the occasion by looking back at the most popular blog posts of the year as well as some of my favorite interviews. While AI models were the big topic of 2024, this year saw AI become your coding partner. AI agents and agentic tools were top among our most popular posts of the year. Source: github.blog. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:new ai model accurately grades messy handwritten math answer:2025-12-30T16:45:58.000Z",
    "title": "New AI model accurately grades messy handwritten math answers and explains student errors",
    "url": "https://techxplore.com/news/2025-12-ai-accurately-grades-messy-handwritten.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-30T16:45:58.000Z",
    "summary_long": "New AI model accurately grades messy handwritten math answers and explains student errors Source: techxplore.com. Date: 2025-12-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]