[
  {
    "id": "bigtech:as data from space spikes an innovative ground station compa:2026-01-27T14:16:32.000Z",
    "title": "As data from space spikes, an innovative ground station company seeks to cash in",
    "url": "https://arstechnica.com/space/2026/01/as-data-from-space-spikes-an-innovative-ground-station-company-seeks-to-cash-in/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2026-01-27T14:16:32.000Z",
    "summary_long": "A company that seeks to disrupt the way in which data from space is received and transmitted has found some key investors and customers. On Tuesday morning Northwood Space announced that it has closed a $100 million Series B round of funding to support a rapid ramp-up in the deployment of its phased-array radar system, known as Portal. The company also said it has received a $49.8 million contract from the US Space Force to augment the Satellite Control Network, which provides telemetry and tracking for the military's satellites. \"We made our last fundraise announcement in April of 2025, so less than a year, but there's been a lot of activity and progress on the Northwood side that reflects the importance of ground as an enabler for pushing forward more capable missions on shorter timelines,\" said Bridgit Mendler, co-founder and CEO of Northwood, during a media roundtable. Source: arstechnica.com. Date: 2026-01-27.",
    "tags": []
  },
  {
    "id": "bigtech:tiktok users absolutely justified for fearing maga makeover :2026-01-27T23:17:17.000Z",
    "title": "TikTok users “absolutely justified” for fearing MAGA makeover, experts say",
    "url": "https://arstechnica.com/tech-policy/2026/01/tiktok-claimed-bugs-blocked-anti-ice-videos-epstein-mentions-experts-call-bs/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2026-01-27T23:17:17.000Z",
    "summary_long": "TikTok wants users to believe that errors blocking uploads of anti-ICE videos or direct messages mentioning Jeffrey Epstein are due to technical errors—not the platform seemingly shifting to censor content critical of Donald Trump after he hand-picked the US owners who took over the app last week. However, experts say that TikTok users' censorship fears are justified, whether the bugs are to blame or not. Ioana Literat, an associate professor of technology, media, and learning at Teachers College, Columbia University, has studied TikTok's politics since the app first shot to popularity in the US in 2018. She told Ars that \"users' fears are absolutely justified\" and explained why the \"bugs\" explanation is \"insufficient.\" Read full article Comments Source: arstechnica.com. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:volvo invented the threepoint seat belt 67 years ago now it :2026-01-27T16:16:32.000Z",
    "title": "Volvo invented the three-point seat belt 67 years ago; now it has improved it",
    "url": "https://arstechnica.com/cars/2026/01/how-volvos-new-adaptive-seat-belts-will-reduce-injuries-during-a-crash/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kristin Shaw\n                ",
    "published_at": "2026-01-27T16:16:32.000Z",
    "summary_long": "Volvo provided flights from Austin, Texas, to Stockholm, Sweden, and accommodation so Ars could learn about its new seatbelt. Ars does not accept paid editorial content. With the launch of its all-new, all-electric EX60, Volvo has put lessons learned from the EX30 and EX90 to use. The EX60 is built on Volvo’s new SPA3 platform, made only for battery-electric vehicles. Source: arstechnica.com. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:mesh becomes unicorn raises 75 million for crypto payments i:2026-01-27T17:03:35.000Z",
    "title": "Mesh becomes unicorn, raises $75 million for crypto payments infrastructure",
    "url": "https://www.coindesk.com/business/2026/01/27/mesh-becomes-unicorn-raises-usd75-million-for-crypto-payments-infrastructure",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jamie Crawley",
    "published_at": "2026-01-27T17:03:35.000Z",
    "summary_long": "Mesh becomes unicorn, raises $75 million for crypto payments infrastructure Source: www.coindesk.com. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:bandits in flux adversarial constraints in dynamic environme:2026-01-27T18:26:07.000Z",
    "title": "Bandits in Flux: Adversarial Constraints in Dynamic Environments",
    "url": "https://arxiv.org/abs/2601.19867v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Tareq Si Salem",
    "published_at": "2026-01-27T18:26:07.000Z",
    "summary_long": "We investigate the challenging problem of adversarial multi-armed bandits operating under time-varying constraints, a scenario motivated by numerous real-world applications. To address this complex setting, we propose a novel primal-dual algorithm that extends online mirror descent through the incorporation of suitable gradient estimators and effective constraint handling. We provide theoretical guarantees establishing sublinear dynamic regret and sublinear constraint violation for our proposed policy. Our algorithm achieves state-of-the-art performance in terms of both regret and constraint violation. Source: arxiv.org. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:lvlms and humans ground differently in referential communica:2026-01-27T16:52:20.000Z",
    "title": "LVLMs and Humans Ground Differently in Referential Communication",
    "url": "https://arxiv.org/abs/2601.19792v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Peter Zeng",
    "published_at": "2026-01-27T16:52:20.000Z",
    "summary_long": "For generative AI agents to partner effectively with human users, the ability to accurately predict human intent is critical. But this ability to collaborate remains limited by a critical deficit: an inability to model common ground. Here, we present a referential communication experiment with a factorial design involving director-matcher pairs (human-human, human-AI, AI-human, and AI-AI) that interact with multiple turns in repeated rounds to match pictures of objects not associated with any obvious lexicalized labels. We release the online pipeline for data collection, the tools and analyses for accuracy, efficiency, and lexical overlap, and a corpus of 356 dialogues (89 pairs over 4 rounds each) that unmasks LVLMs' limitations in interactively resolving referring expressions, a crucial skill that underlies human language use. Source: arxiv.org. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:widely attended gatherings wags determinations:2026-01-27T20:45:03.000Z",
    "title": "Widely Attended Gatherings (WAGs) Determinations",
    "url": "https://www.nasa.gov/organizations/nasa-ethics-advice-for-widely-attended-gatherings-wags/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "NASA",
    "published_at": "2026-01-27T20:45:03.000Z",
    "summary_long": "2026 Leaders for a Better Louisiana at Adams and Reese 1.28.26 California Manufacturers and Technology Association Reception 1.23.26 Goddard Memorial Dinner 3.13.26 ISS 25th Anniversary 1.19.26 2026 Amentum Artemis II Rollout Reception 1.14.26 Maryland Space Business Roundtable 1.14.26 2025 Commercial Space Federation 12.9.25 Ansys Government Initiatives (AGI) 12.16.25 Maryland Space Business Roundtable (MSBR) 12.10.25 Women in Aerospace 12.11.25 Umbra Lab Inc 12.3.25 Space Policy Institute 10.21.2025 MSBR Space Business Roundtable 10.15.2025 76th International Astronautical Congress_IAC 9.29.25 2025 Von Braun Memorial Dinner 10.29.25 Space Foundation Reception 9.16.25 Evening with the Stars 9.10.25 MSBR Rooftop Reception 9.8.25 AIAA Dinner 8.18.25 STScI Event 7.29.25 MSBR Lunch 7.16.25 Rocket Lab Event 7.16.25 MSBR Lunch Reception 6.18.25 2025 Paris Airshow 6.13-19.25 Greater Houston Partnership Reception 6.12.25 Axiom Space X-4 Event Space Foundation and German Embassy Reception 6.5.25 Mission 2 Moon Landing 6.5.25 H2M Conference and Events 5.28-29.25 Planetary Society 5.19.25 American Rocketry Challenge Reception 5.17.25 Rockets on the Hill Reception 5.16.25 Dayton Development Coalition Event…",
    "tags": []
  },
  {
    "id": "consumer:sennheiser debuts new models of wired headphones and earbuds:2026-01-27T20:12:45.000Z",
    "title": "Sennheiser debuts new models of wired headphones and earbuds",
    "url": "https://www.engadget.com/audio/headphones/sennheiser-debuts-new-models-of-wired-headphones-and-earbuds-201245058.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-27T20:12:45.000Z",
    "summary_long": "Wireless audio has become the industry standard, but there are still options out there for people who prefer a wired connection. Two new choices joining the market come from Sennheiser, which has released the CX 80U wired earbuds and HD 400U wired over-ear headphones. These new takes on the company's previous models for wired listening have replaced the 3.5mm audio jack connector with a USB-C cable. Both sets support 24-bit, 96 kHz digital audio playback. Source: www.engadget.com. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas juno measures thickness of europas ice shell:2026-01-27T19:21:58.000Z",
    "title": "NASA’s Juno Measures Thickness of Europa’s Ice Shell",
    "url": "https://www.nasa.gov/missions/juno/nasas-juno-measures-thickness-of-europas-ice-shell/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "scarney1",
    "published_at": "2026-01-27T19:21:58.000Z",
    "summary_long": "5 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) Jupiter’s moon Europa was captured by the JunoCam instrument aboard NASA’s Juno spacecraft during the mission’s close flyby on Sept. 29, 2022. The images show the fractures, ridges, and bands that crisscross the moon’s surface. Image data: NASA/JPL-Caltech/SwRI/MSSS Image processing: Björn Jónsson (CC BY 3.0) Results from the solar-powered spacecraft provide a new measurement of the thickness of the ice shell encasing the Jovian moon’s ocean. Source: www.nasa.gov. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:generative latent alignment for interpretable radar based oc:2026-01-27T18:06:51.000Z",
    "title": "Generative Latent Alignment for Interpretable Radar Based Occupancy Detection in Ambient Assisted Living",
    "url": "https://arxiv.org/abs/2601.19853v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Huy Trinh",
    "published_at": "2026-01-27T18:06:51.000Z",
    "summary_long": "In this work, we study how to make mmWave radar presence detection more interpretable for Ambient Assisted Living (AAL) settings, where camera-based sensing raises privacy concerns. We propose a Generative Latent Alignment (GLA) framework that combines a lightweight convolutional variational autoencoder with a frozen CLIP text encoder to learn a low-dimensional latent representation of radar Range-Angle (RA) heatmaps. The latent space is softly aligned with two semantic anchors corresponding to \"empty room\" and \"person present\", and Grad-CAM is applied in this aligned latent space to visualize which spatial regions support each presence decision. On our mmWave radar dataset, we qualitatively observe that the \"person present\" class produces compact Grad-CAM blobs that coincide with strong RA returns, whereas \"empty room\" samples yield diffuse or no evidence. Source: arxiv.org. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:google ai plus is now available in the us for 8 a month:2026-01-27T18:00:00.000Z",
    "title": "Google AI Plus is now available in the US for $8 a month",
    "url": "https://www.engadget.com/ai/google-ai-plus-is-now-available-in-the-us-for-8-a-month-180000175.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2026-01-27T18:00:00.000Z",
    "summary_long": "Google AI Plus, the company’s most affordable AI subscription plan, is now rolling out in the US. It will cost you $8 a month for its features, though you can get it for $4 a month for the first two months for a limited time only. AI Plus gives you access to 200GB of storage, as well as access to the Gemini 3 Pro model, Deep Research and Nano Banana Pro inside the Gemini app. Nano Banana Pro generates images that look so realistic, they’re nearly indistinguishable from ordinary photos snapped on phones. Source: www.engadget.com. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:openai releases prism a claude codelike app for scientific r:2026-01-27T18:00:00.000Z",
    "title": "OpenAI releases Prism, a Claude Code-like app for scientific research",
    "url": "https://www.engadget.com/ai/openai-releases-prism-a-claude-code-like-app-for-scientific-research-180000454.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Igor Bonifacic",
    "published_at": "2026-01-27T18:00:00.000Z",
    "summary_long": "OpenAI is releasing a new app called Prism today, and it hopes it does for science what coding agents like Claude Code and its own Codex platform have done for programming. Prism builds on Crixet, a cloud-based LaTeX platform the company is announcing it acquired today. For the uninitiated, LaTeX is a typesetting system for formatting scientific documents and journals. Nearly the entire scientific community relies on LaTeX, but it can make some tasks, such as drawing diagrams through TikZ commands, time-consuming to do. Source: www.engadget.com. Date: 2026-01-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]