[
  {
    "id": "bigtech:roomba maker irobot swept into bankruptcy:2025-12-15T15:24:41.000Z",
    "title": "Roomba maker iRobot swept into bankruptcy",
    "url": "https://arstechnica.com/information-technology/2025/12/roomba-maker-irobot-swept-into-bankruptcy/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Rafe Rosner-Uddin in San Francisco\n                ",
    "published_at": "2025-12-15T15:24:41.000Z",
    "summary_long": "Roomba maker iRobot has filed for bankruptcy and will be taken over by its Chinese supplier after the company that popularized the robot vacuum cleaner fell under the weight of competition from cheaper rivals. The US-listed group on Sunday said it had filed for Chapter 11 bankruptcy in Delaware as part of a restructuring agreement with Shenzhen-based Picea Robotics, its lender and primary supplier, which will acquire all of iRobot’s shares. The deal comes nearly two years after a proposed $1.5 billion acquisition by Amazon fell through over competition concerns from EU regulators. Read full article Comments Source: arstechnica.com. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:uk to encourage apple and google to put nudityblocking syste:2025-12-15T19:38:32.000Z",
    "title": "UK to “encourage” Apple and Google to put nudity-blocking systems on phones",
    "url": "https://arstechnica.com/tech-policy/2025/12/uk-to-encourage-apple-and-google-to-put-nudity-blocking-systems-on-phones/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-12-15T19:38:32.000Z",
    "summary_long": "The UK government reportedly will “encourage” Apple and Google to prevent phones from displaying nude images except when users verify that they are adults. The forthcoming push for nudity-blocking systems was reported by the Financial Times today. The report said the UK won’t institute a legal requirement “for now.” But asking companies to block nude images could be the first step toward making it mandatory if the government doesn’t get what it wants. “The UK government wants technology companies to block explicit images on phones and computers by default to protect children, with adults having to verify their age to create and access such content,” the FT report said. Source: arstechnica.com. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:oh look yet another starship clone has popped up in china:2025-12-15T16:44:01.000Z",
    "title": "Oh look, yet another Starship clone has popped up in China",
    "url": "https://arstechnica.com/space/2025/12/oh-look-yet-another-starship-clone-has-popped-up-in-china/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-12-15T16:44:01.000Z",
    "summary_long": "Every other week, it seems, a new Chinese launch company pops up with a rocket design and a plan to reach orbit within a few years. For a long time, the majority of these companies revealed designs that looked a lot like SpaceX’s Falcon 9 rocket. The first of these copy cats, the medium-lift Zhuque-3 rocket built by LandSpace, launched earlier this month. Its primary mission was nominal, but the Zhuque-3 rocket failed its landing attempt, which is understandable for a first flight. Source: arstechnica.com. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:paypal issuer of pyusd applies for utah industrial bank lice:2025-12-16T00:00:57.000Z",
    "title": "PayPal, issuer of PYUSD, applies for Utah industrial bank license",
    "url": "https://www.coindesk.com/policy/2025/12/15/paypal-issuer-of-pyusd-applies-for-utah-industrial-bank-license",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Nikhilesh De",
    "published_at": "2025-12-16T00:00:57.000Z",
    "summary_long": "PayPal, issuer of PYUSD, applies for Utah industrial bank license Source: www.coindesk.com. Date: 2025-12-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:rocket lab electron rocket aborts liftoff at engine ignition:2025-12-15T22:14:19.000Z",
    "title": "Rocket Lab Electron rocket aborts liftoff at engine ignition",
    "url": "https://spaceflightnow.com/2025/12/15/rocket-lab-to-launch-second-of-three-planned-electron-rockets-this-week/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-12-15T22:14:19.000Z",
    "summary_long": "Update 8pm EST (0100 UTC): The launch was aborted at engine ignition. Awaiting further details and a new launch date from Rocket Lab. Rocket Lab is poised to close out 2025 with a trio of Electron rocket launches across its three pads in New Zealand and the United States. If all three launch, this would represent the most rapid sequence of Electron missions to date. Source: spaceflightnow.com. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:fast policy learning for 6dof position control of underwater:2025-12-15T14:12:32.000Z",
    "title": "Fast Policy Learning for 6-DOF Position Control of Underwater Vehicles",
    "url": "https://arxiv.org/abs/2512.13359v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sümer Tunçay",
    "published_at": "2025-12-15T14:12:32.000Z",
    "summary_long": "Autonomous Underwater Vehicles (AUVs) require reliable six-degree-of-freedom (6-DOF) position control to operate effectively in complex and dynamic marine environments. Traditional controllers are effective under nominal conditions but exhibit degraded performance when faced with unmodeled dynamics or environmental disturbances. Reinforcement learning (RL) provides a powerful alternative but training is typically slow and sim-to-real transfer remains challenging. This work introduces a GPU-accelerated RL training pipeline built in JAX and MuJoCo-XLA (MJX). Source: arxiv.org. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:errordriven prompt optimization for arithmetic reasoning:2025-12-15T13:39:14.000Z",
    "title": "Error-Driven Prompt Optimization for Arithmetic Reasoning",
    "url": "https://arxiv.org/abs/2512.13323v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Árpád Pándy",
    "published_at": "2025-12-15T13:39:14.000Z",
    "summary_long": "Recent advancements in artificial intelligence have sparked interest in industrial agents capable of supporting analysts in regulated sectors, such as finance and healthcare, within tabular data workflows. A key capability for such systems is performing accurate arithmetic operations on structured data while ensuring sensitive information never leaves secure, on-premises environments. Here, we introduce an error-driven optimization framework for arithmetic reasoning that enhances a Code Generation Agent (CGA), specifically applied to on-premises small language models (SLMs). Through a systematic evaluation of a leading SLM (Qwen3 4B), we find that while the base model exhibits fundamental limitations in arithmetic tasks, our proposed error-driven method, which clusters erroneous predictions to refine prompt-rules iteratively, dramatically improves performance, elevating the model's accuracy to 70.8\\%. Source: arxiv.org. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:minilingua a small opensource llm for european languages:2025-12-15T13:12:42.000Z",
    "title": "MiniLingua: A Small Open-Source LLM for European Languages",
    "url": "https://arxiv.org/abs/2512.13298v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Anna Aksenova",
    "published_at": "2025-12-15T13:12:42.000Z",
    "summary_long": "Large language models are powerful but often limited by high computational cost, privacy concerns, and English-centric training. Recent progress demonstrates that small, efficient models with around one billion parameters can deliver strong results and enable on-device use. This paper introduces MiniLingua, a multilingual open-source LLM of one billion parameters trained from scratch for 13 European languages, designed to balance coverage and instruction-following capabilities. Based on evaluation results, the instruction-tuned version of MiniLingua outperforms EuroLLM, a model with a similar training approach but a larger training budget, on summarization, classification and both open- and closed-book question answering. Source: arxiv.org. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:bungies marathon will arrive in march:2025-12-15T20:43:22.000Z",
    "title": "Bungie's Marathon will arrive in March",
    "url": "https://www.engadget.com/gaming/playstation/bungies-marathon-will-arrive-in-march-200838426.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Kris Holt",
    "published_at": "2025-12-15T20:43:22.000Z",
    "summary_long": "Bungie’s Marathon has a new release window. The survival extraction shooter was originally set to hit PlayStation 5, Xbox Series X/S and PC in September, but by June, Sony had delayed it indefinitely. Now, with a plagiarism issue largely in the rearview mirror, Bungie has confirmed that Marathon will arrive in March and and plans to sell it for $40. Alongside the release date and price announcement, Bungie released a 23-minute video that takes a deep dive into the game and shows off the current state of Marathon. Source: www.engadget.com. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nextstep3 b moon to mars architecture studies:2025-12-15T19:31:53.000Z",
    "title": "NextSTEP-3 B: Moon to Mars Architecture Studies",
    "url": "https://www.nasa.gov/general/nextstep-3-b-moon-to-mars-architecture-studies/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Danny Baird",
    "published_at": "2025-12-15T19:31:53.000Z",
    "summary_long": "Notice ID: M2M-MSFC-0001 * December 15, 2025 – Synopsis Released NAICS Codes: * 541715 – Research and Development in the Physical, Engineering, and Life Sciences (except Nanotechnology and Biotechnology) NASA seeks industry-led architecture concept development, concept refinement studies, and risk-reduction activities that address Moon to Mars Architecture gaps through the Next Space Technologies for Exploration Partnerships-3 (NextSTEP-3). NASA plans to release this solicitation — NextSTEP-3 Appendix B: Moon to Mars Architectural Studies — near the beginning of calendar year 2026. For full details, consult the links under the notice ID above. NASA’s Moon to Mars Architecture defines capabilities needed for long-term, human-led scientific discovery in deep space. Source: www.nasa.gov. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:whats at stake in trumps executive order aiming to curb stat:2025-12-15T17:09:11.000Z",
    "title": "What's at stake in Trump's executive order aiming to curb state-level AI regulation",
    "url": "https://techxplore.com/news/2025-12-stake-trump-aiming-curb-state.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-15T17:09:11.000Z",
    "summary_long": "What's at stake in Trump's executive order aiming to curb state-level AI regulation Source: techxplore.com. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bank of america says us banks are heading for multiyear onch:2025-12-15T16:19:58.000Z",
    "title": "Bank of America says U.S. banks are heading for multi-year onchain future",
    "url": "https://www.coindesk.com/policy/2025/12/15/bank-of-america-says-u-s-banks-are-heading-for-an-onchain-future",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-12-15T16:19:58.000Z",
    "summary_long": "Bank of America says U.S. banks are heading for multi-year onchain future Source: www.coindesk.com. Date: 2025-12-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]