[
  {
    "id": "bigtech:ai models can acquire backdoors from surprisingly few malici:2025-10-09T22:03:21.000Z",
    "title": "AI models can acquire backdoors from surprisingly few malicious documents",
    "url": "https://arstechnica.com/ai/2025/10/ai-models-can-acquire-backdoors-from-surprisingly-few-malicious-documents/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-10-09T22:03:21.000Z",
    "summary_long": "Scraping the open web for AI training data can have its drawbacks. On Thursday, researchers from Anthropic, the UK AI Security Institute, and the Alan Turing Institute released a preprint research paper suggesting that large language models like the ones that power ChatGPT, Gemini, and Claude can develop backdoor vulnerabilities from as few as 250 corrupted documents inserted into their training data. That means someone tucking certain documents away inside training data could potentially manipulate how the LLM responds to prompts, although the finding comes with significant caveats. The research involved training AI language models ranging from 600 million to 13 billion parameters on datasets scaled appropriately for their size. Source: arstechnica.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:discord says hackers stole government ids of 70000 users:2025-10-09T18:24:13.000Z",
    "title": "Discord says hackers stole government IDs of 70,000 users",
    "url": "https://arstechnica.com/security/2025/10/discord-says-hackers-stole-government-ids-of-70000-users/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-10-09T18:24:13.000Z",
    "summary_long": "Discord says that hackers made off with images of 70,000 users’ government IDs that they were required to provide in order to use the site. Like an increasing number of sites, Discord requires certain users to provide a photo or scan of their driver's license or other government ID that shows they meet the minimum age requirements in their country. In some cases, Discord allows users to prove their age by providing a selfie that shows their faces (it’s not clear how a face proves someone’s age, but there you go). The social media site imposes these requirements on users who are reported by other users to be under the minimum age for the country they’re connecting from. Source: arstechnica.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:its time for game developers to bring back the cheat code:2025-10-09T19:43:50.000Z",
    "title": "It’s time for game developers to bring back the cheat code",
    "url": "https://arstechnica.com/gaming/2025/10/why-the-humble-video-game-cheat-code-is-overdue-for-a-comeback/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kyle Orland\n                ",
    "published_at": "2025-10-09T19:43:50.000Z",
    "summary_long": "For gamers of a certain age, gibberish character sequences like idkfa, torg, ABACABB, and UUDDLRLRBA are akin to long-lost magical incantations. They evoke an era where game developers frequently and routinely let players use cheat codes to customize their gameplay experience with everything from infinite health and instant level selection to full debug menus or gigantic anime-style giant-headed avatars. There were even external cheat devices that let players hack console games with cheat codes the developers never intended. While the cheat code's heyday is long in the past, the idea of letting players manipulate their gameplay experiences in similar ways is coming back into fashion for some developers. Source: arstechnica.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:the data center boom is here experts explain how to build ai:2025-10-09T18:19:20.000Z",
    "title": "The data center boom is here: Experts explain how to build AI infrastructure correctly",
    "url": "https://techxplore.com/news/2025-10-center-boom-experts-ai-infrastructure.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-09T18:19:20.000Z",
    "summary_long": "To fast-track the buildout of data centers that power artificial intelligence (AI), tech giants like Amazon, Google, Meta, Microsoft, Oracle, and OpenAI are pouring money into construction projects. Globally, companies are predicted to spend $375 billion in 2025 on AI infrastructure—a 67% surge from last year, according to an estimate by bank UBS. Source: techxplore.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:hbar tumbles 5 as government shutdown delays critical etf ap:2025-10-09T16:23:07.000Z",
    "title": "HBAR Tumbles 5% as Government Shutdown Delays Critical ETF Approvals",
    "url": "https://www.coindesk.com/markets/2025/10/09/hbar-tumbles-5-as-government-shutdown-delays-critical-etf-approvals",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "CD Analytics",
    "published_at": "2025-10-09T16:23:07.000Z",
    "summary_long": "Hedera Hashgraph’s HBAR token fell nearly 5% from $0.22 to $0.21 between Oct. 8 and 9 as institutional caution deepened amid ongoing regulatory uncertainty. Volatility surged to 5.4%, with heavy selling between 01:00 and 08:00 on Oct. 9 pushing volumes above 100 million units per hour. Source: www.coindesk.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:nhtsa launches probe into teslas full self driving tech:2025-10-09T14:11:02.000Z",
    "title": "NHTSA launches probe into Tesla’s ‘full self driving’ tech",
    "url": "https://www.engadget.com/transportation/evs/nhtsa-launches-probe-into-teslas-full-self-driving-tech-141102274.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-10-09T14:11:02.000Z",
    "summary_long": "The US National Highway Traffic Safety Administration (NHTSA) has opened a probe into 2.88 million Tesla electric vehicles currently equipped with the company's \"Full Self-Driving\" (FSD) system. As first reported by Reuters, the NHTSA has received more than 50 reports of traffic-safety violations as well as numerous crashes. The agency, which oversees the nation’s motor vehicle safety standards, said that Tesla's FSD software has \"induced vehicle behavior that violated traffic safety laws,\" with vehicles reportedly running red lights and driving against the flow of traffic. Among the reports the agency has received, six of them allege that a Tesla vehicle with FSD engaged \"approached an intersection with a red traffic signal, continued to travel into the intersection against the red light and was subsequently involved in a crash with other motor vehicles in the intersection.\" The probe will begin as a preliminary evaluation, after which the NHTSA could issue a recall if it believes the vehicles pose a great enough…",
    "tags": []
  },
  {
    "id": "fintech:bittensors decentralized ai studio yuma launches asset manag:2025-10-09T13:00:09.000Z",
    "title": "Bittensor’s Decentralized AI Studio, Yuma, Launches Asset Management Arm",
    "url": "https://www.coindesk.com/business/2025/10/09/bittensor-s-decentralized-ai-studio-yuma-launches-asset-management-arm",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Ian Allison",
    "published_at": "2025-10-09T13:00:09.000Z",
    "summary_long": "Yuma, a development studio and accelerator for decentralized AI (deAI) network Bittensor created by Barry Silbert of Digital Currency Group, has introduced Yuman Asset Management, to allow institutional and accredited investors easy access to the deAI ecosystem. Bittensor is a decentralized network for AI that rewards people for contributing data and computing power to a range of activities in the form of distinct use case-driven entities called “subnets,” that can include things like text translation, fraud detection, image recognition to more esoteric goals like predicting the structure of complex protein chains. Powered by its native token, TAO, Bittensor aspires to be the “World Wide Web” of AI, by allowing permissionless AI innovation where anyone can build, power, or access models through subnets – an alternative to the centralized infrastructure or corporate-owned AI resources. Yuma Asset Management, which comes with a $10 million anchor investment from DCG, features two fund strategies investing in subnet tokens, the protocol-native crypto assets of these…",
    "tags": []
  },
  {
    "id": "fintech:jpmorgan sees modest inflows for solana etfs despite likely :2025-10-09T12:46:09.000Z",
    "title": "JPMorgan Sees Modest Inflows for Solana ETFs Despite Likely SEC Approval",
    "url": "https://www.coindesk.com/markets/2025/10/09/jpmorgan-sees-modest-inflows-for-solana-etfs-despite-likely-sec-approval",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-10-09T12:46:09.000Z",
    "summary_long": "Spot solana (SOL) exchange-traded funds (ETFS) are unlikely to draw major investor inflows even if approved this week, according to a Wednesday report from Wall Street bank JPMorgan (JPM). Solana ETFs could see about $1.5 billion in first-year inflows, roughly one-seventh of ether’s (ETH), analysts led by Nikolaos Panigirtzoglou wrote. But the analysts warned that figure could be lower due to waning on-chain activity, heavy memecoin trading, investor fatigue from multiple launches, and competition from diversified crypto index products such as those tied to the S&P Dow Jones Indices Digital Markets 50. Corporate treasuries could also divert demand away from spot ETFs. Source: www.coindesk.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:householdbattery startup raises 1 billion for expansion:2025-10-09T12:37:19.000Z",
    "title": "Household-battery startup raises $1 billion for expansion",
    "url": "https://techxplore.com/news/2025-10-household-battery-startup-billion-expansion.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-09T12:37:19.000Z",
    "summary_long": "Household-battery startup raises $1 billion for expansion Source: techxplore.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:someone programmed a 65year old computer to play boards of c:2025-10-09T22:08:57.000Z",
    "title": "Someone programmed a 65-year old computer to play Boards of Canada's 'Olson'",
    "url": "https://www.engadget.com/audio/someone-programmed-a-65-year-old-computer-to-play-boards-of-canadas-olson-220857441.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-10-09T22:08:57.000Z",
    "summary_long": "The Programmed Data Processor-1 (PDP-1) is perhaps most recognizable as the home of Spacewar!, one of the world's first video games, but as the video above proves, it also works as an enormous and very slow iPod, too. In the video, Boards of Canada's \"Olson\" is playing off of paper tape that's carefully fed and programmed into the PDP-1 by engineer and Computer History Museum docent Peter Samson. It's the final product of Joe Lynch's PDP-1.music project, an attempt to translate the short and atmospheric song into something the PDP-1 can reproduce. As Lynch writes on GitHub, the \"Harmony Compiler\" used to translate \"Olson\" to paper tape was actually created by Samson to play audio through four of computer's lightbulbs while he was a student at MIT in the 1960s. Source: www.engadget.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:python 31212 31114 31019 and 3924 are now available:2025-10-09T21:00:00.003Z",
    "title": "Python 3.12.12, 3.11.14, 3.10.19 and 3.9.24 are now available!",
    "url": "https://pythoninsider.blogspot.com/2025/10/python-31212-31114-31019-and-3924-are.html",
    "category_id": "code",
    "region": "Global",
    "source": "pythoninsider.blogspot.com",
    "author": "Thomas Wouters",
    "published_at": "2025-10-09T21:00:00.003Z",
    "summary_long": "OLD-TIMER RELEASE PARTY We couldn’t just let Hugo have fun with 3.14.0, so here are new security releases of the venerated Python versions, 3.12 through 3.9! SECURITY CONTENT IN THESE RELEASES XML-RELATED * gh-139312: Upgraded bundled libexpat to 2.7.3 to fix CVE-2025-59375 * gh-139400: xml.parsers.expat: Made sure that parent Expat parsers are only garbage-collected once they are no longer referenced by subparsers created by ExternalEntityParserCreate(). ARCHIVE-RELATED * gh-130577: tarfile now validates archives to ensure member offsets are non-negative. * gh-139700: Now checking consistency of the zip64 end of central directory record. Source: pythoninsider.blogspot.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the esas power of play report paints a portrait of the the w:2025-10-09T20:51:05.000Z",
    "title": "The ESA's Power of Play report paints a portrait of the the world's gamers",
    "url": "https://www.engadget.com/the-esas-power-of-play-report-paints-a-portrait-of-the-the-worlds-gamers-205105064.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-09T20:51:05.000Z",
    "summary_long": "The Entertainment Software Association has released its Power of Play report, which presents a snapshot of who is playing video games, and why, all around the world. There are a lot of interesting data points here from more than 24,000 respondents, all of whom are older than 16 and play at least weekly. The doubters who think gaming is just for kids may be surprised to learn that the average age of the respondents is 41 years old, and the gender split is nearly even between men and women. One of the most intriguing aspects to the report were the benefits people said they received from playing games. Source: www.engadget.com. Date: 2025-10-09. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]