[
  {
    "id": "bigtech:trump admin pressured facebook into removing icetracking gro:2025-10-14T20:44:02.000Z",
    "title": "Trump admin pressured Facebook into removing ICE-tracking group",
    "url": "https://arstechnica.com/tech-policy/2025/10/trump-admin-pressured-facebook-into-removing-ice-tracking-group/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-10-14T20:44:02.000Z",
    "summary_long": "Attorney General Pam Bondi today said that Facebook removed an ICE-tracking group after \"outreach\" from the Department of Justice. \"Today following outreach from @thejusticedept, Facebook removed a large group page that was being used to dox and target @ICEgov agents in Chicago,\" Bondi wrote in an X post. Bondi alleged that a \"wave of violence against ICE has been driven by online apps and social media campaigns designed to put ICE officers at risk just for doing their jobs.\" She added that the DOJ \"will continue engaging tech companies to eliminate platforms where radicals can incite imminent violence against federal law enforcement.\" When contacted by Ars, Facebook owner Meta said the group \"was removed for violating our policies against coordinated harm.\" Meta didn't describe any specific violation but directed us to a policy against \"coordinating harm and promoting crime,\" which includes a prohibition against \"outing the undercover status of law enforcement, military, or security personnel.\" Read full article Comments Source:…",
    "tags": []
  },
  {
    "id": "bigtech:openai unveils wellness council suicide prevention expert no:2025-10-14T17:00:40.000Z",
    "title": "OpenAI unveils “wellness” council; suicide prevention expert not included",
    "url": "https://arstechnica.com/tech-policy/2025/10/openai-unveils-wellness-council-suicide-prevention-expert-not-included/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-10-14T17:00:40.000Z",
    "summary_long": "Ever since a lawsuit accused ChatGPT of becoming a teen's \"suicide coach,\" OpenAI has been scrambling to make its chatbot safer. Today, the AI firm unveiled the experts it hired to help make ChatGPT a healthier option for all users. In a press release, OpenAI explained its Expert Council on Wellness and AI started taking form after OpenAI began informally consulting with experts on parental controls earlier this year. Now it's been formalized, bringing together eight \"leading researchers and experts with decades of experience studying how technology affects our emotions, motivation, and mental health\" to help steer ChatGPT updates. Source: arstechnica.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:windows 10 support ends today but its just the first of many:2025-10-14T14:58:23.000Z",
    "title": "Windows 10 support “ends” today, but it’s just the first of many deaths",
    "url": "https://arstechnica.com/gadgets/2025/10/windows-10-support-ends-today-but-its-just-the-first-of-many-deaths/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2025-10-14T14:58:23.000Z",
    "summary_long": "Today is the official end-of-support date for Microsoft's Windows 10. That doesn't mean these PCs will suddenly stop working, but if you don't take action, it does mean your PC has received its last regular security patches and that Microsoft is washing its hands of technical support. This end-of-support date comes about a decade after the initial release of Windows 10, which is typical for most Windows versions. But it comes just four years after Windows 10 was replaced by Windows 11, a version with stricter system requirements that left many older-but-still-functional PCs with no officially supported upgrade path. Source: arstechnica.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the company discord blamed for its recent breach says it was:2025-10-14T18:59:39.000Z",
    "title": "The company Discord blamed for its recent breach says it wasn't hacked",
    "url": "https://www.engadget.com/cybersecurity/the-company-discord-blamed-for-its-recent-breach-says-it-wasnt-hacked-175536278.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-10-14T18:59:39.000Z",
    "summary_long": "Customer service support company 5CA has released a statement contradicting claims by Discord that it was the victim of a hack last month. On October 3, Discord disclosed a data breach that the company says included a “small number” of government IDs like driver’s licenses and passports, which some users had submitted to verify their ages. Days later the company updated its statement to name 5CA as the target of the hack, which Discord contracts as part of its customer service efforts. It also disclosed that the \"small number\" of government IDs encompasses roughly 70,000 users. Source: www.engadget.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex scrubs launch 2nd batch of satellites for space devel:2025-10-14T21:52:41.000Z",
    "title": "SpaceX scrubs launch 2nd batch of satellites for Space Development Agency constellation",
    "url": "https://spaceflightnow.com/2025/10/14/live-coverage-spacex-to-launch-2nd-batch-of-satellites-for-space-development-agency-constellation/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-14T21:52:41.000Z",
    "summary_long": "Update Oct. 14, 6:45 p.m. EDT (2245 UTC): SpaceX scrubbed Tuesday’s launch attempt. The Space Development Agency is set to add another 21 satellites to its burgeoning low Earth orbit constellation thanks to a launch onboard a SpaceX Falcon 9 rocket. Source: spaceflightnow.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:robot backpack drone launches drives and flies to tackle eme:2025-10-14T20:56:04.000Z",
    "title": "Robot 'backpack' drone launches, drives and flies to tackle emergencies",
    "url": "https://techxplore.com/news/2025-10-robot-backpack-drone-flies-tackle.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-14T20:56:04.000Z",
    "summary_long": "Robot 'backpack' drone launches, drives and flies to tackle emergencies Source: techxplore.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:rocket lab launches 7th strix earth observation satellites f:2025-10-14T20:49:30.000Z",
    "title": "Rocket Lab launches 7th StriX Earth observation satellites for Japan-based Synspective",
    "url": "https://spaceflightnow.com/2025/10/14/rocket-lab-launches-7th-strix-earth-observation-satellites-for-japan-based-synspective/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-14T20:49:30.000Z",
    "summary_long": "Japan-based Earth observation company, Synspective, launched its seventh StriX satellite into low Earth orbit, part of a multi-launch deal with Rocket Lab. On Wednesday morning in Mahia, New Zealand (Tuesday afternoon on the East Coast of the U.S.), a Rocket Lab Electron rocket took flight from Pad A at Launch Complex 1 to begin a roughly 50-minute-long mission. Launch teams confirmed a nominal deployment of the satellite into a 583 km circular orbit. The mission, dubbed ‘Owl New World’, continued the avian theming to Synspective’s missions with Rocket Lab. Source: spaceflightnow.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta removes facebook group for tracking ice agents after do:2025-10-14T20:34:29.000Z",
    "title": "Meta removes Facebook Group for tracking ICE agents after DOJ pressure",
    "url": "https://www.engadget.com/meta-removes-facebook-group-for-tracking-ice-agents-after-doj-pressure-203429574.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-14T20:34:29.000Z",
    "summary_long": "Attorney General Pam Bondi posted on X that the Department of Justice contacted Facebook in order to have a group removed that she claimed \"was being used to dox and target\" US Immigration and Customs Enforcement agents operating in Chicago. We reached out to Meta for confirmation and a representative said, \"This Group was removed for violating our policies against coordinated harm,\" however they did not confirm the name of the group or whether the DOJ was involved in the action. Officers for the immigration agency have reportedly been moving through Chicago with facial coverings, no name tags and sometimes in vehicles with no license plates, although a US District Judge ruled that all ICE agents who are not undercover are required to display visible identification while operating in the Chicagoland area. The Department of Justice has demanded that other tech companies remove content the current administration has deemed critical of its immigration policies and practices. Source: www.engadget.com. Date: 2025-10-14.",
    "tags": []
  },
  {
    "id": "code:python 3139 is now available:2025-10-14T19:07:00.004Z",
    "title": "Python 3.13.9 is now available!",
    "url": "https://pythoninsider.blogspot.com/2025/10/python-3139-is-now-available.html",
    "category_id": "code",
    "region": "Global",
    "source": "pythoninsider.blogspot.com",
    "author": "Thomas Wouters",
    "published_at": "2025-10-14T19:07:00.004Z",
    "summary_long": "PYTHON 3.13.9 3.13.9 is an expedited release containing a fix for one specific regression in Python 3.13.8: * gh-139783: Fix inspect.getsourcelines for the case when a decorator is followed by a comment or an empty line. There are no other changes in this release, compared to 3.13.8. MORE RESOURCES * 3.13 online documentation * PEP 745, 3.13 release schedule * Report bugs at github.com/python/cpython/issues * Help fund Python and its community ENJOY THE NEW RELEASES Thanks to all of the many volunteers who help make Python Development and this release possible! Please consider supporting our efforts by volunteering yourself or through organisation contributions to the Python Software Foundation. Source: pythoninsider.blogspot.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:stripes bridge applies for national bank trust charter to ex:2025-10-14T17:40:20.000Z",
    "title": "Stripe's Bridge Applies for National Bank Trust Charter to Expand Stablecoin Business",
    "url": "https://www.coindesk.com/business/2025/10/14/stripe-s-bridge-applies-for-national-bank-trust-charter-to-expand-stablecoin-business",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-10-14T17:40:20.000Z",
    "summary_long": "Bridge, the stablecoin infrastructure company acquired by payments giant Stripe, applied for a national bank trust charter with the U.S. Office of the Comptroller of the Currency (OCC), co-founder Zach Abrams said on Wednesday. The move would put the firm under federal regulatory oversight if approved by the regulator. Through ... Source: www.coindesk.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:chipmaker nexperia says banned from exporting from china:2025-10-14T17:30:03.000Z",
    "title": "Chipmaker Nexperia says banned from exporting from China",
    "url": "https://techxplore.com/news/2025-10-chipmaker-nexperia-exporting-china.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-14T17:30:03.000Z",
    "summary_long": "Chipmaker Nexperia says banned from exporting from China Source: techxplore.com. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:hype hybrid planning with ego proposalconditioned prediction:2025-10-14T17:11:04.000Z",
    "title": "HYPE: Hybrid Planning with Ego Proposal-Conditioned Predictions",
    "url": "http://arxiv.org/abs/2510.12733v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Hang Yu",
    "published_at": "2025-10-14T17:11:04.000Z",
    "summary_long": "Safe and interpretable motion planning in complex urban environments needs to reason about bidirectional multi-agent interactions. This reasoning requires to estimate the costs of potential ego driving maneuvers. Many existing planners generate initial trajectories with sampling-based methods and refine them by optimizing on learned predictions of future environment states, which requires a cost function that encodes the desired vehicle behavior. Designing such a cost function can be very challenging, especially if a wide range of complex urban scenarios has to be considered. Source: arxiv.org. Date: 2025-10-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]