[
  {
    "id": "bigtech:nationstate hackers deliver malware from bulletproof blockch:2025-10-16T20:40:49.000Z",
    "title": "Nation-state hackers deliver malware from “bulletproof” blockchains",
    "url": "https://arstechnica.com/security/2025/10/hackers-bullet-proof-hosts-deliver-malware-from-blockchains/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-10-16T20:40:49.000Z",
    "summary_long": "Hacking groups—at least one of which works on behalf of the North Korean government—have found a new and inexpensive way to distribute malware from “bulletproof” hosts: stashing them on public cryptocurrency blockchains. In a Thursday post, members of the Google Threat Intelligence Group said the technique provides the hackers with their own “bulletproof” host, a term that describes cloud platforms that are largely immune from takedowns by law enforcement and pressure from security researchers. More traditionally, these hosts are located in countries without treaties agreeing to enforce criminal laws from the US and other nations. These services often charge hefty sums and cater to criminals spreading malware or peddling child sexual abuse material and wares sold in crime-based flea markets. Source: arstechnica.com. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:spacex has plans to launch falcon heavy from californiaif an:2025-10-16T15:40:14.000Z",
    "title": "SpaceX has plans to launch Falcon Heavy from California—if anyone wants it to",
    "url": "https://arstechnica.com/space/2025/10/spacex-has-plans-to-launch-falcon-heavy-from-california-if-anyone-wants-it-to/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-10-16T15:40:14.000Z",
    "summary_long": "The Department of the Air Force has approved SpaceX’s plans to launch up to 100 missions per year from Vandenberg Space Force Base in California. This would continue the tectonic turnaround at the spaceport on California’s Central Coast. Five years ago, Vandenberg hosted just a single orbital launch. This year’s number stands at 51 orbital flights, or 53 launches if you count a pair of Minuteman missile tests, the most in a single calendar year at Vandenberg since the early 1970s. Source: arstechnica.com. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:why world models are the next big thing in ai:2025-10-17T01:30:00.000Z",
    "title": "Why world models are the next big thing in AI",
    "url": "https://www.theverge.com/column/801370/ai-world-models-general-intuition-medal",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Alex Heath",
    "published_at": "2025-10-17T01:30:00.000Z",
    "summary_long": "Around the middle of last year, Pim de Witte started reaching out to a handful of prominent AI labs to see if they'd be interested in using data from Medal, his popular video game clipping platform, to train their agents. Within weeks, it became clear that Medal's data was more valuable to the labs than he expected. \"We received multiple acquisition offers very quickly,\" he told me. (He declined to name names, but it has been reported that OpenAI offered $500 million.) \"Initially, we were quite in … Read the full story at The Verge. Source: www.theverge.com. Date: 2025-10-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:daylight raises 75m to build decentralized energy network:2025-10-16T18:49:43.000Z",
    "title": "Daylight Raises $75M to Build Decentralized Energy Network",
    "url": "https://www.coindesk.com/business/2025/10/16/daylight-raises-usd75m-to-build-decentralized-energy-network",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jamie Crawley",
    "published_at": "2025-10-16T18:49:43.000Z",
    "summary_long": "Daylight Raises $75M to Build Decentralized Energy Network Source: www.coindesk.com. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:orion spacecraft arrives at vab ahead of stacking for artemi:2025-10-17T04:50:02.000Z",
    "title": "Orion spacecraft arrives at VAB ahead of stacking for Artemis 2",
    "url": "https://spaceflightnow.com/2025/10/17/orion-spacecraft-arrives-at-vab-ahead-of-stacking-for-artemis-2/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-17T04:50:02.000Z",
    "summary_long": "NASA Orion spacecraft made its penultimate terrestrial roadtrip late Thursday evening when it cruised into the Vehicle Assembly Building at the Kennedy Space Center. The next time it hits the road will be atop the fully assembled Space Launch System rocket for final prelaunch preparations for Artemis 2 at the launch pad. The spacecraft, named “Integrity” by its four-member crew,” slowly made the roughly seven-mile journey from the Launch Abort System Facility to the VAB, arriving at the entrance to High Bay 4 around midnight (0400 UTC). The trek came almost four years to the day after NASA rolled the Orion spacecraft used on the Artemis 1 mission to the VAB. Source: spaceflightnow.com. Date: 2025-10-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:learning when not to learn risksensitive abstention in bandi:2025-10-16T17:01:57.000Z",
    "title": "Learning When Not to Learn: Risk-Sensitive Abstention in Bandits with Unbounded Rewards",
    "url": "http://arxiv.org/abs/2510.14884v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sarah Liaw",
    "published_at": "2025-10-16T17:01:57.000Z",
    "summary_long": "In high-stakes AI applications, even a single action can cause irreparable damage. However, nearly all of sequential decision-making theory assumes that all errors are recoverable (e.g., by bounding rewards). Standard bandit algorithms that explore aggressively may cause irreparable damage when this assumption fails. Some prior work avoids irreparable errors by asking for help from a mentor, but a mentor may not always be available. Source: arxiv.org. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:from loop nests to silicon mapping ai workloads onto amd npu:2025-10-16T16:49:05.000Z",
    "title": "From Loop Nests to Silicon: Mapping AI Workloads onto AMD NPUs with MLIR-AIR",
    "url": "http://arxiv.org/abs/2510.14871v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Erwei Wang",
    "published_at": "2025-10-16T16:49:05.000Z",
    "summary_long": "General-purpose compilers abstract away parallelism, locality, and synchronization, limiting their effectiveness on modern spatial architectures. As modern computing architectures increasingly rely on fine-grained control over data movement, execution order, and compute placement for performance, compiler infrastructure must provide explicit mechanisms for orchestrating compute and data to fully exploit such architectures. We introduce MLIR-AIR, a novel, open-source compiler stack built on MLIR that bridges the semantic gap between high-level workloads and fine-grained spatial architectures such as AMD's NPUs. MLIR-AIR defines the AIR dialect, which provides structured representations for asynchronous and hierarchical operations across compute and memory resources. Source: arxiv.org. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:benchmarking multimodal large language models for face recog:2025-10-16T16:42:27.000Z",
    "title": "Benchmarking Multimodal Large Language Models for Face Recognition",
    "url": "http://arxiv.org/abs/2510.14866v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Hatef Otroshi Shahreza",
    "published_at": "2025-10-16T16:42:27.000Z",
    "summary_long": "Multimodal large language models (MLLMs) have achieved remarkable performance across diverse vision-and-language tasks. However, their potential in face recognition remains underexplored. In particular, the performance of open-source MLLMs needs to be evaluated and compared with existing face recognition models on standard benchmarks with similar protocol. In this work, we present a systematic benchmark of state-of-the-art MLLMs for face recognition on several face recognition datasets, including LFW, CALFW, CPLFW, CFP, AgeDB and RFW. Source: arxiv.org. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:waymo will also drive for doordash in phoenix:2025-10-16T21:35:35.000Z",
    "title": "Waymo will also drive for DoorDash in Phoenix",
    "url": "https://www.engadget.com/transportation/waymo-will-also-drive-for-doordash-in-phoenix-213535127.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-16T21:35:35.000Z",
    "summary_long": "Waymo has announced a new partnership with DoorDash that will make the company's self-driving cars a delivery option for users in Phoenix, Arizona. You can already hail a ride in Waymo’s Arizona service area, but this new partnership will give the company's cars something to do when they're not transporting human cargo. To start, Waymo says that deliveries will be limited to things you can order through DashMart, DoorDash's storefront for convenience and grocery stores. Eventually, though, deliveries will \"include more local Phoenix merchants and a wider variety of offerings.\" > Phoenix, your next delivery just took a step into the future! Source: www.engadget.com. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apples m6 macbook pro generation will reportedly offer touch:2025-10-16T20:30:29.000Z",
    "title": "Apple's M6 MacBook Pro generation will reportedly offer touchscreens",
    "url": "https://www.engadget.com/computing/laptops/apples-m6-macbook-pro-generation-will-reportedly-offer-touchscreens-203029809.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-16T20:30:29.000Z",
    "summary_long": "Apple insiders are pointing to a tactile new future for the company's laptops. Last month, analyst Ming-Chi Kuo suggested that Apple would incorporate touchscreens into MacBooks some time in the next few years, \"further blurring the line with the iPad.\" Today, Mark Gurman at Bloomberg confirmed that prediction, sharing even more specifics about the touchscreen approach for a MacBook Pro that is currently projected for release in late 2026 or early 2027. Gurman reports that the touchscreen laptops are internally known as K114 and K116, and will run on M6 chips; Apple just introduced the M5 generation of its silicon for this year's iteration of the MacBook Pro and iPad Pro. His sources also say that the laptops will have OLED screens and will boast \"a reinforced hinge and screen hardware\" so that the display portion doesn't move when being used. Source: www.engadget.com. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "consumer:meta is shutting down its desktop messenger app:2025-10-16T20:25:39.000Z",
    "title": "Meta is shutting down its desktop Messenger app",
    "url": "https://www.engadget.com/meta-is-shutting-down-its-desktop-messenger-app-202539375.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-16T20:25:39.000Z",
    "summary_long": "Meta is shutting down its Messenger app for macOS and Windows and pushing users to the web. Meta confirmed over email to Engadget that the app will be fully shutdown on December 15, after which the easiest ways to access Messenger chats when you're not on your phone will be the Facebook app on Windows, or the Facebook and Messenger websites. The company hasn't provided an explanation for why it's abandoning its desktop Messenger apps, but Meta's support article does say that users will receive a notification informing them of the shutdown, and will be blocked from accessing the app after December 15. In order for your chats to be saved going forward, the company says you'll have to turn on secure storage and add a pin code to your account. Source: www.engadget.com. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:indias infosys raises bottom end of revenue outlook:2025-10-16T17:09:35.000Z",
    "title": "India's Infosys raises bottom end of revenue outlook",
    "url": "https://techxplore.com/news/2025-10-india-infosys-bottom-revenue-outlook.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-16T17:09:35.000Z",
    "summary_long": "India's Infosys raises bottom end of revenue outlook Source: techxplore.com. Date: 2025-10-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]