[
  {
    "id": "bigtech:hps eliteboard g1a is a ryzenpowered windows 11 pc in a memb:2026-01-06T22:40:08.000Z",
    "title": "HP’s EliteBoard G1a is a Ryzen-powered Windows 11 PC in a membrane keyboard",
    "url": "https://arstechnica.com/gadgets/2026/01/hps-eliteboard-g1a-is-a-ryzen-powered-windows-11-pc-in-a-membrane-keyboard/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Scharon Harding\n                ",
    "published_at": "2026-01-06T22:40:08.000Z",
    "summary_long": "As a Windows system built inside of a functioning membrane keyboard, the HP EliteBoard G1a announced today is a more accessible alternative to other keyboard-PCs. The Commodore 64 made the keyboard-PC famous in the 1980s, but the keyboard-PC space has been dominated by the Raspberry Pi. In 2019, the single-board computer (SBC) maker released the Raspberry Pi 400, which is essentially a Raspberry Pi 4 SBC inside a case that also functions as a keyboard for the system. USB, HDMI, and Ethernet ports, plus a GPIO header and native Raspberry Pi OS Linux distribution add up to a low-end desktop computer experience that only costs $100. Source: arstechnica.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:letting prisons jam contraband phones is a bad idea phone co:2026-01-06T21:11:54.000Z",
    "title": "Letting prisons jam contraband phones is a bad idea, phone companies tell FCC",
    "url": "https://arstechnica.com/tech-policy/2026/01/letting-prisons-jam-contraband-phones-is-a-bad-idea-phone-companies-tell-fcc/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2026-01-06T21:11:54.000Z",
    "summary_long": "A Federal Communications Commission proposal to let state and local prisons jam contraband cell phones has support from Republican attorneys general and prison phone companies but faces opposition from wireless carriers that say it would disrupt lawful communications. Groups dedicated to Wi-Fi and GPS also raised concerns in comments to the FCC. \"Jamming will block all communications, not just communications from contraband devices,\" wireless lobby group CTIA said in December 29 comments in response to Chairman Brendan Carr's proposal. The CTIA said that \"jamming blocks all communications, including lawful communications such as 911 calling,\" and argued that the FCC \"has no authority to allow jamming.\" CTIA members AT&T and Verizon expressed their displeasure in separate comments to the FCC. Source: arstechnica.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:appeals court agrees that congress blocked cuts to research :2026-01-06T18:05:05.000Z",
    "title": "Appeals court agrees that Congress blocked cuts to research costs",
    "url": "https://arstechnica.com/science/2026/01/appeals-court-upholds-block-on-one-of-trumps-cuts-to-research-funds/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    John Timmer\n                ",
    "published_at": "2026-01-06T18:05:05.000Z",
    "summary_long": "One of the first signs of what would become an ongoing attack on scientific research came when the Trump administration ordered the National Institutes of Health (NIH) to radically reduce research funding for universities. These funds, termed indirect costs, are awarded when researchers at an institution receive a grant. They cover costs that aren't directly associated with the research project, such as utilities, facilities for research animals, and building maintenance. Previously, these costs had been the subject of negotiations and audits, with indirect cost rates for universities in more expensive locations exceeding half the value of the portion of the grant that goes to the researcher. Source: arstechnica.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa awards launch range contract for wallops flight facilit:2026-01-06T21:19:24.000Z",
    "title": "NASA Awards Launch Range Contract for Wallops Flight Facility",
    "url": "https://www.nasa.gov/news-release/nasa-awards-launch-range-contract-for-wallops-flight-facility/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Tiernan P. Doyle",
    "published_at": "2026-01-06T21:19:24.000Z",
    "summary_long": "Credit: NASA NASA has selected ARES Technical Services Corporation of McLean, Virginia, to provide launch range operations support at the agency’s Wallops Flight Facility in Virginia. The Wallops Range Contract has a total potential value of $339.8 million with a one-year base period expected to begin Tuesday, Feb. 10, and four one-year option periods that if exercised would extend it to 2031. The contract includes a cost-plus-fixed-fee core with an indefinite-delivery/indefinite-quantity component and the ability to issue cost-plus-fixed-fee or firm-fixed-price task orders. Source: www.nasa.gov. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:lenovo just revealed a concept for aipowered smartglasses at:2026-01-07T01:00:57.000Z",
    "title": "Lenovo just revealed a concept for AI-powered smartglasses at CES",
    "url": "https://www.engadget.com/wearables/lenovo-just-revealed-a-concept-for-ai-powered-smartglasses-at-ces-010057822.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2026-01-07T01:00:57.000Z",
    "summary_long": "Lenovo just revealed a new smartglasses concept design at CES 2026. The appropriately-named Lenovo AI Glasses Concept promises to transform \"how users interact with their surroundings and unifies their workflow.\" They look like a standard pair of specs and not all that different from something like Meta's Ray-Ban Display glasses. A pair weighs just 45 grams and the battery lasts eight hours, which is just enough time to get through a standard workday. The glasses are wirelessly tethered to a smart device, which is what does most of the computational heavy lifting. Source: www.engadget.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:lenovo reveals a steamos variant of the legion go 2 at ces:2026-01-07T01:00:00.000Z",
    "title": "Lenovo reveals a SteamOS variant of the Legion Go 2 at CES",
    "url": "https://www.engadget.com/gaming/pc/lenovo-reveals-a-steamos-variant-of-the-legion-go-2-at-ces-010000852.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2026-01-07T01:00:00.000Z",
    "summary_long": "If you saw Lenovo's Legion Go 2 launch last year and thought, \"I'll wait for the SteamOS version,\" well, you'll have to wait a little longer. But at least now it's official. At CES 2026, the company revealed the Legion Go 2, Powered by SteamOS. The Valve-friendly variant of the gaming handheld arrives in June, starting at a pricey $1,199. Source: www.engadget.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:unified thinker a general reasoning modular core for image g:2026-01-06T15:59:33.000Z",
    "title": "Unified Thinker: A General Reasoning Modular Core for Image Generation",
    "url": "https://arxiv.org/abs/2601.03127v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sashuai Zhou",
    "published_at": "2026-01-06T15:59:33.000Z",
    "summary_long": "Despite impressive progress in high-fidelity image synthesis, generative models still struggle with logic-intensive instruction following, exposing a persistent reasoning--execution gap. Meanwhile, closed-source systems (e.g., Nano Banana) have demonstrated strong reasoning-driven image generation, highlighting a substantial gap to current open-source models. We argue that closing this gap requires not merely better visual generators, but executable reasoning: decomposing high-level intents into grounded, verifiable plans that directly steer the generative process. To this end, we propose Unified Thinker, a task-agnostic reasoning architecture for general image generation, designed as a unified planning core that can plug into diverse generators and workflows. Source: arxiv.org. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:gradellm gradientbased explanations for decoderonly llms:2026-01-06T15:22:39.000Z",
    "title": "Grad-ELLM: Gradient-based Explanations for Decoder-only LLMs",
    "url": "https://arxiv.org/abs/2601.03089v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Xin Huang",
    "published_at": "2026-01-06T15:22:39.000Z",
    "summary_long": "Large Language Models (LLMs) have demonstrated remarkable capabilities across diverse tasks, yet their black-box nature raises concerns about transparency and faithfulness. Input attribution methods aim to highlight each input token's contributions to the model's output, but existing approaches are typically model-agnostic, and do not focus on transformer-specific architectures, leading to limited faithfulness. To address this, we propose Grad-ELLM, a gradient-based attribution method for decoder-only transformer-based LLMs. By aggregating channel importance from gradients of the output logit with respect to attention layers and spatial importance from attention maps, Grad-ELLM generates heatmaps at each generation step without requiring architectural modifications. Source: arxiv.org. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:incontext reinforcement learning through bayesian fusion of :2026-01-06T13:41:31.000Z",
    "title": "In-Context Reinforcement Learning through Bayesian Fusion of Context and Value Prior",
    "url": "https://arxiv.org/abs/2601.03015v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Anaïs Berkes",
    "published_at": "2026-01-06T13:41:31.000Z",
    "summary_long": "In-context reinforcement learning (ICRL) promises fast adaptation to unseen environments without parameter updates, but current methods either cannot improve beyond the training distribution or require near-optimal data, limiting practical adoption. We introduce SPICE, a Bayesian ICRL method that learns a prior over Q-values via deep ensemble and updates this prior at test-time using in-context information through Bayesian updates. To recover from poor priors resulting from training on sub-optimal data, our online inference follows an Upper-Confidence Bound rule that favours exploration and adaptation. We prove that SPICE achieves regret-optimal behaviour in both stochastic bandits and finite-horizon MDPs, even when pretrained only on suboptimal trajectories. Source: arxiv.org. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:supernova remnant video from nasas chandra is decades in mak:2026-01-06T21:30:45.000Z",
    "title": "Supernova Remnant Video From NASA’s Chandra Is Decades in Making",
    "url": "https://www.nasa.gov/missions/chandra/supernova-remnant-video-from-nasas-chandra-is-decades-in-making/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lee Mohon",
    "published_at": "2026-01-06T21:30:45.000Z",
    "summary_long": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video A new video shows changes in Kepler’s Supernova Remnant using data from NASA’s Chandra X-ray Observatory captured over more than two and a half decades with observations taken in 2000, 2004, 2006, 2014, and 2025. In this video, which is the longest-spanning one ever released by Chandra, X-rays (blue) from the telescope have been combined with an optical image (red, green, and blue) from Pan-STARRS. X-ray: NASA/CXC/SAO; Optical: Pan-STARRS A new video shows the evolution of Kepler’s Supernova Remnant using data from NASA’s Chandra X-ray Observatory captured over more than two and a half decades. Kepler’s Supernova Remnant, named after the German astronomer Johannes Kepler, was first spotted in the night sky in 1604. Source: www.nasa.gov. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:motorola expands its moto things lineup with a new bluetooth:2026-01-07T01:00:00.000Z",
    "title": "Motorola expands its Moto Things lineup with a new Bluetooth tracker, stylus and smartwatch",
    "url": "https://www.engadget.com/mobile/smartphones/motorola-expands-its-moto-things-lineup-with-a-new-bluetooth-tracker-stylus-and-smartwatch-010000669.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2026-01-07T01:00:00.000Z",
    "summary_long": "After kicking off its Moto Things accessory line with wireless earbuds, a Bluetooth tracker and a cheap smartwatch in 2024, Motorola is doubling down. At CES 2026, the company is announcing a sequel to its tracker, the Moto Tag 2, a stylus for its new folding phone, the Moto Pen Ultra and a more premium smartwatch called the Moto Watch. The Moto Watch has a 47mm round face with a stainless steel crown and an aluminum frame. The smartwatch comes with a PANTONE \"Volcanic Ash\" silicone band, but is designed to support third-party 22mm bands, too, which greatly expands its customization options. Source: www.engadget.com. Date: 2026-01-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:first sky map from nasas spherex observatory:2026-01-06T15:42:34.000Z",
    "title": "First Sky Map from NASA’s SPHEREx Observatory",
    "url": "https://www.nasa.gov/image-article/first-sky-map-from-nasas-spherex-observatory/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-01-06T15:42:34.000Z",
    "summary_long": "NASA’s SPHEREx Observatory has mapped the entire sky in 102 infrared colors, as seen here in this image released on Dec. 18, 2025. This image features a selection of colors emitted primarily by stars (blue, green, and white), hot hydrogen gas (blue), and cosmic dust (red). NASA/JPL-Caltech NASA’s SPHEREx Observatory has mapped the entire sky in 102 infrared colors, as seen here in this image released on Dec. Source: www.nasa.gov. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]