[
  {
    "id": "bigtech:first look dysons spotscrub ai robot seeks out stains:2025-09-06T07:00:00.000Z",
    "title": "First look: Dyson’s Spot+Scrub Ai robot seeks out stains",
    "url": "https://www.theverge.com/ifa-berlin/772423/dyson-spot-scrub-ai-robot-vacuum-mop-multifunction-dock-first-look",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Jennifer Pattison Tuohy",
    "published_at": "2025-09-06T07:00:00.000Z",
    "summary_long": "A robot vacuum on a hardwood floor in front of a large charging dock. [https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/IMG_6285.jpeg?quality=90&strip=all&crop=0,0,100,100] The Dyson Spot+Scrub Ai is the first robot vacuum mop from the company and the first to use a multifunctional dock. The Dyson Spot+Scrub Ai Robot is the company's first combination robot vacuum and mop. It debuted at Dyson's Berlin store during the IFA tech show this week and is a follow-up to the company's 360 VisNav robot vacuum, which launched in 2023. Featuring a new round design, a self-cleaning roller mop, lidar navigation, and Dyson's first multifunctional dock, the Spot+Scrub also comes with an \"AI\" moniker because it's 2025 and doesn't everything? I spent some hands-on time with Dyson's newest robot floor cleaner and came away underwhelmed. Dyson's traditional vacuums set high expectations, but its robot versions have yet to meet them. I didn't … Read the full story at The Verge. A robot vacuum on a hardwood floor in front of a large…",
    "tags": []
  },
  {
    "id": "fintech:coinbases goto ai coding tool found vulnerable to copypasta :2025-09-06T04:30:00.000Z",
    "title": "Coinbase’s Go-To AI Coding Tool Found Vulnerable to ‘CopyPasta’ Exploit",
    "url": "https://www.coindesk.com/tech/2025/09/06/coinbase-s-go-to-ai-coding-tool-found-vulnerable-to-copypasta-exploit",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Shaurya Malwa",
    "published_at": "2025-09-06T04:30:00.000Z",
    "summary_long": "A new exploit targeting AI coding assistants has raised alarms across the developer community, opening companies such as crypto exchange Coinbase to the risk of potential attacks if extensive safeguards aren’t in place. Cybersecurity firm HiddenLayer disclosed Thursday that attackers can weaponize a so-called “CopyPasta License Attack” to inject hidden instructions into common developer files. The exploit primarily affects Cursor, an AI-powered coding tool that Coinbase engineers said in August was among the team's AI tools. Cursor is said to have been used by “every Coinbase engineer.” HOW THE ATTACK WORKS The technique takes advantage of how AI coding assistants treat licensing files as authoritative instructions. By embedding malicious payloads in hidden markdown comments within files such as LICENSE.txt, the exploit convinces the model that these instructions must be preserved and replicated across every file it touches. Once the AI accepts the “license” as legitimate, it automatically propagates the injected code into new or edited files, spreading without direct user…",
    "tags": []
  },
  {
    "id": "fintech:cardanos bearish retail crowd hands whales a buying opportun:2025-09-06T03:30:00.000Z",
    "title": "Cardano’s Bearish Retail Crowd Hands Whales a Buying Opportunity",
    "url": "https://www.coindesk.com/markets/2025/09/06/cardano-s-bearish-retail-crowd-hands-whales-a-buying-window",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Shaurya Malwa",
    "published_at": "2025-09-06T03:30:00.000Z",
    "summary_long": "Cardano’s retail base has flipped bearish after weeks of drawdowns, setting up conditions where whales could step in. Data from Santiment shows ADA’s bullish-to-bearish commentary ratio slumped to 1.5:1 this week — the lowest in five months. The sentiment dip coincided with a 5% rebound, suggesting traders who sold into frustration may have helped mark a local bottom. Historically, ADA rallies have tended to begin when retail sentiment is weakest. Santiment flagged a similar setup in mid-August, when a 2:1 ratio aligned with a surge. Conversely, euphoric spikes — like the 12.8:1 ratio earlier this summer — have preceded sharp pullbacks. (Santiment) [https://cdn.sanity.io/images/s3y3vcno/production/d7f28e9bc91ef16b8e8f9a6fd3ffee353f7eb657-3039x1701.jpg?auto=format] Sentiment extremes matter because crypto markets are unusually sensitive to retail psychology. When optimism peaks, the crowd often buys into tops. When pessimism sets in, larger players use the selling pressure to accumulate. That pattern has been visible across multiple assets this year, including bitcoin and XRP. For Cardano, the shift suggests whales could use current weakness…",
    "tags": []
  },
  {
    "id": "policy:friday squid blogging the origin and propagation of squid:2025-09-06T00:05:27.000Z",
    "title": "Friday Squid Blogging: The Origin and Propagation of Squid",
    "url": "https://www.schneier.com/blog/archives/2025/09/friday-squid-blogging-the-origin-and-propagation-of-squid.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2025-09-06T00:05:27.000Z",
    "summary_long": "New research (paywalled): > Editor’s summary: > > Cephalopods are one of the most successful marine invertebrates in modern oceans, and they have a 500-million-year-old history. However, we know very little about their evolution because soft-bodied animals rarely fossilize. Ikegami et al. developed an approach to reveal squid fossils, focusing on their beaks, the sole hard component of their bodies. They found that squids radiated rapidly after shedding their shells, reaching high levels of diversity by 100 million years ago. This finding shows both that squid body forms led to early success and that their radiation was not due to the end-Cretaceous extinction event. New research (paywalled): > Editor’s summary: > > Cephalopods are one of the most successful marine invertebrates in modern oceans, and they have a 500-million-year-old history. However, we know very little about their evolution because soft-bodied animals rarely fossilize. Ikegami et al. developed an approach to reveal squid fossils, focusing on their beaks, the sole hard…",
    "tags": []
  },
  {
    "id": "bigtech:gop may finally succeed in unrelenting quest to kill two nas:2025-09-06T00:01:43.000Z",
    "title": "GOP may finally succeed in unrelenting quest to kill two NASA climate satellites",
    "url": "https://arstechnica.com/space/2025/09/gop-may-finally-succeed-in-unrelenting-quest-to-kill-two-nasa-climate-satellites/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-09-06T00:01:43.000Z",
    "summary_long": "It was in 2002, during the George W. Bush administration, when NASA decided to put a satellite into orbit to track emissions of carbon dioxide, the primary greenhouse gas pumped into the atmosphere through human activity. After many twists and turns, NASA's 23-year remit of charting greenhouse gas emissions could come to a close as soon as the end of this month. President Donald Trump's budget request to Congress calls for terminating 41 of NASA's 124 science missions in development or operations, and another 17 would see their funding zeroed out in the near future. Overall, the proposed budget slashes NASA's spending by 25 percent and cuts NASA's science funding in half. This year's federal budget runs out September 30, and although lawmakers from both parties have signaled they will reject most of Trump's cuts, it's far from certain that Congress will pass a budget for the next fiscal year before the looming deadline. The Trump administration, meanwhile, has directed…",
    "tags": []
  },
  {
    "id": "bigtech:the best robot vacuums we8217ve tested for 2025:2025-09-05T23:38:27.000Z",
    "title": "The best robot vacuums we&#8217;ve tested for 2025",
    "url": "https://www.theverge.com/22997597/best-robot-vacuum-cleaner",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Jennifer Pattison Tuohy",
    "published_at": "2025-09-05T23:38:27.000Z",
    "summary_long": "[https://platform.theverge.com/wp-content/uploads/sites/2/2025/03/257605_best_budget_robot_vacuums_CVirginia.jpg?quality=90&strip=all&crop=0,0,100,100] Robot vacuums are impressive devices that will clean your floors well and — thanks to bigger batteries and better robot brains — rarely get tired of doing their job. Over the last few years, they have gone from being utilitarian devices that sweep your floor to full-fledged home robots that can vacuum and mop your home and then trundle off to clean themselves to be ready for the next run. I’ve been testing robot vacuums for seven years and have run over 70 robot vacuums all over my house. These are my top picks if you’re looking for the best: a robot vacuum that can do it all with limited intervention from you. Along with my top picks, I have options to fit specific needs, such as mopping or besting pet hair. The good news is that there are a lot of great options. Whether you have a 3,000-square-foot home and three shaggy dogs or a small, stylish apartment…",
    "tags": []
  },
  {
    "id": "bigtech:openai reorganizes research team behind chatgpts personality:2025-09-05T23:19:12.000Z",
    "title": "OpenAI reorganizes research team behind ChatGPT’s personality",
    "url": "https://techcrunch.com/2025/09/05/openai-reorganizes-research-team-behind-chatgpts-personality/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Maxwell Zeff",
    "published_at": "2025-09-05T23:19:12.000Z",
    "summary_long": "OpenAI is shuffling the team that shapes its AI models' behavior, and its leader is moving on to another project within the company. OpenAI is shuffling the team that shapes its AI models' behavior, and its leader is moving on to another project within the company.. Why it matters: highlight the impact on technology, business, or society. Source: techcrunch.com. Who is affected: identify the main stakeholders or users and how they may change their work or strategy. What’s next: note near-term developments, expected responses, or signals to watch. Date: 2025-09-05. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect. Additional notes: independent validation, benchmarks, and follow-up announcements will clarify the real effect.",
    "tags": []
  },
  {
    "id": "bigtech:silicon valleys most powerful alliance just got stronger:2025-09-05T23:05:54.000Z",
    "title": "Silicon Valley’s most powerful alliance just got stronger",
    "url": "https://www.theverge.com/command-line-newsletter/773260/google-apple-search-deal-money-ai",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Alex Heath",
    "published_at": "2025-09-05T23:05:54.000Z",
    "summary_long": "[https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/Eddy-Cue-CL-site-wide.png?quality=90&strip=all&crop=0,0,100,100] Eddy Cue deserves a raise. As the executive overseeing Apple's services division, he's highly incentivized to protect the tens of billions of dollars a year that Google pays to be the default search engine in Safari. \"I've lost a lot of sleep thinking about it,\" he said from the witness stand during Google's antitrust trial earlier this year. Luckily for Cue, his court testimony appears to have had a significant impact on Judge Amit Mehta, who ruled this week that Google's default payments to Apple and others can continue. You can see Cue's arguments at trial mirrored in Mehta's ruling: the Apple SVP said it would be \"crazy\" to punish th … Read the full story at The Verge. [https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/Eddy-Cue-CL-site-wide.png?quality=90&strip=all&crop=0,0,100,100] Eddy Cue deserves a raise. As the executive overseeing Apple's services division, he's highly incentivized to protect the tens of billions of dollars a year that Google pays to be the default search engine in Safari. \"I've lost a…",
    "tags": []
  },
  {
    "id": "bigtech:who can get a covid vaccineand how its complicated:2025-09-05T22:20:39.000Z",
    "title": "Who can get a COVID vaccine—and how? It’s complicated.",
    "url": "https://arstechnica.com/health/2025/09/who-can-get-a-covid-vaccine-and-how-its-complicated/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2025-09-05T22:20:39.000Z",
    "summary_long": "As fall approaches and COVID cases tick up, you might be thinking about getting this season's COVID-19 vaccine. The annually updated shots have previously been easily accessible to anyone over 6 months of age. Most people could get them at no cost by simply walking into their neighborhood pharmacy—and that's what most people did. However, the situation is much different this year with an ardent anti-vaccine activist, Robert F. Kennedy Jr., as the country's top health official. Since taking the role, Kennedy has worked diligently to dismantle the country's premier vaccination infrastructure, as well as directly hinder access to lifesaving shots. That includes restricting access to COVID-19 vaccines—something he's done by brazenly flouting all standard federal processes while providing no evidence-based reasoning for the changes. HOW WE GOT HERE In late May, Kennedy unilaterally decided that all healthy children and pregnant people should no longer have access to the shots. He announced the unprecedented change not through official federal channels,…",
    "tags": []
  },
  {
    "id": "fintech:michael saylors strategy snubbed by sp 500 amid robinhoods s:2025-09-05T21:52:12.000Z",
    "title": "Michael Saylor’s Strategy Snubbed by S&P 500 Amid Robinhood's Surprise Inclusion",
    "url": "https://www.coindesk.com/business/2025/09/05/michael-saylor-s-strategy-snubbed-by-s-and-p-500-amid-robinhood-s-surprise-inclusion",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-09-05T21:52:12.000Z",
    "summary_long": "Michael Saylor's Strategy (MSTR) missed out on being added to the S&P 500 index on Friday, despite hopes of inclusion after the company posted one of the strongest quarters in its history and met all criteria for joining the index. The stock of the largest corporate bitcoin (BTC) holder declined nearly 3% after market hours, erasing all of Friday's gains. The inclusion would have been a significant milestone for the company and for the industry as it would have exposed millions of average investors and portfolio managers to the company, potentially acting as a bullish catalyst. In a surprise move on Friday, the digital trading platform Robinhood (HOOD), with growing crypto ambitions, was included in the S&P 500 index, driving the stock 7% higher after the market close. The changes will go into effect on September 22. Before Friday, only two crypto-linked stocks were part of the index: Crypto exchange Coinbase (COIN) and Jack Dorsey's Block (XYZ). Robinhood will now…",
    "tags": []
  },
  {
    "id": "consumer:zuckerberg caught on hot mic telling trump i wasnt sure how :2025-09-05T21:19:15.000Z",
    "title": "Zuckerberg caught on hot mic telling Trump ‘I wasn’t sure’ how much to promise to spend on AI in the US",
    "url": "https://www.engadget.com/zuckerberg-caught-on-hot-mic-telling-trump-i-wasnt-sure-how-much-to-promise-to-spend-on-ai-in-the-us-211915608.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-09-05T21:19:15.000Z",
    "summary_long": "Mark Zuckerberg has certainly come a long way in his relationship with President Donald Trump. Almost exactly a year after the president threatened the Meta CEO with imprisonment, the two sat side-by-side at a White House dinner, alongside numerous other tech CEOs. The nearly three dozen CEOs and execs in attendance took turns praising and thanking Trump. But Zuckerberg's comments were especially notable. In one moment that was widely shared on social media, Trump turns to Zuckerberg and asks \"how much are you spending, would say, over the next few years?\" Zuckerberg responded that it was \"probably going to be something like, I don't know, at least $600 billion through [20]28 in the US.\" Trump seemed to approve. \"That's a lot, thank you Mark, it's great to have you.\" But it was a hot mic moment captured later between the two that was especially telling. Zuckerberg, turning to Trump, apologizes and says \"sorry, I wasn't ready …I wasn't sure what…",
    "tags": []
  },
  {
    "id": "bigtech:classic sesame street episodes are coming to youtube:2025-09-05T21:11:06.000Z",
    "title": "Classic Sesame Street episodes are coming to YouTube",
    "url": "https://www.theverge.com/news/773164/youtube-sesame-street-classic-episodes-netflix",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Jay Peters",
    "published_at": "2025-09-05T21:11:06.000Z",
    "summary_long": "[https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/el-p014-sst.jpg?quality=90&strip=all&crop=0,0,100,100] YouTube is getting “hundreds” of full classic Sesame Street episodes beginning in January 2026. Once the episodes are available, “YouTube will have the largest digital library of Sesame Street content,” Sesame Workshop says. YouTube is already has a wealth of popular content focused toward kids, including big channels like Cocomelon (which is getting a theatrical film in 2027) and Ms. Rachel (who also has a deal with Netflix). The addition of the classic Sesame Street episodes could give parents another educational option if their kids want to watch something on the platform. Speaking of Netflix, new episodes of Sesame Street will debut on the service starting November 10th. Season 56 will have “fresh format changes” including a focus on “one 11-minute story” per episode, Netflix says. The new episodes will also be available “same day-and-date in the US on PBS stations and PBS KIDS digital platforms.” Last year, Warner Bros. Discovery chose not to renew its deal with Sesame…",
    "tags": []
  }
]