[
  {
    "id": "bigtech:rocket report chinese rockets fail twice in 12 hours rocket :2026-01-23T14:31:44.000Z",
    "title": "Rocket Report: Chinese rockets fail twice in 12 hours; Rocket Lab reports setback",
    "url": "https://arstechnica.com/space/2026/01/rocket-report-rocket-lab-reports-neutron-setback-australia-backs-launch-startup/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2026-01-23T14:31:44.000Z",
    "summary_long": "Welcome to Edition 8.26 of the Rocket Report! The past week has been one of advancements and setbacks in the rocket business. NASA rolled the massive rocket for the Artemis II mission to its launch pad in Florida, while Chinese launchers suffered back-to-back failures within a span of approximately 12 hours. Rocket Lab's march toward a debut of its new Neutron launch vehicle in the coming months may have stalled after a failure during a key qualification test. Source: arstechnica.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:legal ai giant harvey acquires hexus as competition heats up:2026-01-24T05:27:22.000Z",
    "title": "Legal AI giant Harvey acquires Hexus as competition heats up in legal tech",
    "url": "https://techcrunch.com/2026/01/23/legal-ai-giant-harvey-acquires-hexus-as-competition-heats-up-in-legal-tech/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Connie Loizos",
    "published_at": "2026-01-24T05:27:22.000Z",
    "summary_long": "Hexus founder and CEO Sakshi Pratap, who previously held engineering roles at Walmart, Oracle, and Google, tells TechCrunch that her San Francisco-based team has already joined Harvey, while the startup's India-based engineers will come onboard once Harvey establishes a Bangalore office. Source: techcrunch.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:meta pauses teen access to ai characters ahead of new versio:2026-01-23T17:00:00.000Z",
    "title": "Meta pauses teen access to AI characters ahead of new version",
    "url": "https://techcrunch.com/2026/01/23/meta-pauses-teen-access-to-ai-characters-ahead-of-new-version/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Ivan Mehta",
    "published_at": "2026-01-23T17:00:00.000Z",
    "summary_long": "Meta today said that it is pausing teens' access to its AI characters globally across all its apps. The company mentioned that it is not abandoning its efforts but wants to develop an updated version of AI characters for teens. Source: techcrunch.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas chandra releases deep cut from catalog of cosmic recor:2026-01-23T18:02:31.000Z",
    "title": "NASA’s Chandra Releases Deep Cut From Catalog of Cosmic Recordings",
    "url": "https://www.nasa.gov/missions/chandra/nasas-chandra-releases-deep-cut-from-catalog-of-cosmic-recordings/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lee Mohon",
    "published_at": "2026-01-23T18:02:31.000Z",
    "summary_long": "5 Min Read NASA’S CHANDRA RELEASES DEEP CUT FROM CATALOG OF COSMIC RECORDINGS Like a recording artist who has had a long career, NASA’s Chandra X-ray Observatory has a “back catalog” of cosmic recordings that is impossible to replicate. To access these X-ray tracks, or observations, the ultimate compendium has been developed: the Chandra Source Catalog (CSC). The CSC contains the X-ray data detected up to the end of 2020 by Chandra, the world’s premier X-ray telescope and one of NASA’s “Great Observatories.” The latest version of the CSC, known as CSC 2.1, contains over 400,000 unique compact and extended sources and over 1.3 million individual detections in X-ray light. before after This image contains lower-, medium-, and higher-energy X-rays in red, green, and blue respectively. Source: www.nasa.gov. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apple accuses europe of delay tactics following alternative :2026-01-23T12:47:01.000Z",
    "title": "Apple accuses Europe of 'delay tactics' following alternative app store collapse",
    "url": "https://www.engadget.com/big-tech/apple-accuses-europe-of-delay-tactics-following-alternative-app-store-collapse-124701591.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2026-01-23T12:47:01.000Z",
    "summary_long": "Following the shutdown of an alternative app store, Apple has accused the European Commission (EC) of using “political delay tactics” as an excuse to probe and fine the company, Bloomberg reported. Apple issued the statement preemptively as commission is reportedly preparing to blame Apple for the shutdown of third-party app store Setapp due to what the developer called “still-evolving and complex business terms.” As part of an EU ruling, Apple was forced to allow third-party marketplaces for apps once the Digital Markets Act (DMA) took effect in 2024. Apple agreed to allow such stores, but implemented fees of €0.50 per installation if the number of downloads exceeded one million, among other rules. In April 2025, the EC found Apple to be in “non-compliance” with the DMA over rules on “steering” users to alternative payments and levied a $500 million fine. Source: www.engadget.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "fintech:ledger said to seek 4 billion ipo in new york tripling 2023 :2026-01-23T12:37:27.000Z",
    "title": "Ledger said to seek $4 billion IPO in New York, tripling 2023 valuation: FT",
    "url": "https://www.coindesk.com/business/2026/01/23/ledger-said-to-seek-usd4-billion-ipo-in-new-york-tripling-2023-valuation-ft",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2026-01-23T12:37:27.000Z",
    "summary_long": "Ledger said to seek $4 billion IPO in New York, tripling 2023 valuation: FT Source: www.coindesk.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:unrolling the codex agent loop:2026-01-23T12:00:00.000Z",
    "title": "Unrolling the Codex agent loop",
    "url": "https://openai.com/index/unrolling-the-codex-agent-loop",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-01-23T12:00:00.000Z",
    "summary_long": "Unrolling the Codex agent loop Source: openai.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa selects participants to track artemis ii mission:2026-01-23T21:01:33.000Z",
    "title": "NASA Selects Participants to Track Artemis II Mission",
    "url": "https://www.nasa.gov/technology/space-comms/nasa-selects-participants-to-track-artemis-ii-mission/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Katrina Lee",
    "published_at": "2026-01-23T21:01:33.000Z",
    "summary_long": "4 Min Read NASA SELECTS PARTICIPANTS TO TRACK ARTEMIS II MISSION A visual representation of NASA’s Artemis I mission. Credits: NASA NASA has selected 34 global volunteers to track the Orion spacecraft during the crewed Artemis II mission’s journey around the Moon. The Artemis II test flight will launch NASA’s Space Launch System (SLS) rocket, carrying the Orion spacecraft and a crew of four astronauts, on a mission into deep space. The agency’s second mission in the Artemis campaign is a key step in NASA’s path toward establishing a long-term presence at the Moon and confirming the systems needed to support future lunar surface exploration and paving the way for the first crewed mission to Mars. Source: www.nasa.gov. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:a rival smart glasses company is suing meta over its rayban :2026-01-23T20:50:00.000Z",
    "title": "A rival smart glasses company is suing Meta over its Ray-Ban products",
    "url": "https://www.engadget.com/wearables/a-rival-smart-glasses-company-is-suing-meta-over-its-ray-ban-products-205000997.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2026-01-23T20:50:00.000Z",
    "summary_long": "Meta is being sued by Solos, a rival smart glasses maker, for infringing on its patents, Bloomberg reports. Solos is seeking \"multiple billions of dollars\" in damages and an injunction that could prevent Meta from selling its Ray-Ban Meta smart glasses as part of the lawsuit. Solos claims that Meta's Ray-Ban Meta Wayfarer Gen 1 smart glasses violate multiple patents covering \"core technologies in the field of smart eyewear.\" While less well known than Meta and its partner EssilorLuxottica, Solos sells multiple pairs of glasses with similar features to what Meta offers. For example, the company's AirGo A5 glasses lets you control music playback and automatically translate speech into different languages, and integrates ChatGPT for answering questions and searching the web. Source: www.engadget.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crypto custodian bitgo down 12 falling well below ipo price :2026-01-23T17:06:29.000Z",
    "title": "Crypto custodian BitGo down 12%, falling well below IPO price on second trading day",
    "url": "https://www.coindesk.com/markets/2026/01/23/crypto-custodian-bitgo-shares-fall-13-on-second-day-of-trading",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2026-01-23T17:06:29.000Z",
    "summary_long": "Crypto custodian BitGo down 12%, falling well below IPO price on second trading day Source: www.coindesk.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:swiss banking giant ubs planning to offer crypto services to:2026-01-23T14:10:47.000Z",
    "title": "Swiss banking giant UBS planning to offer crypto services to specific clients",
    "url": "https://www.coindesk.com/business/2026/01/23/swiss-banking-giant-usb-planning-to-offer-crypto-services-to-specific-clients",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2026-01-23T14:10:47.000Z",
    "summary_long": "Swiss banking giant UBS planning to offer crypto services to specific clients Source: www.coindesk.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:ring can now verify if a video has been altered:2026-01-23T14:00:00.000Z",
    "title": "Ring can now verify if a video has been altered",
    "url": "https://www.engadget.com/home/smart-home/ring-can-now-verify-if-a-video-has-been-altered-140000140.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2026-01-23T14:00:00.000Z",
    "summary_long": "Ring has launched a new tool that can tell you if a video clip captured by its camera has been altered or not. The company says that every video downloaded from Ring starting in December 2025 going forward will come with a digital security seal. “Think of it like the tamper-evident seal on a medicine bottle,” it explained. Its new tool, called Ring Verify, can tell you if a video has been altered in any way. Source: www.engadget.com. Date: 2026-01-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]