[
  {
    "id": "bigtech:bonkers bitcoin heist 5star hotels cashfilled envelopes vani:2025-11-18T18:37:23.000Z",
    "title": "Bonkers Bitcoin heist: 5-star hotels, cash-filled envelopes, vanishing funds",
    "url": "https://arstechnica.com/information-technology/2025/11/bonkers-bitcoin-heist-5-star-hotels-cash-filled-envelopes-vanishing-funds/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Joel Khalili\n                ",
    "published_at": "2025-11-18T18:37:23.000Z",
    "summary_long": "As Kent Halliburton stood in a bathroom at the Rosewood Hotel in central Amsterdam, thousands of miles from home, running his fingers through an envelope filled with 10,000 euros in crisp banknotes, he started to wonder what he had gotten himself into. Halliburton is the cofounder and CEO of Sazmining, a company that operates bitcoin mining hardware on behalf of clients—a model known as “mining-as-a-service.” Halliburton is based in Peru, but Sazmining runs mining hardware out of third-party data centers across Norway, Paraguay, Ethiopia, and the United States. As Halliburton tells it, he had flown to Amsterdam the previous day, August 5, to meet Even and Maxim, two representatives of a wealthy Monaco-based family. The family office had offered to purchase hundreds of bitcoin mining rigs from Sazmining—around $4 million worth—which the company would install at a facility currently under construction in Ethiopia. Source: arstechnica.com. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:emm raises 9m seed to create one of the worlds first smart m:2025-11-19T05:01:00.000Z",
    "title": "Emm raises $9M seed to create one of the world’s first ‘smart’ menstrual cups",
    "url": "https://techcrunch.com/2025/11/18/emm-raises-9m-seed-to-create-to-launch-one-of-the-worlds-first-smart-menstrual-cups/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Dominic-Madori Davis",
    "published_at": "2025-11-19T05:01:00.000Z",
    "summary_long": "Emm raises $9M seed to create one of the world’s first ‘smart’ menstrual cups Source: techcrunch.com. Date: 2025-11-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:meta wins monopoly trial convinces judge that social network:2025-11-18T21:47:14.000Z",
    "title": "Meta wins monopoly trial, convinces judge that social networking is dead",
    "url": "https://arstechnica.com/tech-policy/2025/11/meta-wins-monopoly-trial-convinces-judge-that-social-networking-is-dead/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-11-18T21:47:14.000Z",
    "summary_long": "After years of pushback from the Federal Trade Commission over Meta’s acquisitions of Instagram and WhatsApp, Meta has defeated the FTC’s monopoly claims. In a Tuesday ruling, US District Judge James Boasberg said the FTC failed to show that Meta has a monopoly in a market dubbed “personal social networking.” In that narrowly defined market, the FTC unsuccessfully argued, Meta supposedly faces only two rivals, Snapchat and MeWe, which struggle to compete due to its alleged monopoly. But the days of grouping apps into “separate markets of social networking and social media” are over, Boasberg wrote. He cited the Greek philosopher Heraclitus, who “posited that no man can ever step into the same river twice,” while telling the FTC they missed their chance to block Meta’s purchase. Source: arstechnica.com. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:obex raises 37m to build y combinator for rwabacked stableco:2025-11-18T16:00:00.000Z",
    "title": "Obex Raises $37M to Build 'Y Combinator' for RWA-Backed Stablecoins, Led by Framework, Sky",
    "url": "https://www.coindesk.com/business/2025/11/18/obex-raises-usd37m-to-build-y-combinator-for-rwa-backed-stablecoins-led-by-framework-sky",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-11-18T16:00:00.000Z",
    "summary_long": "Obex Raises $37M to Build 'Y Combinator' for RWA-Backed Stablecoins, Led by Framework, Sky Source: www.coindesk.com. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the allelectric jeep recon gets official specs and launch pr:2025-11-19T00:00:32.000Z",
    "title": "The all-electric Jeep Recon gets official specs and launch price",
    "url": "https://www.engadget.com/transportation/evs/the-all-electric-jeep-recon-gets-official-specs-and-launch-price-000032015.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-11-19T00:00:32.000Z",
    "summary_long": "Jeep says that the all-electric 2026 Jeep Recon will finally begin production \"early next year.\" This comes three years after the model's original announcement amid multiple delayed starts. Built on a dedicated EV architecture, the Recon will deliver 650 horsepower and 620 ft-lb of torque. Its 100kWh battery pack will have an estimated 250 miles of range on a full charge and accelerate from 0-60 mph in as little as 3.6 seconds. The Recon is billed as the first and only fully electric Trail Rated SUV in the industry. Source: www.engadget.com. Date: 2025-11-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:apo2mol 3d molecule generation via dynamic pocketaware diffu:2025-11-18T15:01:27.000Z",
    "title": "Apo2Mol: 3D Molecule Generation via Dynamic Pocket-Aware Diffusion Models",
    "url": "https://arxiv.org/abs/2511.14559v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Xinzhe Zheng",
    "published_at": "2025-11-18T15:01:27.000Z",
    "summary_long": "Deep generative models are rapidly advancing structure-based drug design, offering substantial promise for generating small molecule ligands that bind to specific protein targets. However, most current approaches assume a rigid protein binding pocket, neglecting the intrinsic flexibility of proteins and the conformational rearrangements induced by ligand binding, limiting their applicability in practical drug discovery. Here, we propose Apo2Mol, a diffusion-based generative framework for 3D molecule design that explicitly accounts for conformational flexibility in protein binding pockets. To support this, we curate a dataset of over 24,000 experimentally resolved apo-holo structure pairs from the Protein Data Bank, enabling the characterization of protein structure changes associated with ligand binding. Source: arxiv.org. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:seismic data can identify aircraft by type:2025-11-18T22:28:03.000Z",
    "title": "Seismic data can identify aircraft by type",
    "url": "https://techxplore.com/news/2025-11-seismic-aircraft.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-18T22:28:03.000Z",
    "summary_long": "Instruments typically used to detect the ground motion of earthquakes can also be used to identify the type of aircraft flying far overhead, research by University of Alaska Fairbanks scientists shows. That's because aircraft sound waves also shake the ground, though to a much lesser extent. Source: techxplore.com. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:polestar evs can power your home in california:2025-11-18T22:02:15.000Z",
    "title": "Polestar EVs can power your home in California",
    "url": "https://www.engadget.com/transportation/evs/polestar-evs-can-power-your-home-in-california-220215757.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-18T22:02:15.000Z",
    "summary_long": "EV maker Polestar has announced that it's bringing bi-directional charging — the ability for an electric car to be tapped as a battery for your home or the grid — to Polestar 3 owners who live in California. The feature is one of several ways EV owners can save money with their electric car, by either using less energy overall, or receiving credits for providing their excess power to the grid. Polestar's bi-directional charging feature uses direct current, according to the company, and enables \"V2H functionality for Polestar 3 customers on the 400 Volt electrical architecture.\" Polestar is offering the feature in partnership with home energy company dcbel, who helps administer a California Energy Commission program for installing \"home energy stations\" that can manage multiple clean energy sources in residential homes, including EVs with bi-directional charging. Polestar claims that using dcbel's Ara system, customers can \"reduce charging costs by up to $1,300 per year and use their car as an…",
    "tags": []
  },
  {
    "id": "consumer:you can turn a cluster of macs into an ai supercomputer in m:2025-11-18T19:15:00.000Z",
    "title": "You can turn a cluster of Macs into an AI supercomputer in macOS Tahoe 26.2",
    "url": "https://www.engadget.com/ai/you-can-turn-a-cluster-of-macs-into-an-ai-supercomputer-in-macos-tahoe-262-191500778.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-18T19:15:00.000Z",
    "summary_long": "Who needs a revamped Mac Pro when you can just turn several Mac Studios into a unified computing system? With the upcoming macOS Tahoe 26.2 release, Apple is introducing a new low-latency feature that lets you connect several Macs together using Thunderbolt 5. For developers and researchers, it's a potentially useful way to create powerful AI supercomputers that can run massive local models. That allows four Mac Studios, which can each run up to 512GB of unified memory, to run the 1 trillion parameter Kimi-K2-Thinking model far more efficiently than PCs with power-hungry GPUs. Source: www.engadget.com. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:level up designtocode collaboration with githubs open source:2025-11-18T18:05:17.000Z",
    "title": "Level up design-to-code collaboration with GitHub’s open source Annotation Toolkit",
    "url": "https://github.blog/enterprise-software/collaboration/level-up-design-to-code-collaboration-with-githubs-open-source-annotation-toolkit/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Andrea Griffiths",
    "published_at": "2025-11-18T18:05:17.000Z",
    "summary_long": "If you’ve ever been handed a design file and thought, “Wait—what exactly is this supposed to do?” you’re not alone. The handoff between designers and developers is one of the most common points where product workflows break down. You are looking at components and trying to figure out what’s interactive, what’s responsive, what happens when text gets bigger. The designer is trying to express something that isn’t directly stated on the canvas. Source: github.blog. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa telescopes view spiral galaxy:2025-11-18T17:45:46.000Z",
    "title": "NASA Telescopes View Spiral Galaxy",
    "url": "https://www.nasa.gov/image-article/nasa-telescopes-view-spiral-galaxy/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2025-11-18T17:45:46.000Z",
    "summary_long": "Image credit: X-ray: NASA/CXC/SAO; Optical/IR: NASA/ESA/CSA/STScI (HST and JWST); Radio: NSF/NRAO/VLA; Image Processing: NASA/CXC/SAO/J. Schmidt and N. Wolk NGC 1068, a relatively nearby spiral galaxy, appears in this image released on July 23, 2025. The galaxy contains a black hole at its center that is twice as massive as the Milky Way’s. Source: www.nasa.gov. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:seeing beyond the image ecg and anatomical knowledgeguided m:2025-11-18T17:42:20.000Z",
    "title": "Seeing Beyond the Image: ECG and Anatomical Knowledge-Guided Myocardial Scar Segmentation from Late Gadolinium-Enhanced Images",
    "url": "https://arxiv.org/abs/2511.14702v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Farheen Ramzan",
    "published_at": "2025-11-18T17:42:20.000Z",
    "summary_long": "Accurate segmentation of myocardial scar from late gadolinium enhanced (LGE) cardiac MRI is essential for evaluating tissue viability, yet remains challenging due to variable contrast and imaging artifacts. Electrocardiogram (ECG) signals provide complementary physiological information, as conduction abnormalities can help localize or suggest scarred myocardial regions. In this work, we propose a novel multimodal framework that integrates ECG-derived electrophysiological information with anatomical priors from the AHA-17 atlas for physiologically consistent LGE-based scar segmentation. As ECGs and LGE-MRIs are not acquired simultaneously, we introduce a Temporal Aware Feature Fusion (TAFF) mechanism that dynamically weights and fuses features based on their acquisition time difference. Source: arxiv.org. Date: 2025-11-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]