[
  {
    "id": "bigtech:elon musk accused of making up math to squeeze 134b from ope:2026-01-19T19:04:18.000Z",
    "title": "Elon Musk accused of making up math to squeeze $134B from OpenAI, Microsoft",
    "url": "https://arstechnica.com/tech-policy/2026/01/elon-musk-accused-of-making-up-math-to-squeeze-134b-from-openai-microsoft/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2026-01-19T19:04:18.000Z",
    "summary_long": "Elon Musk is going for some substantial damages in his lawsuit accusing OpenAI of abandoning its nonprofit mission and \"making a fool out of him\" as an early investor. On Friday, Musk filed a notice on remedies sought in the lawsuit, confirming that he's seeking damages between $79 billion and $134 billion from OpenAI and its largest backer, co-defendant Microsoft. Musk hired an expert he has never used before, C. Paul Wazzan, who reached this estimate by concluding that Musk's early contributions to OpenAI generated 50 to 75 percent of the nonprofit's current value. Source: arstechnica.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:the fastest human spaceflight mission in history crawls clos:2026-01-19T22:01:52.000Z",
    "title": "The fastest human spaceflight mission in history crawls closer to liftoff",
    "url": "https://arstechnica.com/space/2026/01/nasas-artemis-ii-rocket-rolls-to-launch-pad-but-key-test-looms-ahead/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2026-01-19T22:01:52.000Z",
    "summary_long": "KENNEDY SPACE CENTER, Florida—Preparations for the first human spaceflight to the Moon in more than 50 years took a big step forward this weekend with the rollout of the Artemis II rocket to its launch pad. The rocket reached a top speed of just 1 mph on the four-mile, 12-hour journey from the Vehicle Assembly Building to Launch Complex 39B at NASA's Kennedy Space Center in Florida. At the end of its nearly 10-day tour through cislunar space, the Orion capsule on top of the rocket will exceed 25,000 mph as it plunges into the atmosphere to bring its four-person crew back to Earth. \"This is the start of a very long journey,\" said NASA Administrator Jared Isaacman. Source: arstechnica.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:threads overtakes x on mobile but still lags far behind:2026-01-19T11:53:33.000Z",
    "title": "Threads overtakes X on mobile, but still lags far behind",
    "url": "https://www.theverge.com/news/864099/threads-overtakes-x-daily-mobile-ios-android-users",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Jess Weatherbed",
    "published_at": "2026-01-19T11:53:33.000Z",
    "summary_long": "After launching almost three years ago, Meta's Threads is now reportedly attracting more daily mobile users than rival platform X. According to Similarweb data shared by TechCrunch, Threads has 141.5 million daily active iOS and Android global app users as of January 7th, compared to 125 million users for Elon Musk's mobile platform. Similarweb reports that Threads actually overtook X sometime between late October and early November after a consistent period of growth, meaning this milestone wasn't suddenly achieved in reaction to recent Grok-related controversies. X still has more mobile users than Threads in the US, according to Similarwe … Read the full story at The Verge. Source: www.theverge.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:will google be third time lucky with new aipowered smart gla:2026-01-20T01:20:01.000Z",
    "title": "Will Google be 'third time lucky' with new, AI-powered smart glasses?",
    "url": "https://techxplore.com/news/2026-01-google-lucky-ai-powered-smart.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-20T01:20:01.000Z",
    "summary_long": "It has been over a decade since Google Glass smart glasses were announced in 2013, followed by their swift withdrawal—in part because of low adoption. Their subsequent (and lesser known) second iteration was released in 2017 and aimed at the workplace. They were withdrawn in 2023. Source: techxplore.com. Date: 2026-01-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:ransomware what it is and why its your problem:2026-01-19T23:50:01.000Z",
    "title": "Ransomware: What it is and why it's your problem",
    "url": "https://techxplore.com/news/2026-01-ransomware-problem.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-19T23:50:01.000Z",
    "summary_long": "Ransomware: What it is and why it's your problem Source: techxplore.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:asus will not release any new smartphones this year:2026-01-19T21:30:43.000Z",
    "title": "ASUS will not release any new smartphones this year",
    "url": "https://www.engadget.com/mobile/smartphones/asus-will-not-release-any-new-smartphones-this-year-213043832.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-19T21:30:43.000Z",
    "summary_long": "ASUS appears to be shifting its business operations away from smartphones. According to translations of recent quotes from Chairman Jonney Shih, the company does not plan to release new phone models in the future. The chairman did not confirm whether smartphones would be completely phased out, but he did acknowledge that possibility. Whatever direction ASUS takes, its existing phones will continue to receive software updates and warranty assistance. Source: www.engadget.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:musk claims tesla will restart work on its dojo supercompute:2026-01-19T17:31:27.000Z",
    "title": "Musk claims Tesla will restart work on its Dojo supercomputer",
    "url": "https://www.engadget.com/ai/musk-claims-tesla-will-restart-work-on-its-dojo-supercomputer-173127863.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2026-01-19T17:31:27.000Z",
    "summary_long": "Elon Musk posted on X that Tesla will be restarting work on Dojo3, the third generation of its in-house supercomputer project. The Dojo team had been disbanded last year as the company prioritized the AI chips that run on board Tesla vehicles. Musk said the company is returning to the project \"now that the AI5 chip design is in good shape.\" The purpose of the Dojo project is to process video recordings and other data from Tesla vehicles and use that to train the \"neural net\" behind the company's Full Self-Driving software. Last year, however, Musk posted on X that \"It doesn’t make sense for Tesla to divide its resources and scale two quite different AI chip designs. Source: www.engadget.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:trump is winning the fight against offshore wind despite cou:2026-01-19T14:40:01.000Z",
    "title": "Trump is winning the fight against offshore wind despite court losses",
    "url": "https://techxplore.com/news/2026-01-trump-offshore-court-losses.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-19T14:40:01.000Z",
    "summary_long": "President Donald Trump's campaign against offshore wind power in the U.S. sustained major setbacks last week when three different judges blocked enforcement of a government ban and allowed projects in New York, Rhode Island and Virginia to resume construction. And two others may win similar decisions soon. Source: techxplore.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:cryptos worst year for hacks wasnt a smart contract issue it:2026-01-19T13:30:18.000Z",
    "title": "Crypto’s worst year for hacks wasn’t a smart contract issue. It was a people problem.",
    "url": "https://www.coindesk.com/business/2026/01/19/crypto-s-worst-year-for-hacks-wasn-t-a-smart-contract-problem-it-was-a-people-problem",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2026-01-19T13:30:18.000Z",
    "summary_long": "Crypto’s worst year for hacks wasn’t a smart contract issue. It was a people problem. Source: www.coindesk.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:spyware document pool:2026-01-19T11:35:57.000Z",
    "title": "Spyware Document Pool",
    "url": "https://edri.org/our-work/spyware-document-pool/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2026-01-19T11:35:57.000Z",
    "summary_long": "Spyware is one of the most serious threats to fundamental rights, democracy and civic space across Europe. This document pool brings together EDRi’s analysis, advocacy, research, and curated third-party resources as part of our push for a full EU-wide ban on spyware. The post Spyware Document Pool appeared first on European Digital Rights (EDRi). Source: edri.org. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:threads has more global daily users than x on mobile for the:2026-01-19T14:49:36.000Z",
    "title": "Threads has more global daily users than X on mobile for the first time",
    "url": "https://www.engadget.com/social-media/threads-has-more-global-daily-users-than-x-on-mobile-for-the-first-time-144936831.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2026-01-19T14:49:36.000Z",
    "summary_long": "Meta’s Threads is pulling further ahead of Elon Musk’s X on mobile, based on recent estimates from analytics firm Similarweb, Forbes reports. In the first stretch of January, Threads averaged roughly 143 million daily active users worldwide on mobile devices, compared with about 126 million for X. Similarweb’s year-over-year snapshot shows Threads growing sharply, up 37.8 percent year-over-year, while X’s daily mobile audience fell 11.9 percent across the same period. The picture is more mixed in the US, where X still holds a narrow edge on mobile. Source: www.engadget.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:indias central bank proposes a plan to create digitalcurrenc:2026-01-19T11:32:26.000Z",
    "title": "India's central bank proposes a plan to create digital-currency link among BRICS nations",
    "url": "https://www.coindesk.com/markets/2026/01/19/india-s-central-bank-proposes-a-plan-to-create-digital-currency-link-among-brics-nations",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Omkar Godbole",
    "published_at": "2026-01-19T11:32:26.000Z",
    "summary_long": "India's central bank proposes a plan to create digital-currency link among BRICS nations Source: www.coindesk.com. Date: 2026-01-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]