[
  {
    "id": "bigtech:the twin probes just launched toward mars have an easter egg:2025-11-14T21:30:07.000Z",
    "title": "The twin probes just launched toward Mars have an Easter egg on board",
    "url": "https://arstechnica.com/space/2025/11/the-twin-probes-just-launched-toward-mars-have-an-easter-egg-on-board/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Robert Pearlman\n                ",
    "published_at": "2025-11-14T21:30:07.000Z",
    "summary_long": "The first multi-spacecraft science mission to launch to Mars is now on its way, and catching a ride on the twin probes are the first kiwis to fly to the red planet. NASA’s ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers) mission lifted off on a 22-month trip to Mars on Thursday aboard a New Glenn rocket. Once there, the identical satellites will enter Martian orbit to study in real time how space weather affects the planet’s hybrid magnetosphere and how the interaction drove Mars to lose its once-dense atmosphere. Led by the Space Sciences Laboratory at the University of California, Berkeley—the two spacecraft are named “Blue” and “Gold” after the school’s colors—the ESCAPADE probes are the first Mars-bound vehicles to be designed, built, and tested by Rocket Lab, the end-to-end space company headquartered in California but founded in New Zealand. Source: arstechnica.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:as shutdown ends dubious cdc panel gets back to dismantling :2025-11-14T21:01:15.000Z",
    "title": "As shutdown ends, dubious CDC panel gets back to dismantling vaccine schedule",
    "url": "https://arstechnica.com/health/2025/11/as-shutdown-ends-dubious-cdc-panel-gets-back-to-dismantling-vaccine-schedule/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2025-11-14T21:01:15.000Z",
    "summary_long": "With the government reopening, the dubious panel of vaccine advisors selected by anti-vaccine Health Secretary Robert F. Kennedy is wasting no time getting back to dismantling the federal childhood vaccine schedule. A meeting that was scheduled for October but put on hold during the shutdown has already been rescheduled for December 4 and 5. A Federal Register notice Thursday said that the meeting will “include discussions on vaccine safety, the childhood and adolescent immunization schedule, and hepatitis B vaccines.” The announcement was light on information beyond that but indicated that there would be a vote on hepatitis B vaccines. Source: arstechnica.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:blue origins new glenn rocket came back home after taking ai:2025-11-14T14:01:28.000Z",
    "title": "Blue Origin’s New Glenn rocket came back home after taking aim at Mars",
    "url": "https://arstechnica.com/science/2025/11/blue-origin-caps-second-heavy-lift-launch-with-first-offshore-landing/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-11-14T14:01:28.000Z",
    "summary_long": "The rocket company founded a quarter-century ago by billionaire Jeff Bezos made history Thursday with the pinpoint landing of an 18-story-tall rocket on a floating platform in the Atlantic Ocean. The on-target touchdown came nine minutes after the New Glenn rocket, built and operated by Bezos’ company Blue Origin, lifted off from Cape Canaveral Space Force Station, Florida, at 3:55 pm EST (20:55 UTC). The launch was delayed from Sunday, first due to poor weather at the launch site in Florida, then by a solar storm that sent hazardous radiation toward Earth earlier this week. “We achieved full mission success today, and I am so proud of the team,” said Dave Limp, CEO of Blue Origin. Source: arstechnica.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crypto markets today bitcoin breaches 98k as liquidations to:2025-11-14T11:05:01.000Z",
    "title": "Crypto Markets Today: Bitcoin Breaches $98K as Liquidations Top $1.1B",
    "url": "https://www.coindesk.com/markets/2025/11/14/crypto-markets-today-bitcoin-breaches-usd98k-as-liquidations-top-usd1-1b",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Oliver Knight",
    "published_at": "2025-11-14T11:05:01.000Z",
    "summary_long": "Crypto Markets Today: Bitcoin Breaches $98K as Liquidations Top $1.1B Source: www.coindesk.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:6 things to know from nasa about new us european sea satelli:2025-11-15T00:13:01.000Z",
    "title": "6 Things to Know From NASA About New US, European Sea Satellite",
    "url": "https://www.nasa.gov/missions/jason-cs-sentinel-6/sentinel-6b/6-things-to-know-from-nasa-about-new-us-european-sea-satellite/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "scarney1",
    "published_at": "2025-11-15T00:13:01.000Z",
    "summary_long": "6 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) Set to launch no earlier than Nov. 16, Sentinel-6B will continue a decades-long data record of sea level measurement that will help decision-makers manage coastal flooding, support hurricane intensity forecasts, and assist in the return of astronauts from space. NASA Data from Sentinel-6B will continue a decades-long record of sea surface height, helping to improve coastal planning, protect critical infrastructure, and advance weather forecasts. With launch set for no earlier than 12:21 a.m. Source: www.nasa.gov. Date: 2025-11-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch predawn starlink mission from:2025-11-14T23:35:50.000Z",
    "title": "Live coverage: SpaceX to launch predawn Starlink mission from Cape Canaveral",
    "url": "https://spaceflightnow.com/2025/11/14/live-coverage-spacex-to-launch-predawn-starlink-mission-from-cape-canaveral/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-11-14T23:35:50.000Z",
    "summary_long": "Live coverage: SpaceX to launch predawn Starlink mission from Cape Canaveral Source: spaceflightnow.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex launches 29 starlink satellites on falcon 9 rocket fr:2025-11-14T23:17:07.000Z",
    "title": "SpaceX launches 29 Starlink satellites on Falcon 9 rocket from NASA’s Kennedy Space Center",
    "url": "https://spaceflightnow.com/2025/11/14/live-coverage-spacex-to-launch-29-starlink-satellites-on-falcon-9-rocket-from-nasas-kennedy-space-center-2/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-11-14T23:17:07.000Z",
    "summary_long": "Update Nov. 14, 11:40 p.m. EST (0440 UTC) SpaceX headed into the weekend with a pair of launches planned for Florida’s Space Coast with both supporting the company’s Starlink broadband satellite internet constellation. First up to bat was Starlink 6-89, which flew from Launch Complex 39A at NASA’s Kennedy Space Center. Source: spaceflightnow.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:five plead guilty to helping north koreans pretend to be usb:2025-11-14T23:08:31.000Z",
    "title": "Five plead guilty to helping North Koreans pretend to be US-based IT workers",
    "url": "https://www.engadget.com/big-tech/five-plead-guilty-to-helping-north-koreans-pretend-to-be-us-based-it-workers-230831417.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-14T23:08:31.000Z",
    "summary_long": "The US Department of Justice has announced that five people have pleaded guilty to helping North Koreans defraud US companies by pretending to be US-based remote workers. North Korea has previously used fake identities and the direct manipulation of US cybersecurity workers to circumvent international sanctions and funnel money into the country. In this case, the people knew they were helping North Koreans, the DOJ says, and \"provided their own, false, or stolen identities\" to help the remote workers get jobs. They also \"hosted U.S. Source: www.engadget.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the simslike paralives is delayed until may 2026:2025-11-14T17:49:22.000Z",
    "title": "The Sims-like Paralives is delayed until May 2026",
    "url": "https://www.engadget.com/gaming/pc/the-sims-like-paralives-is-delayed-until-may-2026-174922059.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-14T17:49:22.000Z",
    "summary_long": "Folks who are looking forward to a fresh flavor of life simulation in the form of Paralives will have to wait a while longer before they can jump into the Sims-like game. The game was supposed to hit early access on Steam on December 8, but lead developer Alex Massé and the team at Paralives Studio have pushed back the release date to May 25. Massé explained that the team expanded its playtests in the lead up to the early access period, \"and the latest feedback we received made us realize the game isn’t up to the standard we wanted it to meet for release.\" While the character creator and in-depth home builder modes seem to be in a solid place, playtesters encountered \"impactful bugs\" in the live mode and it appears that there isn't yet quite enough to do in the town. \"We feel it is necessary to work on these before delivering the product to the community,\" Massé…",
    "tags": []
  },
  {
    "id": "nextfrontiers:cheaper cars emit more pollution creating urban air quality :2025-11-14T17:21:22.000Z",
    "title": "Cheaper cars emit more pollution, creating urban air quality inequality",
    "url": "https://techxplore.com/news/2025-11-cheaper-cars-emit-pollution-urban.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-14T17:21:22.000Z",
    "summary_long": "Cheaper cars emit more pollution, creating urban air quality inequality Source: techxplore.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:anthropic warns of aidriven hacking campaign linked to china:2025-11-14T15:34:39.000Z",
    "title": "Anthropic warns of AI-driven hacking campaign linked to China",
    "url": "https://techxplore.com/news/2025-11-anthropic-ai-driven-hacking-campaign.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-14T15:34:39.000Z",
    "summary_long": "Anthropic warns of AI-driven hacking campaign linked to China Source: techxplore.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:anthropics ai was used by chinese hackers to run a cyberatta:2025-11-14T14:23:13.000Z",
    "title": "Anthropic's AI was used by Chinese hackers to run a Cyberattack",
    "url": "https://www.engadget.com/ai/anthropics-ai-was-used-by-chinese-hackers-to-run-a-cyberattack-142313551.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2025-11-14T14:23:13.000Z",
    "summary_long": "A few months ago, Anthropic published a report detailing how its Claude AI model had been weaponized in a \"vibe hacking\" extortion scheme. The company has continued to monitor how the agentic AI is being used to coordinate cyberattacks, and now claims that a state-backed group of hackers in China utilized Claude in an attempted infiltration of 30 corporate and political targets around the world, with some success. In what it labeled \"the first documented case of a large-scale cyberattack executed without substantial human intervention,\" Anthropic said that the hackers first chose their targets, which included unnamed tech companies, financial institutions and government agencies. They then used Claude Code to develop an automated attack framework, after successfully bypassing the model’s training to avoid harmful behavior. Source: www.engadget.com. Date: 2025-11-14. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]