[
  {
    "id": "bigtech:ai companies want you to stop chatting with bots and start m:2026-02-05T22:47:54.000Z",
    "title": "AI companies want you to stop chatting with bots and start managing them",
    "url": "https://arstechnica.com/information-technology/2026/02/ai-companies-want-you-to-stop-chatting-with-bots-and-start-managing-them/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2026-02-05T22:47:54.000Z",
    "summary_long": "On Thursday, Anthropic and OpenAI shipped products built around the same idea: instead of chatting with a single AI assistant, users should be managing teams of AI agents that divide up work and run in parallel. The simultaneous releases are part of a gradual shift across the industry, from AI as a conversation partner to AI as a delegated workforce, and they arrive during a week when that very concept reportedly helped wipe $285 billion off software stocks. Whether that supervisory model works in practice remains an open question. Current AI agents still require heavy human intervention to catch errors, and no independent evaluation has confirmed that these multi-agent tools reliably outperform a single developer working alone. Source: arstechnica.com. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:openai is hoppin mad about anthropics new super bowl tv ads:2026-02-05T17:46:59.000Z",
    "title": "OpenAI is hoppin' mad about Anthropic's new Super Bowl TV ads",
    "url": "https://arstechnica.com/information-technology/2026/02/openai-is-hoppin-mad-about-anthropics-new-super-bowl-tv-ads/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2026-02-05T17:46:59.000Z",
    "summary_long": "On Wednesday, OpenAI CEO Sam Altman and Chief Marketing Officer Kate Rouch complained on X after rival AI lab Anthropic released four commercials, two of which will run during the Super Bowl on Sunday, mocking the idea of including ads in AI chatbot conversations. Anthropic's campaign seemingly touched a nerve at OpenAI just weeks after the ChatGPT maker began testing ads in a lower-cost tier of its chatbot. Altman called Anthropic's ads \"clearly dishonest,\" accused the company of being \"authoritarian,\" and said it \"serves an expensive product to rich people,\" while Rouch wrote, \"Real betrayal isn't ads. It's control.\" Anthropic's four commercials, part of a campaign called \"A Time and a Place,\" each open with a single word splashed across the screen: \"Betrayal,\" \"Violation,\" \"Deception,\" and \"Treachery.\" They depict scenarios where a person asks a human stand-in for an AI chatbot for personal advice, only to get blindsided by a product pitch. Source: arstechnica.com. Date: 2026-02-05.",
    "tags": []
  },
  {
    "id": "bigtech:sapiom raises 15m to help ai agents buy their own tech tools:2026-02-05T23:53:42.000Z",
    "title": "Sapiom raises $15M to help AI agents buy their own tech tools",
    "url": "https://techcrunch.com/2026/02/05/sapiom-raises-15m-to-help-ai-agents-buy-their-own-tech-tools/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Marina Temkin",
    "published_at": "2026-02-05T23:53:42.000Z",
    "summary_long": "Sapiom raises $15M to help AI agents buy their own tech tools Source: techcrunch.com. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:hubble spots lensshaped galaxy:2026-02-05T16:39:36.000Z",
    "title": "Hubble Spots Lens-Shaped Galaxy",
    "url": "https://www.nasa.gov/image-article/hubble-spots-lens-shaped-galaxy/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-02-05T16:39:36.000Z",
    "summary_long": "This NASA/ESA Hubble Space Telescope image of NGC 7722, a lenticular galaxy located about 187 million light-years away, features concentric rings of dust and gas that appear to swirl around its bright nucleus. ESA/Hubble & NASA, R. J. Foley (UC Santa Cruz), Dark Energy Survey/DOE/FNAL/DECam/CTIO/NOIRLab/NSF/AURA; Acknowledgment: Mehmet Yüksek This new Hubble image, released on Jan. Source: www.nasa.gov. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:optimism stabilizes thompson sampling for adaptive inference:2026-02-05T18:52:54.000Z",
    "title": "Optimism Stabilizes Thompson Sampling for Adaptive Inference",
    "url": "https://arxiv.org/abs/2602.06014v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Shunxing Yan",
    "published_at": "2026-02-05T18:52:54.000Z",
    "summary_long": "Thompson sampling (TS) is widely used for stochastic multi-armed bandits, yet its inferential properties under adaptive data collection are subtle. Classical asymptotic theory for sample means can fail because arm-specific sample sizes are random and coupled with the rewards through the action-selection rule. We study this phenomenon in the $K$-armed Gaussian bandit and identify \\emph{optimism} as a key mechanism for restoring \\emph{stability}, a sufficient condition for valid asymptotic inference requiring each arm's pull count to concentrate around a deterministic scale. First, we prove that variance-inflated TS \\citep{halder2025stable} is stable for any $K \\ge 2$, including the challenging regime where multiple arms are optimal. Source: arxiv.org. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:dimensionality reduction on riemannian manifolds in data ana:2026-02-05T17:46:58.000Z",
    "title": "Dimensionality Reduction on Riemannian Manifolds in Data Analysis",
    "url": "https://arxiv.org/abs/2602.05936v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Alaa El Ichi",
    "published_at": "2026-02-05T17:46:58.000Z",
    "summary_long": "In this work, we investigate Riemannian geometry based dimensionality reduction methods that respect the underlying manifold structure of the data. In particular, we focus on Principal Geodesic Analysis (PGA) as a nonlinear generalization of PCA for manifold valued data, and extend discriminant analysis through Riemannian adaptations of other known dimensionality reduction methods. These approaches exploit geodesic distances, tangent space representations, and intrinsic statistical measures to achieve more faithful low dimensional embeddings. We also discuss related manifold learning techniques and highlight their theoretical foundations and practical advantages. Source: arxiv.org. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:fhaim fully homomorphic aim for private synthetic data gener:2026-02-05T16:28:13.000Z",
    "title": "FHAIM: Fully Homomorphic AIM For Private Synthetic Data Generation",
    "url": "https://arxiv.org/abs/2602.05838v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Mayank Kumar",
    "published_at": "2026-02-05T16:28:13.000Z",
    "summary_long": "Data is the lifeblood of AI, yet much of the most valuable data remains locked in silos due to privacy and regulations. As a result, AI remains heavily underutilized in many of the most important domains, including healthcare, education, and finance. Synthetic data generation (SDG), i.e. the generation of artificial data with a synthesizer trained on real data, offers an appealing solution to make data available while mitigating privacy concerns, however existing SDG-as-a-service workflow require data holders to trust providers with access to private data.We propose FHAIM, the first fully homomorphic encryption (FHE) framework for training a marginal-based synthetic data generator on encrypted tabular data. Source: arxiv.org. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas spacex crew12 to study adaptation to altered gravity:2026-02-05T18:38:08.000Z",
    "title": "NASA’s SpaceX Crew-12 to Study Adaptation to Altered Gravity",
    "url": "https://www.nasa.gov/humans-in-space/nasas-spacex-crew-12-to-study-adaptation-to-altered-gravity/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Nathan Cranford",
    "published_at": "2026-02-05T18:38:08.000Z",
    "summary_long": "Pictured from left: Roscosmos cosmonaut Andrey Fedyaev, NASA astronauts Jack Hathaway and Jessica Meir, and ESA (European Space Agency) astronaut Sophie Adenot. Credit: NASA NASA’s SpaceX Crew-12 mission is preparing to launch for a long-duration science mission aboard the International Space Station. During the mission, select crew members will participate in human health studies focused on understanding how astronauts’ bodies adapt to the low-gravity environment of space, including a new study examining subtle changes in blood flow. The experiments, led by NASA’s Human Research Program, include astronauts performing ultrasounds of their blood vessels to study altered circulation and completing simulated lunar landings to assess disorientation during gravitational transitions, among other tasks. Source: www.nasa.gov. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the switch 2exclusive coop adventure orbitals launches this :2026-02-05T18:06:57.000Z",
    "title": "The Switch 2-exclusive co-op adventure Orbitals launches this summer",
    "url": "https://www.engadget.com/gaming/nintendo/the-switch-2-exclusive-co-op-adventure-orbitals-launches-this-summer-180657892.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-02-05T18:06:57.000Z",
    "summary_long": "Nintendo capped off today’s partner-focused Nintendo Direct with a flurry of Bethesda-related announcements, but arguably the most interesting game of the showcase appeared right at the start. First announced at the beginning of the year, Orbitals is a two-player puzzle adventure game in which you and your co-op partner play as the intergalactic explorers Maki and Omura, on a mission to save their home in the stars from an incoming cosmic storm. Gameplay-wise, Orbitals looks like it’s at least partly inspired by the likes of It Takes Two and Split Fiction, but really what really stands out here is the 90s anime-inspired visuals. The game is absolutely dripping in style, and somehow looks just as good in motion as it does in cutscenes. Source: www.engadget.com. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:jlabs comically oversized headphones are not an april fools :2026-02-05T17:43:38.000Z",
    "title": "JLab's comically oversized headphones are not an April Fool's Prank",
    "url": "https://www.engadget.com/audio/jlabs-comically-oversized-headphones-are-not-an-april-fools-prank-174338833.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2026-02-05T17:43:38.000Z",
    "summary_long": "JLab just released a gigantic pair of headphones that doubles as a Bluetooth speaker. The Blue XL headphones are ridiculously oversized, making them headphones in name only. I don't even think Andre the Giant could've comfortably worn these suckers. Unless you have a mythically large head, these are basically \"headphone speakers.\" The idea is to drape them around your neck and stream tunes for all to hear. Source: www.engadget.com. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:nvidia reportedly wont release new graphics cards this year:2026-02-05T17:30:02.000Z",
    "title": "NVIDIA reportedly won't release new graphics cards this year",
    "url": "https://www.engadget.com/gaming/pc/nvidia-reportedly-wont-release-new-graphics-cards-this-year-173002651.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2026-02-05T17:30:02.000Z",
    "summary_long": "With gaming becoming an ever-smaller part of NVIDIA's lucrative business, the company reportedly won't bother releasing new graphics cards this year. The Information reported on Thursday that NVIDIA has pushed back its plan to release an update to the RTX 50 line in 2026. This would be the first time in three decades that the company hasn't launched new gaming chips. The culprit? Source: www.engadget.com. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:study identifies key elements that determine impact of ai on:2026-02-05T16:20:06.000Z",
    "title": "Study identifies key elements that determine impact of AI on jobs",
    "url": "https://techxplore.com/news/2026-02-key-elements-impact-ai-jobs.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-05T16:20:06.000Z",
    "summary_long": "Research by academics at King's College London and the AI Objectives Institute has shed light on why what matters is not just how much of a job AI can do, but which parts. Dr. Bouke Klein Teeselink and Daniel Carey analyzed hundreds of millions of job postings across 39 countries before and after the release of ChatGPT in November 2022. They found that occupations with a large number of tasks exposed to AI automation, for example basic administration or data entry, saw a 6.1% decline in job postings on average. Source: techxplore.com. Date: 2026-02-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]