[
  {
    "id": "bigtech:google recovers deleted nest video in highprofile abduction :2026-02-11T20:15:54.000Z",
    "title": "Google recovers \"deleted\" Nest video in high-profile abduction case",
    "url": "https://arstechnica.com/google/2026/02/google-recovers-deleted-nest-video-in-high-profile-abduction-case/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2026-02-11T20:15:54.000Z",
    "summary_long": "Like most cloud-enabled home security cameras, Google's Nest products don't provide long-term storage unless you pay a monthly fee. That video may not vanish into the digital aether right on time, though. Investigators involved with the high-profile abduction of Nancy Guthrie have released video from Guthrie's Nest doorbell camera—video that was believed to have been deleted because Guthrie wasn't paying for the service. Google's cameras connect to the recently upgraded Home Premium subscription service. Source: arstechnica.com. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:us decides spacex is like an airline exempting it from labor:2026-02-11T20:05:44.000Z",
    "title": "US decides SpaceX is like an airline, exempting it from Labor Relations Act",
    "url": "https://arstechnica.com/tech-policy/2026/02/victory-for-elon-musk-us-labor-board-abandons-authority-over-spacex/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2026-02-11T20:05:44.000Z",
    "summary_long": "The National Labor Relations Board abandoned a Biden-era complaint against SpaceX after a finding that the agency does not have jurisdiction over Elon Musk's space company. The US labor board said SpaceX should instead be regulated under the Railway Labor Act, which governs labor relations at railroad and airline companies. The Railway Labor Act is enforced by a separate agency, the National Mediation Board, and has different rules than the National Labor Relations Act enforced by the NLRB. For example, the Railway Labor Act has an extensive dispute-resolution process that makes it difficult for railroad and airline employees to strike. Source: arstechnica.com. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:spacex takes down dragon crew arm giving starship a leg up i:2026-02-12T02:23:50.000Z",
    "title": "SpaceX takes down Dragon crew arm, giving Starship a leg up in Florida",
    "url": "https://arstechnica.com/space/2026/02/heres-why-americas-most-historic-launch-pad-is-getting-yet-another-facelift/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2026-02-12T02:23:50.000Z",
    "summary_long": "Launch Complex 39A at NASA's Kennedy Space Center in Florida is accustomed to getting makeovers. It got another one Wednesday with the removal of the Crew Access Arm used by astronauts to board their rides to space. Construction workers first carved the footprint for the launch pad from the Florida wetlands more than 60 years ago. NASA used the site to launch Saturn V rockets dispatching astronauts to the Moon, then converted the pad for the Space Shuttle program. Source: arstechnica.com. Date: 2026-02-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:diffusionpretrained dense and contextual embeddings:2026-02-11T18:59:08.000Z",
    "title": "Diffusion-Pretrained Dense and Contextual Embeddings",
    "url": "https://arxiv.org/abs/2602.11151v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sedigheh Eslami",
    "published_at": "2026-02-11T18:59:08.000Z",
    "summary_long": "In this report, we introduce pplx-embed, a family of multilingual embedding models that employ multi-stage contrastive learning on a diffusion-pretrained language model backbone for web-scale retrieval. By leveraging bidirectional attention through diffusion-based pretraining, our models capture comprehensive bidirectional context within passages, enabling the use of mean pooling and a late chunking strategy to better preserve global context across long documents. We release two model types: pplx-embed-v1 for standard retrieval, and pplx-embed-context-v1 for contextualized embeddings that incorporate global document context into passage representations. pplx-embed-v1 achieves competitive performance on the MTEB(Multilingual, v2), MTEB(Code), MIRACL, BERGEN, and ToolRet retrieval benchmarks, while pplx-embed-context-v1 sets new records on the ConTEB benchmark. Source: arxiv.org. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:yor your own mobile manipulator for generalizable robotics:2026-02-11T18:59:00.000Z",
    "title": "YOR: Your Own Mobile Manipulator for Generalizable Robotics",
    "url": "https://arxiv.org/abs/2602.11150v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Manan H Anjaria",
    "published_at": "2026-02-11T18:59:00.000Z",
    "summary_long": "Recent advances in robot learning have generated significant interest in capable platforms that may eventually approach human-level competence. This interest, combined with the commoditization of actuators, has propelled growth in low-cost robotic platforms. However, the optimal form factor for mobile manipulation, especially on a budget, remains an open question. We introduce YOR, an open-source, low-cost mobile manipulator that integrates an omnidirectional base, a telescopic vertical lift, and two arms with grippers to achieve whole-body mobility and manipulation. Source: arxiv.org. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:formaljudge a neurosymbolic paradigm for agentic oversight:2026-02-11T18:48:11.000Z",
    "title": "FormalJudge: A Neuro-Symbolic Paradigm for Agentic Oversight",
    "url": "https://arxiv.org/abs/2602.11136v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Jiayi Zhou",
    "published_at": "2026-02-11T18:48:11.000Z",
    "summary_long": "As LLM-based agents increasingly operate in high-stakes domains with real-world consequences, ensuring their behavioral safety becomes paramount. The dominant oversight paradigm, LLM-as-a-Judge, faces a fundamental dilemma: how can probabilistic systems reliably supervise other probabilistic systems without inheriting their failure modes? We argue that formal verification offers a principled escape from this dilemma, yet its adoption has been hindered by a critical bottleneck: the translation from natural language requirements to formal specifications. This paper bridges this gap by proposing , a neuro-symbolic framework that employs a bidirectional Formal-of-Thought architecture: LLMs serve as specification compilers that top-down decompose high-level human intent into atomic, verifiable constraints, then bottom-up prove compliance using Dafny specifications and Z3 Satisfiability modulo theories solving, which produces mathematical guarantees rather than probabilistic scores. Source: arxiv.org. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:amazons sameday prescription deliveries are coming to even m:2026-02-11T19:22:21.000Z",
    "title": "Amazon's same-day prescription deliveries are coming to even more cities",
    "url": "https://www.engadget.com/big-tech/amazons-same-day-prescription-deliveries-are-coming-to-even-more-cities-192221224.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2026-02-11T19:22:21.000Z",
    "summary_long": "Amazon has announced that it will bring its same-day prescription delivery service to 4,500 new cities and towns by the end of 2026. The company originally launched Amazon Pharmacy in 2020 with a two-day delivery option, and has continued to increase the availability and delivery speed of the service in the years that followed, including expanding access to nearly half of all US residents in 2024. The company's announcement doesn't break down all the new cities same-day deliveries will be available in, but does note that the delivery option is coming to Idaho and Massachusetts for the first time. In the past, access to same-day deliveries has been determined by where Amazon has fulfillment centers that it can open pharmacies in. Source: www.engadget.com. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:opensource modular robot for understanding evolution:2026-02-11T17:10:48.000Z",
    "title": "Open-source modular robot for understanding evolution",
    "url": "https://techxplore.com/news/2026-02-source-modular-robot-evolution.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-11T17:10:48.000Z",
    "summary_long": "What is it about a cheetah's build that enables it to run so fast? What gives the wolf its exceptional endurance? While these questions can be partly answered through animal experiments, many contributing factors can't be isolated from one another. Now, a new tool has arrived: a highly customizable, open-source robot design called The Robot of Theseus, or TROT, developed at the University of Michigan. Source: techxplore.com. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:i am artemis jesse berdis:2026-02-11T17:01:22.000Z",
    "title": "I Am Artemis: Jesse Berdis",
    "url": "https://www.nasa.gov/missions/artemis/artemis-2/i-am-artemis-jesse-berdis/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Antonia Jaramillo",
    "published_at": "2026-02-11T17:01:22.000Z",
    "summary_long": "3 Min Read I AM ARTEMIS: JESSE BERDIS Listen to this audio excerpt from Jesse Berdis, Artemis II mobile launcher 1 deputy project manager: 0:00 / 0:00 Your browser does not support the audio element. Jesse Berdis’s dream of becoming a structural engineer began with visions of skyscrapers rising above the Dallas and Oklahoma skyline. Today, that dream has soared beyond city limits, reaching towering heights at the agency’s Kennedy Space Center in Florida. Berdis, the deputy project manager for mobile launcher 1 for the agency’s Artemis II mission, had a path to NASA which was anything but planned. Source: www.nasa.gov. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:crew12 members and insignia:2026-02-11T15:53:49.000Z",
    "title": "Crew-12 Members and Insignia",
    "url": "https://www.nasa.gov/image-article/crew-12-members-and-insignia/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-02-11T15:53:49.000Z",
    "summary_long": "NASA/Kim Shiflett From left, Roscosmos cosmonaut Andrey Fedyaev, NASA astronauts Jack Hathaway and Jessica Meir, and ESA (European Space Agency) astronaut Sophie Adenot pose next to their mission insignia inside the Astronaut Crew Quarters in the Neil A. Armstrong Operations and Checkout Building at NASA’s Kennedy Space Center in Florida on Monday, Feb. 9, 2026. NASA’s SpaceX Crew-12 crew members will launch aboard a SpaceX Dragon spacecraft and Falcon 9 to the International Space Station no earlier than 5:15 a.m. Source: www.nasa.gov. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:uber eats new cart assistant feature is an ai hack for your :2026-02-11T14:57:33.000Z",
    "title": "Uber Eats’ new Cart Assistant feature is an AI hack for your grocery shopping",
    "url": "https://www.engadget.com/ai/uber-eats-new-cart-assistant-feature-is-an-ai-hack-for-your-grocery-shopping-145733478.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-02-11T14:57:33.000Z",
    "summary_long": "If there’s any area of your life that you might be willing to introduce more AI into, it’s likely something as mundane as grocery shopping. That’s what Uber is betting on with its new AI-powered feature in the Uber Eats app. Cart Assistant lets you \"build grocery baskets faster and with less effort\" by using AI to automatically fill your basket with items included on your shopping list. To use it, you search for a supported grocery store on the home screen of the app and tap the new Cart Assistant icon that appears at the top of the screen. Source: www.engadget.com. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage ula to launch geosynchronous orbit surveillanc:2026-02-11T20:06:16.000Z",
    "title": "Live coverage: ULA to launch geosynchronous orbit surveillance satellite for the U.S. Space Force",
    "url": "https://spaceflightnow.com/2026/02/11/live-coverage-ula-to-launch-geosynchronous-orbit-surveillance-satellite-for-the-u-s-space-force/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-02-11T20:06:16.000Z",
    "summary_long": "United Launch Alliance is gearing up for a predawn launch of its Vulcan rocket on Thursday morning, the companies first flight of the year. The United States Space Force (USSF)-87 mission consists of multiple satellites, though the exact number was not publicly disclosed prior to launch. This is ULA’s second national security mission using its Vulcan rockets and will also be the company’s longest mission to date. “This mission will last, total duration from launch to end of mission, 10 hours. Source: spaceflightnow.com. Date: 2026-02-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]