[
  {
    "id": "bigtech:strava eyes ipo as gen z trades dating apps for running club:2025-10-13T05:15:24.000Z",
    "title": "Strava eyes IPO as Gen Z trades dating apps for running clubs",
    "url": "https://techcrunch.com/2025/10/12/strava-eyes-ipo-as-gen-z-trades-dating-apps-for-running-clubs/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Connie Loizos",
    "published_at": "2025-10-13T05:15:24.000Z",
    "summary_long": "Strava, the 16-year-old fitness tracking app, is gearing up to go public, the Financial Times reports. CEO Michael Martin told the FT that the San Francisco company plans to list “at some point,” eyeing capital for more acquisitions. The company, backed by Sequoia Capital, TCV, and Jackson Square Ventures, was last valued at $2.2 billion […] Source: techcrunch.com. Date: 2025-10-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch final version 2 starshipsuper:2025-10-12T21:56:50.000Z",
    "title": "Live coverage: SpaceX to launch final Version 2 Starship-Super Heavy from Starbase",
    "url": "https://spaceflightnow.com/2025/10/12/live-coverage-spacex-to-launch-final-version-2-starship-super-heavy-from-starbase/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-12T21:56:50.000Z",
    "summary_long": "SpaceX is preparing for a notable flight for its Starship program. The company is scheduled to launch its Starship-Super Heavy rocket from its headquarters in Starbase, Texas, on Monday evening. The 11th flight test of the integrated Starship launch vehicle will be the final mission both for the Version 2 iteration of the rocket as well as the current configuration of Pad A. SpaceX is targeting liftoff at 6:15 p.m. Source: spaceflightnow.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:spacex will attempt starships 11th flight test on monday:2025-10-12T20:42:37.000Z",
    "title": "SpaceX will attempt Starship's 11th flight test on Monday",
    "url": "https://www.engadget.com/science/space/spacex-will-attempt-starships-11th-flight-test-on-monday-204237829.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-12T20:42:37.000Z",
    "summary_long": "SpaceX is gearing up for the 11th flight test of its Starship megarocket, which will launch from its Starbase in Texas as early as Monday. The launch window opens on October 13 at 7:15PM ET. You'll be able to watch live starting 30 minutes before liftoff on the SpaceX website and on X. Starship's latest flight follows a successful test at the end of August, during which it deployed a payload — eight dummy Starlink satellites — in space for the first time following a failed attempt earlier in the year. Source: www.engadget.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:green shoots on china lifts crypto in sunday action:2025-10-12T16:42:58.000Z",
    "title": "Green Shoots on China Lifts Crypto in Sunday Action",
    "url": "https://www.coindesk.com/markets/2025/10/12/green-shoots-on-china-lifts-crypto-in-sunday-action",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Stephen Alpher",
    "published_at": "2025-10-12T16:42:58.000Z",
    "summary_long": "A modest reversal from Friday evening's carnage in crypto markets is underway after some calming trade war-related remarks from both Beijing and Washington. The walk-backs began late Saturday when China's Ministry of Commerce said its rare-earth export controls are not blanket bans, and that eligible applications will continue to receive licenses. The agency further said it expected those controls to have just a \"minimal impact\" on global production and supply chains. In D.C. Source: www.coindesk.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the first products with apples m5 chip could make their debu:2025-10-12T16:31:49.000Z",
    "title": "The first products with Apple's M5 chip could make their debut this week",
    "url": "https://www.engadget.com/big-tech/the-first-products-with-apples-m5-chip-could-make-their-debut-this-week-163149688.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-10-12T16:31:49.000Z",
    "summary_long": "We may only be a few days away from the big reveal of Apple's latest chips. According to Bloomberg's Mark Gurman, Apple is getting ready to release its October lineup of new products powered by the M5 chip as soon as this week. In the latest Power On newsletter, Gurman expects announcements for an upgraded iPad Pro, a refreshed Vision Pro with a revamped strap, and the new base model MacBook Pro, all of which will come with the latest Apple silicon. Previously, the expected launch for the M5 MacBook Pro flip-flopped between early next year and its typical fall release. Source: www.engadget.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:chinas commerce ministry to trump rareearth export curbs are:2025-10-12T10:10:45.000Z",
    "title": "China’s Commerce Ministry to Trump: Rare-Earth Export Curbs Are Not Bans",
    "url": "https://www.coindesk.com/markets/2025/10/12/china-s-commerce-ministry-to-trump-rare-earth-export-curbs-are-not-bans",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-10-12T10:10:45.000Z",
    "summary_long": "China’s Ministry of Commerce (MOFCOM) says its new rare-earth export controls are lawful national-security steps — not blanket bans — and that licenses will be issued for eligible civilian trade, according to a spokesperson’s Q&A posted on X Sunday morning local time. Rare earths — a group of 17 elements used in permanent-magnet motors for electric vehicles (EVs) and wind turbines, defense electronics and other high-tech gear — occupy an outsized role in supply chains because China dominates the sector. Beijing accounts for roughly 70% of global production and about 90% of processing and refining; so licensing shifts can ripple downstream even when mining or final manufacturing happens elsewhere. In remarks published only hours ago, the MOFCOM spokesperson framed the Oct. Source: www.coindesk.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:nvidias ai empire a look at its top startup investments:2025-10-12T15:30:28.000Z",
    "title": "Nvidia’s AI empire: A look at its top startup investments",
    "url": "https://techcrunch.com/2025/10/12/nvidias-ai-empire-a-look-at-its-top-startup-investments/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Marina Temkin",
    "published_at": "2025-10-12T15:30:28.000Z",
    "summary_long": "Nvidia’s AI empire: A look at its top startup investments Source: techcrunch.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:altcoins cratered in oct 10 crypto flash crash as bitcoin he:2025-10-12T17:34:38.000Z",
    "title": "Altcoins Cratered in Oct. 10 Crypto Flash Crash as Bitcoin Held Up, Wiston Capital Says",
    "url": "https://www.coindesk.com/markets/2025/10/12/altcoins-cratered-in-oct-10-crypto-flash-crash-as-bitcoin-held-up-wiston-capital-says",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-10-12T17:34:38.000Z",
    "summary_long": "Friday’s crypto sell-off was a fast, leverage-driven cascade that crushed altcoins while bitcoin held up comparatively better — and the next phase hinges on a handful of signals, according to Wiston Capital Founder Charlie Erith. In a Sunday post titled “Crypto Crumble,” Erith said the market excluding bitcoin, ether and stablecoins fell about 33% in roughly 25 minutes on Oct. 10 before bouncing to a loss of around 10.6%. He added that about $560 billion, or 13.1%, has been erased from total crypto market value since Oct. Source: www.coindesk.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:apple hit with another class action lawsuit for alleged copy:2025-10-12T17:52:42.000Z",
    "title": "Apple hit with another class action lawsuit for alleged copyright infringement",
    "url": "https://www.engadget.com/ai/apple-hit-with-another-class-action-lawsuit-for-alleged-copyright-infringement-175242922.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-10-12T17:52:42.000Z",
    "summary_long": "Just about a month after being accused of using pirated books to train its AI, Apple is facing another similar proposed class action lawsuit. As first reported by Bloomberg Law, two neuroscience professors from SUNY Downstate Health Sciences University in Brooklyn, NY, claimed that Apple used their \"registered works without authorization.\" The neuroscientists, Susana Martinez-Conde and Stephen Macknik, said Apple trained its AI models using \"shadow libraries\" and \"web-crawling software\" that provide access to pirated, copyrighted books, including two of their own. In the previous class action lawsuit, a separate pair of authors also alleged that Apple committed copyright infringement when using published works to train Apple Intelligence models without consent. Apple isn't the only tech giant facing copyright lawsuits related to its AI, as OpenAI is in a similar situation after being sued by The New York Times for similar accusations. Source: www.engadget.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:elon musk vs the regulators:2025-10-12T16:02:00.000Z",
    "title": "Elon Musk vs. the regulators",
    "url": "https://techcrunch.com/2025/10/12/elon-musk-vs-the-regulators/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Kirsten Korosec",
    "published_at": "2025-10-12T16:02:00.000Z",
    "summary_long": "Elon Musk vs. the regulators Source: techcrunch.com. Date: 2025-10-12. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]