[
  {
    "id": "bigtech:sciencecentric streaming service curiosity stream is an aili:2025-11-21T23:00:24.000Z",
    "title": "Science-centric streaming service Curiosity Stream is an AI-licensing firm now",
    "url": "https://arstechnica.com/gadgets/2025/11/curiosity-stream-expects-to-make-most-of-its-money-from-ai-deals-by-2027/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Scharon Harding\n                ",
    "published_at": "2025-11-21T23:00:24.000Z",
    "summary_long": "But science streaming service Curiosity Stream is taking a new route that could reshape how streaming companies, especially niche options, try to survive. Discovery Channel founder John Hendricks launched Curiosity Stream in 2015. The streaming service costs $40 per year, and it doesn’t have commercials. The streaming business has grown to also include the Curiosity Channel TV channel. Source: arstechnica.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:how to know if your asus router is one of thousands hacked b:2025-11-21T22:05:20.000Z",
    "title": "How to know if your Asus router is one of thousands hacked by China-state hackers",
    "url": "https://arstechnica.com/security/2025/11/thousands-of-hacked-asus-routers-are-under-control-of-suspected-china-state-hackers/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-11-21T22:05:20.000Z",
    "summary_long": "Thousands of Asus routers have been hacked and are under the control of a suspected China-state group that has yet to reveal its intentions for the mass compromise, researchers said. The hacking spree is either primarily or exclusively targeting seven models of Asus routers, all of which are no longer supported by the manufacturer, meaning they no longer receive security patches, researchers from SecurityScorecard said. So far, it’s unclear what the attackers do after gaining control of the devices. SecurityScorecard has named the operation WrtHug. Source: arstechnica.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:tech company cto and others indicted for exporting nvidia ch:2025-11-21T20:29:07.000Z",
    "title": "Tech company CTO and others indicted for exporting Nvidia chips to China",
    "url": "https://arstechnica.com/tech-policy/2025/11/tech-company-cto-and-others-indicted-for-exporting-nvidia-chips-to-china/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-11-21T20:29:07.000Z",
    "summary_long": "The US crackdown on chip exports to China has continued with the arrests of four people accused of a conspiracy to illegally export Nvidia chips. Two US citizens and two nationals of the People’s Republic of China (PRC), all of whom live in the US, were charged in an indictment unsealed on Wednesday in US District Court for the Middle District of Florida. The indictment alleges a scheme to send Nvidia “GPUs to China by falsifying paperwork, creating fake contracts, and misleading US authorities,” John Eisenberg, assistant attorney general for the Justice Department’s National Security Division, said in a press release yesterday. The four arrestees are Hon Ning Ho (aka Mathew Ho), a US citizen who was born in Hong Kong and lives in Tampa, Florida; Brian Curtis Raymond, a US citizen who lives in Huntsville, Alabama; Cham Li (aka Tony Li), a PRC national who lives in San Leandro, California; and Jing Chen (aka Harry Chen), a PRC national…",
    "tags": []
  },
  {
    "id": "consumer:you can now search the epstein emails in a simulated gmail t:2025-11-21T20:38:18.000Z",
    "title": "You can now search the Epstein emails in a simulated Gmail tab",
    "url": "https://www.engadget.com/entertainment/you-can-now-search-the-epstein-emails-in-a-simulated-gmail-tab-203818438.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2025-11-21T20:38:18.000Z",
    "summary_long": "Here's some light — and revolting! — reading while we wait for the Epstein Files to be released (or stonewalled). You can now peruse the Jeffrey Epstein emails, recently released by Congress, in a simulated Gmail account. \"You're logged in as Jeffrey Epstein,\" the Jmail website reads. Source: www.engadget.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:australia is adding twitch to its social media ban for child:2025-11-21T20:20:33.000Z",
    "title": "Australia is adding Twitch to its social media ban for children",
    "url": "https://www.engadget.com/social-media/australia-is-adding-twitch-to-its-social-media-ban-for-children-202033276.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-11-21T20:20:33.000Z",
    "summary_long": "The breadth and reach of Australia's pioneering social media ban grows as livestream platform Twitch has now been added to the list of banned platforms for users under 16 years of age. The nationwide ban is the first of its kind and encompasses Facebook, X, TikTok, Snapchat, YouTube and recently Reddit. According to the BBC, Australia's eSafety Commissioner Julie Inman Grant said Twitch had been included because it was \"a platform most commonly used for livestreaming or posting content that enables users, including Australian children, to interact with others in relation to the content posted.\" No other platforms are expected to be added before the law goes into effect next month. Grant also said on Friday that Pinterest would not be included in the ban because the core purpose of the platform was not online social interaction. Source: www.engadget.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "consumer:the booster for spacexs starship v3 suffered a gas system fa:2025-11-21T18:14:59.000Z",
    "title": "The booster for SpaceX's Starship V3 suffered a gas system failure during testing",
    "url": "https://www.engadget.com/science/space/the-booster-for-spacexs-starship-v3-suffered-a-gas-system-failure-during-testing-181459063.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-11-21T18:14:59.000Z",
    "summary_long": "SpaceX has confirmed that its third-gen Super Heavy Booster, the first stage of the two-stage Starship system, suffered an explosive gas failure of sorts during testing on Thursday morning. In a post on X, the aerospace company said, \"Booster 18 suffered an anomaly during gas system pressure testing that we were conducting in advance of structural proof testing.\" There was no propellant inside the booster as the engines were not installed at that point. No injuries were reported and the company shared that personnel are always kept at a safe distance during these types of tests. The company said it will \"need time to investigate before we are confident of the cause.\" The explosive release of gas, or whatever it was, seems to have blown out the side of the bottom half of the booster. Source: www.engadget.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage falcon 9 rocket to continue starlink deploymen:2025-11-21T23:30:41.000Z",
    "title": "Live coverage: Falcon 9 rocket to continue Starlink deployments with launch from Cape Canaveral",
    "url": "https://spaceflightnow.com/2025/11/21/live-coverage-falcon-9-rocket-to-continue-starlink-deployments-with-launch-from-cape-canaveral/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Steven Young",
    "published_at": "2025-11-21T23:30:41.000Z",
    "summary_long": "SpaceX is planning to launch a Falcon 9 rocket from Cape Canaveral in the early hours Saturday as the company continues to expand its network of more than 9,000 satellites for the Starlink internet service. Liftoff from Space Launch Complex 40 at Cape Canaveral Space Force Station is scheduled during a four-hour launch window that opens at 2:53 a.m. EST (0753 UTC). It will be the ninth of as many as 11 Starlink missions planned this month and the 109th Starlink delivery run for the Falcon 9 rocket this year. Source: spaceflightnow.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:smarter ai processing for cleaner air a blueprint to cut pol:2025-11-21T16:04:17.000Z",
    "title": "Smarter AI processing for cleaner air: A blueprint to cut pollution and prolong server life",
    "url": "https://techxplore.com/news/2025-11-smarter-ai-cleaner-air-blueprint.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-21T16:04:17.000Z",
    "summary_long": "As artificial intelligence becomes more powerful and widespread, so does the environmental cost of running it. Behind every chatbot, image generator, and television streaming recommendation are massive banks of millions of computers housed in an increasing number of data centers that consume staggering amounts of electricity and water to keep their machines cool. Most of that electricity is still produced by fossil fuel-burning power plants, which contribute directly to air pollution and climate change. Source: techxplore.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:2b counterstrike 2 crash exposes a legal black hole your dig:2025-11-21T18:01:11.000Z",
    "title": "$2B Counter-Strike 2 crash exposes a legal black hole: Your digital investments aren't really yours",
    "url": "https://techxplore.com/news/2025-11-2b-counter-exposes-legal-black.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-11-21T18:01:11.000Z",
    "summary_long": "In late October 2025, as much as US$2 billion vanished from a digital marketplace. This wasn't a hack or a bubble bursting. It happened because one company, Valve, changed the rules for its video game Counter-Strike 2, a popular first-person shooter with a global player base of nearly 30 million monthly users. Source: techxplore.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa awards liquid hydrogen supply contracts:2025-11-21T21:15:24.000Z",
    "title": "NASA Awards Liquid Hydrogen Supply Contracts",
    "url": "https://www.nasa.gov/news-release/nasa-awards-liquid-hydrogen-supply-contracts/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Tiernan P. Doyle",
    "published_at": "2025-11-21T21:15:24.000Z",
    "summary_long": "Credit: NASA NASA has selected Plug Power, Inc., of Slingerlands, New York, and Air Products and Chemicals, Inc., of Allentown, Pennsylvania, to supply up to approximately 36,952,000 pounds of liquid hydrogen for use at facilities across the agency. The NASA Agency-wide Supply of Liquid Hydrogen awards are firm-fixed-price requirements contracts that include multiple firm-fixed-price delivery orders critical for the agency’s centers as they use liquid hydrogen, combined with liquid oxygen, as fuel in cryogenic rocket engines, and the commodity’s unique properties support the development of aeronautics. The total value for the combined awards is about $147.2 million. The contracts begin Monday, Dec. Source: www.nasa.gov. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bitmine immersion sitting on 4b loss on ether bet as analyst:2025-11-21T18:06:51.000Z",
    "title": "BitMine Immersion Sitting on $4B Loss on Ether Bet as Analyst Warns of Structural issues",
    "url": "https://www.coindesk.com/business/2025/11/21/bitmine-immersion-sitting-on-usd4b-unrealized-loss-on-ether-bet-as-analyst-warns-of-structural-issues",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-11-21T18:06:51.000Z",
    "summary_long": "BitMine Immersion Sitting on $4B Loss on Ether Bet as Analyst Warns of Structural issues Source: www.coindesk.com. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:10 years of students helping nasa grow space food with growi:2025-11-21T18:25:08.000Z",
    "title": "10 Years of Students Helping NASA Grow Space Food with Growing Beyond Earth",
    "url": "https://science.nasa.gov/learning-resources/science-activation/10-years-of-students-helping-nasa-grow-space-food-with-growing-beyond-earth/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-11-21T18:25:08.000Z",
    "summary_long": "Explore This Section 1. Science 2. Science Activation 3. 10 Years of Students Helping… * Overview * Learning Resources * Science Activation Teams * SME Map * Opportunities * More * Science Activation Stories * Citizen Science 3 min read 10 YEARS OF STUDENTS HELPING NASA GROW SPACE FOOD WITH GROWING BEYOND EARTH Students from 71 Classrooms engaged with NASA scientists to learn about how their Growing Beyond Earth research is contributing to feeding astronauts for long distance space travel. Source: science.nasa.gov. Date: 2025-11-21. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]