[
  {
    "id": "bigtech:password managers promise that they cant see your vaults isn:2026-02-17T20:43:01.000Z",
    "title": "Password managers' promise that they can't see your vaults isn't always true",
    "url": "https://arstechnica.com/security/2026/02/password-managers-promise-that-they-cant-see-your-vaults-isnt-always-true/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2026-02-17T20:43:01.000Z",
    "summary_long": "Over the past 15 years, password managers have grown from a niche security tool used by the technology savvy into an indispensable security tool for the masses, with an estimated 94 million US adults—or roughly 36 percent of them—having adopted them. They store not only passwords for pension, financial, and email accounts, but also cryptocurrency credentials, payment card numbers, and other sensitive data. All eight of the top password managers have adopted the term “zero knowledge” to describe the complex encryption system they use to protect the data vaults that users store on their servers. The definitions vary slightly from vendor to vendor, but they generally boil down to one bold assurance: that there is no way for malicious insiders or hackers who manage to compromise the cloud infrastructure to steal vaults or data stored in them. Source: arstechnica.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:most vmware users still actively reducing their vmware footp:2026-02-17T18:38:10.000Z",
    "title": "Most VMware users still \"actively reducing their VMware footprint,\" survey finds",
    "url": "https://arstechnica.com/information-technology/2026/02/most-vmware-users-still-actively-reducing-their-vmware-footprint-survey-finds/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Scharon Harding\n                ",
    "published_at": "2026-02-17T18:38:10.000Z",
    "summary_long": "More than two years after Broadcom took over VMware, the virtualization company’s customers are still grappling with higher prices, uncertainty, and the challenges of reducing vendor lock-in. Today, CloudBolt Software released a report, \"The Mass Exodus That Never Was: The Squeeze Is Just Beginning,\" that provides insight into those struggles. CloudBolt is a hybrid cloud management platform provider that aims to identify VMware customers’ pain points so it can sell them relevant solutions. In the report, CloudBolt said it surveyed 302 IT decision-makers (director-level or higher) at North American companies with at least 1,000 employees in January. Source: arstechnica.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:ram shortage hits valves fouryearold steam deck now availabl:2026-02-17T17:56:14.000Z",
    "title": "RAM shortage hits Valve's four-year-old Steam Deck, now available \"intermittently\"",
    "url": "https://arstechnica.com/gadgets/2026/02/valves-steam-deck-intermittently-out-of-stock-as-ram-shortage-drags-on/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-02-17T17:56:14.000Z",
    "summary_long": "Earlier this month, Valve announced it was delaying the release of its new Steam Machine desktop and Steam Frame VR headset due to memory and storage shortages that have been cascading across the PC industry since late 2025. But those shortages are also coming for products that have already launched. Valve had added a note to its Steam Deck page noting that the device would be \"out-of-stock intermittently in some regions due to memory and storage shortages.\" None of Valve's three listed Steam Deck configurations are currently available to buy, nor are any of the certified refurbished Steam Deck configurations that Valve sometimes offers. Valve hasn't announced any price increases for the Deck, at least not yet—the 512GB OLED model is still listed at $549 and the 1TB version at $649. Source: arstechnica.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crypto venture capital firm dragonfly raises 650 million des:2026-02-17T19:51:24.000Z",
    "title": "Crypto venture capital firm Dragonfly raises $650 million despite 'gloom of a bear market'",
    "url": "https://www.coindesk.com/business/2026/02/17/crypto-venture-capital-firm-dragonfly-raises-usd650-million-despite-gloom-of-a-bear-market",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2026-02-17T19:51:24.000Z",
    "summary_long": "Crypto venture capital firm Dragonfly raises $650 million despite 'gloom of a bear market' Source: www.coindesk.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:crispedit lowcurvature projections for scalable nondestructi:2026-02-17T18:58:04.000Z",
    "title": "CrispEdit: Low-Curvature Projections for Scalable Non-Destructive LLM Editing",
    "url": "https://arxiv.org/abs/2602.15823v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Zarif Ikram",
    "published_at": "2026-02-17T18:58:04.000Z",
    "summary_long": "A central challenge in large language model (LLM) editing is capability preservation: methods that successfully change targeted behavior can quietly game the editing proxy and corrupt general capabilities, producing degenerate behaviors reminiscent of proxy/reward hacking. We present CrispEdit, a scalable and principled second-order editing algorithm that treats capability preservation as an explicit constraint, unifying and generalizing several existing editing approaches. CrispEdit formulates editing as constrained optimization and enforces the constraint by projecting edit updates onto the low-curvature subspace of the capability-loss landscape. At the crux of CrispEdit is expressing capability constraint via Bregman divergence, whose quadratic form yields the Gauss-Newton Hessian exactly and even when the base model is not trained to convergence. Source: arxiv.org. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:beyond match maximization and fairness retentionoptimized tw:2026-02-17T17:30:53.000Z",
    "title": "Beyond Match Maximization and Fairness: Retention-Optimized Two-Sided Matching",
    "url": "https://arxiv.org/abs/2602.15752v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Ren Kishimoto",
    "published_at": "2026-02-17T17:30:53.000Z",
    "summary_long": "On two-sided matching platforms such as online dating and recruiting, recommendation algorithms often aim to maximize the total number of matches. However, this objective creates an imbalance, where some users receive far too many matches while many others receive very few and eventually abandon the platform. Retaining users is crucial for many platforms, such as those that depend heavily on subscriptions. Some may use fairness objectives to solve the problem of match maximization. Source: arxiv.org. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:urbanverse learning urban region representation across citie:2026-02-17T17:28:48.000Z",
    "title": "UrbanVerse: Learning Urban Region Representation Across Cities and Tasks",
    "url": "https://arxiv.org/abs/2602.15750v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Fengze Sun",
    "published_at": "2026-02-17T17:28:48.000Z",
    "summary_long": "Recent advances in urban region representation learning have enabled a wide range of applications in urban analytics, yet existing methods remain limited in their capabilities to generalize across cities and analytic tasks. We aim to generalize urban representation learning beyond city- and task-specific settings, towards a foundation-style model for urban analytics. To this end, we propose UrbanVerse, a model for cross-city urban representation learning and cross-task urban analytics. For cross-city generalization, UrbanVerse focuses on features local to the target regions and structural features of the nearby regions rather than the entire city. Source: arxiv.org. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:thz band testbed successfully transmits under 1000 kmh highm:2026-02-17T21:27:28.000Z",
    "title": "THz band testbed successfully transmits under 1,000 km/h high-mobility emulation",
    "url": "https://techxplore.com/news/2026-02-thz-band-testbed-successfully-transmits.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-17T21:27:28.000Z",
    "summary_long": "The fifth-generation mobile communication system, also known as 5G, is expected to evolve as a critical infrastructure supporting individual users, industrial applications, and social systems. This requires access to broader frequency resources, but concerns have emerged regarding future congestion even in the existing frequency bands, creating a strong need to explore new spectrum resources and progress to 6G. Source: techxplore.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:advanced security technology is rarely usedresearch offers a:2026-02-17T20:30:01.000Z",
    "title": "Advanced security technology is rarely used—research offers a solution",
    "url": "https://techxplore.com/news/2026-02-advanced-technology-rarely-solution.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-17T20:30:01.000Z",
    "summary_long": "Modern and powerful security technology that protects against hacking attempts is used to a very limited extent—despite having been available to developers for more than a decade. Researchers at Umeå University can now reveal why the technology fails to take hold. \"At the same time, we present an automated solution that makes it easy to adopt the technology,\" says Sabine Houy, doctoral student at the Department of Computing Science, who is now defending her thesis. Source: techxplore.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:texas ag sues tplink over purported connection to china:2026-02-17T20:29:03.000Z",
    "title": "Texas AG sues TP-Link over purported connection to China",
    "url": "https://www.engadget.com/cybersecurity/texas-ag-sues-tp-link-over-purported-connection-to-china-193802258.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2026-02-17T20:29:03.000Z",
    "summary_long": "Texas is suing Wi-Fi router maker TP-Link for deceptively marketing the security of its products and allowing Chinese hacking groups to access Americans' devices, Attorney General Ken Paxton has announced. Paxton originally started looking into TP-Link in October 2025. Texas Governor Greg Abbott later prohibited state employees from using TP-Link products in January of this year. TP-Link is no longer owned by a Chinese company and its products are assembled in Vietnam, but Paxton's lawsuit claims that because the company's \"ownership and supply-chain are tied to China\" it's subject to the country's data laws, which require companies to comply with requests from Chinese intelligence agencies. Source: www.engadget.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:securing the ai software supply chain security results acros:2026-02-17T19:00:00.000Z",
    "title": "Securing the AI software supply chain: Security results across 67 open source projects",
    "url": "https://github.blog/open-source/maintainers/securing-the-ai-software-supply-chain-security-results-across-67-open-source-projects/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Gregg Cochran",
    "published_at": "2026-02-17T19:00:00.000Z",
    "summary_long": "Modern software is built on open source projects. In fact, you can trace almost any production system today, including AI, mobile, cloud, and embedded workloads, back to open source components. These components are the invisible infrastructure of software: the download that always works, the library you never question, the build step you haven’t thought about in years, if ever. A few examples: * curl moves data for billions of systems, from package managers to CI pipelines. Source: github.blog. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:nintendos virtual boy app is now available to download:2026-02-17T15:07:05.000Z",
    "title": "Nintendo's Virtual Boy app is now available to download",
    "url": "https://www.engadget.com/gaming/nintendo/nintendos-virtual-boy-app-is-now-available-to-download-150705800.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-02-17T15:07:05.000Z",
    "summary_long": "Nintendo’s Virtual Boy app is now available to download on Switch and Switch 2 as part of its Nintendo Classics offering. You’ll need to have a Nintendo Switch Online + Expansion Pack membership to access the launch titles, and unlike Nintendo’s other retro emulators, this one also requires a dedicated accessory. As a reminder, the Virtual Boy was a portable tabletop system released in 1995, and the first console capable of rendering stereoscopic 3D graphics. It had a facemask with a monochrome red display built onto a bipod, so rather than wearing it like a modern VR headset, you had to awkwardly push your face towards it to play games. Source: www.engadget.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]