[
  {
    "id": "bigtech:two uk teens charged in connection to scattered spider ranso:2025-09-19T00:00:37.000Z",
    "title": "Two UK teens charged in connection to Scattered Spider ransomware attacks",
    "url": "https://arstechnica.com/security/2025/09/two-uk-teens-charged-in-connection-to-scattered-spider-ransomware-attacks/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-09-19T00:00:37.000Z",
    "summary_long": "Federal prosecutors charged a UK teenager with conspiracy to commit computer fraud and other crimes in connection with the network intrusions of 47 US companies that generated more than $115 million in ransomware payments over a three-year span. A criminal complaint unsealed on Thursday (PDF) said that Thalha Jubair, 19, of London, was part of Scattered Spider, the name of an English-language-speaking group that has breached the networks of scores of companies worldwide. After obtaining data, the group demanded that the victims pay hefty ransoms or see their confidential data published or sold. BITCOIN PAID BY VICTIMS RECOVERED The unsealing of the document, filed in US District Court of the District of New Jersey, came the same day Jubair and another alleged Scattered Spider member—Owen Flowers, 18, from Walsall, West Midlands—were charged by UK prosecutors in connection with last year’s cyberattack on Transport for London. Source: arstechnica.com. Date: 2025-09-19. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:how weak passwords and other failings led to catastrophic br:2025-09-18T14:31:22.000Z",
    "title": "How weak passwords and other failings led to catastrophic breach of Ascension",
    "url": "https://arstechnica.com/security/2025/09/how-weak-passwords-and-other-failings-led-to-catastrophic-breach-of-ascension/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-09-18T14:31:22.000Z",
    "summary_long": "Last week, a prominent US senator called on the Federal Trade Commission to investigate Microsoft for cybersecurity negligence over the role it played last year in health giant Ascension's ransomware breach, which caused life-threatening disruptions at 140 hospitals and put the medical records of 5.6 million patients into the hands of the attackers. Lost in the focus on Microsoft was something as, or more, urgent: never-before-revealed details that now invite scrutiny of Ascension’s own security failings. In a letter sent last week to FTC Chairman Andrew Ferguson, Sen. Ron Wyden (D-Ore.) said an investigation by his office determined that the hack began in February 2024 with the infection of a contractor's laptop after they downloaded malware from a link returned by Microsoft’s Bing search engine. Source: arstechnica.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:ice unit signs new 3m contract for phonehacking tech:2025-09-18T16:37:45.000Z",
    "title": "ICE unit signs new $3M contract for phone-hacking tech",
    "url": "https://techcrunch.com/2025/09/18/ice-unit-signs-new-3-million-contract-for-phone-hacking-tech/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Lorenzo Franceschi-Bicchierai",
    "published_at": "2025-09-18T16:37:45.000Z",
    "summary_long": "ICE unit signs new $3M contract for phone-hacking tech Source: techcrunch.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas deep space communications demo exceeds project expecta:2025-09-18T19:43:38.000Z",
    "title": "NASA’s Deep Space Communications Demo Exceeds Project Expectations",
    "url": "https://www.nasa.gov/directorates/stmd/tech-demo-missions-program/deep-space-optical-communications-dsoc/nasas-deep-space-communications-demo-exceeds-project-expectations/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Anthony Greicius",
    "published_at": "2025-09-18T19:43:38.000Z",
    "summary_long": "5 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) In this infrared photograph, the Optical Communications Telescope Laboratory at JPL’s Table Mountain Facility near Wrightwood, California, beams its eight-laser beacon to the Deep Space Optical Communications flight laser transceiver aboard NASA’s Psyche spacecraft. NASA/JPL-Caltech The project has exceeded all of its technical goals after two years, setting up the foundations of high-speed communications for NASA’s future human missions to Mars. NASA’s Deep Space Optical Communications technology successfully showed that data encoded in lasers could be reliably transmitted, received, and decoded after traveling millions of miles from Earth at distances comparable to Mars. Nearly two years after launching aboard the agency’s Psyche mission in 2023, the technology demonstration recently completed its 65th and final pass, sending a laser signal to Psyche and receiving the return signal, from 218 million miles away. Source: www.nasa.gov. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "fintech:crypto exchange geminis stock trades below ipo price despite:2025-09-18T16:56:54.000Z",
    "title": "Crypto Exchange Gemini's Stock Trades Below IPO Price Despite Day’s Gains",
    "url": "https://www.coindesk.com/markets/2025/09/18/crypto-exchange-gemini-s-stock-trades-below-ipo-price-despite-day-s-gains",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-09-18T16:56:54.000Z",
    "summary_long": "Shares of Gemini (GEMI), the crypto exchange founded by billionaire twins Cameron and Tyler Winklevoss, were trading under their IPO price of $28 on Thursday, changing hands at about $25.15. That marked a 2.5% gain on the day after the stock recouped earlier losses. The shares first broke below the IPO price on Wednesday. Gemini went public last week at $28 a share, valuing the company at more than $3 billion. Source: www.coindesk.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:plasma to launch mainnet beta blockchain for stablecoins nex:2025-09-18T16:08:36.000Z",
    "title": "Plasma to Launch Mainnet Beta Blockchain for Stablecoins Next Week",
    "url": "https://www.coindesk.com/tech/2025/09/18/plasma-to-launch-mainnet-beta-blockchain-for-stablecoins-next-week",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Margaux Nijkerk",
    "published_at": "2025-09-18T16:08:36.000Z",
    "summary_long": "Plasma, a new blockchain built specifically for stablecoins, is set to flip the switch on its long-awaited mainnet beta next week, introducing the chain and its native token, XPL, on Sept. 25. According to a blog post from the team, the network will debut with more than $2 billion in stablecoin liquidity from over a hundred partners on day one — an aggressive attempt to position Plasma not as just another general-purpose chain, but as the backbone for stablecoin transfers. That won’t be an easy feat. Source: www.coindesk.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:solmate joins solana treasury push with 300m funding from ua:2025-09-18T14:52:34.000Z",
    "title": "Solmate Joins Solana Treasury Push With $300M Funding From UAE Investors, ARK Invest",
    "url": "https://www.coindesk.com/business/2025/09/18/solmate-joins-solana-treasury-push-with-usd300m-funding-from-uae-investors-ark-invest",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-09-18T14:52:34.000Z",
    "summary_long": "Brera Holdings (BREA), a Nasdaq-listed sports club owner, is the latest entrant into the growing Solana (SOL) digital asset treasury field raising $300 million to accumulate the token. Announced on Thursday, the firm secured backing from UAE-based Pulsar Group, Cathie Wood's ARK Invest, RockawayX and the Solana Foundation in a private investment in public equity (PIPE) round. It will also rebrand to Solmate, while maintaining its sports-ownership business. The shares rallied 14% following the news. Source: www.coindesk.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:causalpre scalable and effective data preprocessing for caus:2025-09-18T17:54:01.000Z",
    "title": "CausalPre: Scalable and Effective Data Pre-processing for Causal Fairness",
    "url": "http://arxiv.org/abs/2509.15199v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Ying Zheng",
    "published_at": "2025-09-18T17:54:01.000Z",
    "summary_long": "Causal fairness in databases is crucial to preventing biased and inaccurate outcomes in downstream tasks. While most prior work assumes a known causal model, recent efforts relax this assumption by enforcing additional constraints. However, these approaches often fail to capture broader attribute relationships that are critical to maintaining utility. This raises a fundamental question: Can we harness the benefits of causal reasoning to design efficient and effective fairness solutions without relying on strong assumptions about the underlying causal model? Source: arxiv.org. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:anofdiff onestep diffusionbased anomaly detection for forcef:2025-09-18T16:58:00.000Z",
    "title": "AnoF-Diff: One-Step Diffusion-Based Anomaly Detection for Forceful Tool Use",
    "url": "http://arxiv.org/abs/2509.15153v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yating Lin",
    "published_at": "2025-09-18T16:58:00.000Z",
    "summary_long": "Multivariate time-series anomaly detection, which is critical for identifying unexpected events, has been explored in the field of machine learning for several decades. However, directly applying these methods to data from forceful tool use tasks is challenging because streaming sensor data in the real world tends to be inherently noisy, exhibits non-stationary behavior, and varies across different tasks and tools. To address these challenges, we propose a method, AnoF-Diff, based on the diffusion model to extract force-torque features from time-series data and use force-torque features to detect anomalies. We compare our method with other state-of-the-art methods in terms of F1-score and Area Under the Receiver Operating Characteristic curve (AUROC) on four forceful tool-use tasks, demonstrating that our method has better performance and is more robust to a noisy dataset. Source: arxiv.org. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:the energyefficient hierarchical neural network with fast fp:2025-09-18T15:54:15.000Z",
    "title": "The Energy-Efficient Hierarchical Neural Network with Fast FPGA-Based Incremental Learning",
    "url": "http://arxiv.org/abs/2509.15097v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Mohammad Saleh Vahdatpour",
    "published_at": "2025-09-18T15:54:15.000Z",
    "summary_long": "The rising computational and energy demands of deep learning, particularly in large-scale architectures such as foundation models and large language models (LLMs), pose significant challenges to sustainability. Traditional gradient-based training methods are inefficient, requiring numerous iterative updates and high power consumption. To address these limitations, we propose a hybrid framework that combines hierarchical decomposition with FPGA-based direct equation solving and incremental learning. Our method divides the neural network into two functional tiers: lower layers are optimized via single-step equation solving on FPGAs for efficient and parallelizable feature extraction, while higher layers employ adaptive incremental learning to support continual updates without full retraining. Source: arxiv.org. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:from supercomputers to wind tunnels nasas road to artemis ii:2025-09-18T20:41:17.000Z",
    "title": "From Supercomputers to Wind Tunnels: NASA’s Road to Artemis II",
    "url": "https://www.nasa.gov/directorates/esdmd/common-exploration-systems-development-division/space-launch-system/from-supercomputers-to-wind-tunnels-nasas-road-to-artemis-ii/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lee Mohon",
    "published_at": "2025-09-18T20:41:17.000Z",
    "summary_long": "5 Min Read FROM SUPERCOMPUTERS TO WIND TUNNELS: NASA’S ROAD TO ARTEMIS II Of the many roads leading to successful Artemis missions, one is paved with high-tech computing chips called superchips. Along the way, a partnership between NASA wind tunnel engineers, data visualization scientists, and software developers verified a quick, cost-effective solution to improve NASA’s SLS (Space Launch System) rocket for the upcoming Artemis II mission. This will be the first crewed flight of the SLS rocket and Orion spacecraft, on an approximately 10-day journey around the Moon. A high-speed network connection between high-end computing resources at the NASA Advanced Supercomputing facility and the Unitary Plan Wind Tunnel, both located at NASA’s Ames Research Center in California’s Silicon Valley, is enabling a collaboration to improve the rocket for the Artemis II mission. Source: www.nasa.gov. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta will let outside developers create aipowered apps for i:2025-09-18T19:41:59.000Z",
    "title": "Meta will let outside developers create AI-powered apps for its smart glasses",
    "url": "https://www.engadget.com/wearables/meta-will-let-outside-developers-create-ai-powered-apps-for-its-smart-glasses-194159233.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Karissa Bell",
    "published_at": "2025-09-18T19:41:59.000Z",
    "summary_long": "Meta's lineup of smart glasses could soon get a lot more capabilities. The company will begin allowing outside developers to bring their apps to its RayBan and Oakley smart glasses, Meta announced on the second day of its Connect event. Up to now, Meta has only had a limited number of third-party integrations for its glasses, with apps like Spotify and Audible. But Meta will now allow developers to start experimenting with apps that can take advantage of the built-in sensors and audio capabilities of its glasses. Source: www.engadget.com. Date: 2025-09-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]