[
  {
    "id": "bigtech:dead celebrities are apparently fair game for sora 2 video m:2025-10-07T17:08:05.000Z",
    "title": "Dead celebrities are apparently fair game for Sora 2 video manipulation",
    "url": "https://arstechnica.com/ai/2025/10/dj-bruce-lee-and-jackass-mr-rogers-dead-celebrities-become-puppets-in-sora-2-videos/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kyle Orland\n                ",
    "published_at": "2025-10-07T17:08:05.000Z",
    "summary_long": "When OpenAI launched the Sora 2 video generator last week, the company wrote that it was taking measures to \"block depictions of public figures\" by default. But creators and viewers of Sora 2 videos are finding that prohibition has a rather large loophole, allowing for videos of public figures that happen to be dead. Examples of celebrities being posthumously inserted into Sora 2 video creations are not hard to find all over social media these days. Tupac Shakur chatting with Malcolm X. Source: arstechnica.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:qualcomm is buying arduino releases new raspberry piesque ar:2025-10-07T16:30:16.000Z",
    "title": "Qualcomm is buying Arduino, releases new Raspberry Pi-esque Arduino board",
    "url": "https://arstechnica.com/gadgets/2025/10/arduino-retains-its-brand-and-mission-following-acquisition-by-qualcomm/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2025-10-07T16:30:16.000Z",
    "summary_long": "Smartphone processor and modem maker Qualcomm is acquiring Arduino, the Italian company known mainly for its open source ecosystem of microcontrollers and the software that makes them function. In its announcement, Qualcomm said that Arduino would \"[retain] its brand and mission,\" including its \"open source ethos\" and \"support for multiple silicon vendors.\" \"Arduino will retain its independent brand, tools, and mission, while continuing to support a wide range of microcontrollers and microprocessors from multiple semiconductor providers as it enters this next chapter within the Qualcomm family,\" Qualcomm said in its press release. \"Following this acquisition, the 33M+ active users in the Arduino community will gain access to Qualcomm Technologies’ powerful technology stack and global reach. Entrepreneurs, businesses, tech professionals, students, educators, and hobbyists will be empowered to rapidly prototype and test new solutions, with a clear path to commercialization supported by Qualcomm Technologies’ advanced technologies and extensive partner ecosystem.\" Qualcomm didn't disclose what it would pay to acquire Arduino. Source:…",
    "tags": []
  },
  {
    "id": "bigtech:play store changes coming this month as scotus declines to f:2025-10-07T15:56:43.000Z",
    "title": "Play Store changes coming this month as SCOTUS declines to freeze antitrust remedies",
    "url": "https://arstechnica.com/gadgets/2025/10/supreme-court-refuses-to-pause-play-store-changes-while-google-appeals-antitrust-case/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2025-10-07T15:56:43.000Z",
    "summary_long": "Changes are coming to the Play Store in spite of a concerted effort from Google to maintain the status quo. The company asked the US Supreme Court to freeze parts of the Play Store antitrust ruling while it pursued an appeal, but the high court has rejected that petition. That means the first elements of the antitrust remedies won by Epic Games will have to be implemented in mere weeks. The app store case is one of three ongoing antitrust actions against Google, but it's the furthest along of them. Source: arstechnica.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:cleancores dogecoin treasury tops 710m tokens booking 20m ga:2025-10-07T15:45:09.000Z",
    "title": "CleanCore's Dogecoin Treasury Tops 710M Tokens, Booking $20M+ Gain",
    "url": "https://www.coindesk.com/business/2025/10/07/cleancore-s-dogecoin-treasury-tops-710m-tokens-booking-usd20m-gain",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-10-07T15:45:09.000Z",
    "summary_long": "CleanCore Solutions (ZONE) now holds over 710 million dogecoin (DOGE) tokens in its crypto treasury, with more than $20 million in unrealized gains, according to a Tuesday press release. The company continues with its goal of acquiring 1 billion DOGE. Launched just a month ago, the initiative is backed by the Dogecoin Foundation and coordinated through its corporate arm, House of Doge. CleanCore has been acquiring DOGE in phases since September 5 using proceeds from a $175 million private placement. Source: www.coindesk.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:cea industries total bnb holdings rise to 480k as token hits:2025-10-07T14:54:45.000Z",
    "title": "CEA Industries Total BNB Holdings Rise to 480K as Token Hits Record High",
    "url": "https://www.coindesk.com/business/2025/10/07/cea-industries-total-bnb-holdings-rise-to-480k-as-token-hits-record-high",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-10-07T14:54:45.000Z",
    "summary_long": "CEA Industries (BNC) has revealed it now holds 480,000 BNB tokens, a 15% increase from a previous disclosure, as the price of the BNB Chain’s native token rises to a new all-time high. The company spent about $412.8 million to acquire the additional BNB at an average price of $860 per token, according to a Tuesday press release. BNB is currently trading at $1,303, down just a bit from a record high hit earlier in the session. Combined with $77.5 million in cash, the firm’s total treasury is now near the $700 million mark. Source: www.coindesk.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:newly public crypto exchange gemini gets lukewarm reception :2025-10-07T13:18:15.000Z",
    "title": "Newly Public Crypto Exchange Gemini Gets Lukewarm Reception From KBW",
    "url": "https://www.coindesk.com/markets/2025/10/07/newly-public-crypto-exchange-gemini-gets-lukewarm-reception-from-kbw",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-10-07T13:18:15.000Z",
    "summary_long": "Investment bank KBW initiated coverage of Gemini Space Station (GEMI) with a market perform rating and a $27 price target, describing the crypto exchange as a well-rounded digital asset platform poised for long-term growth. Nevertheless, wrote analyst Bill Papanastasiou, Gemini for now remains unprofitable and discounted valuation to competitor Coinbase is warranted \"as the impact from execution and market risk is elevated.\" KBW said Gemini’s ecosystem, spanning trading, custody, credit cards, staking, stablecoins, and tokenized equities, offers cross-selling potential as the crypto market expands. The bank highlighted Gemini’s credit card business as a key growth driver, noting that it has more than 100,000 users and strong conversion into exchange activity thanks to crypto-based rewards. Gemini went public last month at $28 a share, valuing the company at more than $3 billion. Source: www.coindesk.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex launches 28 starlink satellites on falcon 9 rocket fr:2025-10-07T20:31:17.000Z",
    "title": "SpaceX launches 28 Starlink satellites on Falcon 9 rocket from Vandenberg SFB",
    "url": "https://spaceflightnow.com/2025/10/07/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-vandenberg-sfb-2/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-07T20:31:17.000Z",
    "summary_long": "Update Oct. 8, 12:25 a.m. EDT (0425 UTC): SpaceX landed the Falcon 9 booster on its drone ship. SpaceX launched a Falcon 9 rocket Tuesday night, which add another 28 Starlink V2 Mini satellites to its megaconstellation in low Earth orbit. Source: spaceflightnow.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:training dynamics impact posttraining quantization robustnes:2025-10-07T17:59:07.000Z",
    "title": "Training Dynamics Impact Post-Training Quantization Robustness",
    "url": "http://arxiv.org/abs/2510.06213v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Albert Catalan-Tatjer",
    "published_at": "2025-10-07T17:59:07.000Z",
    "summary_long": "While post-training quantization is widely adopted for efficient deployment of large language models, the mechanisms underlying quantization robustness remain unclear. We conduct a comprehensive analysis of quantization degradation across open-source language model training trajectories up to 32B parameters and 15T training tokens to accurately assess the relationship between training dynamics and quantization performance. Our key finding is that quantization errors in large-scale training runs are driven by a complex interplay between learning rate and other training hyperparameters. Specifically, once learning rates decay, validation loss and quantization error diverge, largely independent of training data scale. Source: arxiv.org. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:lmmeter unveiling runtime inference latency for ondevice lan:2025-10-07T17:05:30.000Z",
    "title": "lm-Meter: Unveiling Runtime Inference Latency for On-Device Language Models",
    "url": "http://arxiv.org/abs/2510.06126v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Haoxin Wang",
    "published_at": "2025-10-07T17:05:30.000Z",
    "summary_long": "Large Language Models (LLMs) are increasingly integrated into everyday applications, but their prevalent cloud-based deployment raises growing concerns around data privacy and long-term sustainability. Running LLMs locally on mobile and edge devices (on-device LLMs) offers the promise of enhanced privacy, reliability, and reduced communication costs. However, realizing this vision remains challenging due to substantial memory and compute demands, as well as limited visibility into performance-efficiency trade-offs on resource-constrained hardware. We propose lm-Meter, the first lightweight, online latency profiler tailored for on-device LLM inference. Source: arxiv.org. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:a public cardiac ct dataset featuring the left atrial append:2025-10-07T16:16:59.000Z",
    "title": "A public cardiac CT dataset featuring the left atrial appendage",
    "url": "http://arxiv.org/abs/2510.06090v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Bjoern Hansen",
    "published_at": "2025-10-07T16:16:59.000Z",
    "summary_long": "Despite the success of advanced segmentation frameworks such as TotalSegmentator (TS), accurate segmentations of the left atrial appendage (LAA), coronary arteries (CAs), and pulmonary veins (PVs) remain a significant challenge in medical imaging. In this work, we present the first open-source, anatomically coherent dataset of curated, high-resolution segmentations for these structures, supplemented with whole-heart labels produced by TS on the publicly available ImageCAS dataset consisting of 1000 cardiac computed tomography angiography (CCTA) scans. One purpose of the data set is to foster novel approaches to the analysis of LAA morphology. LAA segmentations on ImageCAS were generated using a state-of-the-art segmentation framework developed specifically for high resolution LAA segmentation. Source: arxiv.org. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:california bans loud commercials on streaming platforms:2025-10-07T15:58:09.000Z",
    "title": "California bans loud commercials on streaming platforms",
    "url": "https://www.engadget.com/big-tech/california-bans-loud-commercials-on-streaming-platforms-155809660.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2025-10-07T15:58:09.000Z",
    "summary_long": "California has passed a law to ban loud commercials on streaming platforms like Netflix and Hulu. This is great news for people who don't want to wake the neighborhood up when a streaming show suddenly turns into an aggressively loud ad for migraine medication. Governor Gavin Newsom just signed the law and the ban goes into effect on July 1, 2026. On that date, streaming services won't be allowed to “transmit the audio of commercial advertisements louder than the video content the advertisements accompany.\" > 🔊TURN DOWN THE VOLUME > > Californians don't want to hear commercials at a volume any louder than what they were previously enjoying their program at. Source: www.engadget.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:python 3140 final is here:2025-10-07T15:09:00.001Z",
    "title": "Python 3.14.0 (final) is here!",
    "url": "https://pythoninsider.blogspot.com/2025/10/python-3140-final-is-here.html",
    "category_id": "code",
    "region": "Global",
    "source": "pythoninsider.blogspot.com",
    "author": "Hugo",
    "published_at": "2025-10-07T15:09:00.001Z",
    "summary_long": "PYTHON 3.14.0 IS NOW AVAILABLE python.org/downloads/release/python-3140/ THIS IS THE STABLE RELEASE OF PYTHON 3.14.0 Python 3.14.0 is the newest major release of the Python programming language, and it contains many new features and optimisations compared to Python 3.13. MAJOR NEW FEATURES OF THE 3.14 SERIES, COMPARED TO 3.13 Some of the major new features and changes in Python 3.14 are: NEW FEATURES * PEP 779: Free-threaded Python is officially supported * PEP 649: The evaluation of annotations is now deferred, improving the semantics of using annotations. * PEP 750: Template string literals (t-strings) for custom string processing, using the familiar syntax of f-strings. * PEP 734: Multiple interpreters in the stdlib. Source: pythoninsider.blogspot.com. Date: 2025-10-07. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]