[
  {
    "id": "bigtech:site catering to online criminals has been seized by the fbi:2026-01-28T22:06:41.000Z",
    "title": "Site catering to online criminals has been seized by the FBI",
    "url": "https://arstechnica.com/security/2026/01/site-catering-to-online-criminals-has-been-seized-by-the-fbi/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2026-01-28T22:06:41.000Z",
    "summary_long": "RAMP—the predominantly Russian-language online bazaar that billed itself as the “only place ransomware allowed”—had its dark web and clear web sites seized by the FBI as the agency tries to combat the growing scourge threatening critical infrastructure and organizations around the world. Visits to both sites on Wednesday returned pages that said the FBI had taken control of the RAMP domains, which mirrored each other. RAMP has been among the dwindling number of online crime forums to operate with impunity, following the takedown of other forums such as XSS, which saw its leader arrested last year by Europol. The vacuum left RAMP as one of the leading places for people pushing ransomware and other online threats to buy, sell, or trade products and services. Source: arstechnica.com. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:seven things to know about how apples creator studio subscri:2026-01-28T21:53:57.000Z",
    "title": "Seven things to know about how Apple's Creator Studio subscriptions work",
    "url": "https://arstechnica.com/gadgets/2026/01/seven-things-to-know-about-how-apples-creator-studio-subscriptions-work/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-01-28T21:53:57.000Z",
    "summary_long": "Apple's new Creator Studio subscription bundle officially launches today, offering access to a wide range of updated professional apps for an all-or-nothing price of $12.99 a month or $129 a year. Teachers and students can get the same apps for $2.99 a month, or $29.99 a year. The bundle includes either access to or enhanced features for a total of 10 Apple apps, though the base versions of several of these are available for free to all Mac and iPad owners: * Final Cut Pro * Logic Pro * Pixelmator Pro * Keynote, Pages, and Numbers * Freeform * Motion, Compressor, and MainStage (Mac only) When companies introduce a subscription-based model for long-standing apps with an established user base, they often shift exclusively to a subscription model, offering continuous updates in return for a more consistent revenue stream. But these aren't always popular with subscription-fatigued users, who have seen virtually all major paid software shift to a subscription model in…",
    "tags": []
  },
  {
    "id": "bigtech:spacex sends list of demands to us states giving broadband g:2026-01-28T21:02:21.000Z",
    "title": "SpaceX sends list of demands to US states giving broadband grants to Starlink",
    "url": "https://arstechnica.com/tech-policy/2026/01/starlink-demands-grant-money-from-states-even-when-residents-dont-buy-service/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2026-01-28T21:02:21.000Z",
    "summary_long": "SpaceX has made a new set of demands on state governments that would ensure Starlink receives federal grant money even when residents don't purchase Starlink broadband service. But SpaceX isn't promising lower-than-usual monthly prices to consumers in those subsidized areas. SpaceX pledged to make broadband available for $80 or less a month, plus taxes and fees, to people with low incomes in the subsidized areas. For comparison, the normal Starlink residential prices advertised on its website range from $50 to $120 a month. Source: arstechnica.com. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:astronomers share new insights about the early universe via :2026-01-28T21:33:11.000Z",
    "title": "Astronomers share new insights about the early universe via the Webb Space Telescope",
    "url": "https://www.engadget.com/science/space/astronomers-share-new-insights-about-the-early-universe-via-the-webb-space-telescope-213311848.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-01-28T21:33:11.000Z",
    "summary_long": "Researchers using the James Webb Space Telescope have found a galaxy that is offering new data about the early stages of the universe's existence. The latest discovery shared by astronomers is about a bright galaxy dubbed MoM-z14. According to the team, this galaxy existed 280 million years after the Big Bang. The sounds like a long time, but in the context of the universe's estimated 13.8 billion years of existence, that's actually one of the closest examples astronomers have found to the Big Bang's occurrence. Source: www.engadget.com. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bitcoin treasury firm strive raises 225 million to pay off l:2026-01-28T15:18:23.000Z",
    "title": "Bitcoin treasury firm Strive raises $225 million to pay off loans, buy more bitcoin",
    "url": "https://www.coindesk.com/markets/2026/01/28/strive-clears-semler-debt-off-books-buys-more-bitcoin-after-usd225-million-preferred-stock-sale",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "James Van Straten",
    "published_at": "2026-01-28T15:18:23.000Z",
    "summary_long": "Bitcoin treasury firm Strive raises $225 million to pay off loans, buy more bitcoin Source: www.coindesk.com. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:french ubisoft workers vote to strike:2026-01-28T17:32:41.000Z",
    "title": "French Ubisoft workers vote to strike",
    "url": "https://www.engadget.com/gaming/ubisoft-173241918.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2026-01-28T17:32:41.000Z",
    "summary_long": "When deciding which video game to buy, \"Is it fun?\" is no longer the only consideration. Given the state of the industry, \"Do I want to support this company?\" is arguably more important. Take, for example, Ubisoft, where things seem to unravel more each day. After the floundering publisher floated even more layoffs this week, workers at its Paris headquarters said, \"Enough is enough.\" They're now calling for a three-day strike. Source: www.engadget.com. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch 11000th starlink satellite to:2026-01-29T01:13:59.000Z",
    "title": "Live coverage: SpaceX to launch 11,000th Starlink satellite to date on Thursday",
    "url": "https://spaceflightnow.com/2026/01/29/live-coverage-spacex-to-launch-11000th-starlink-satellite-to-date-on-thursday/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-29T01:13:59.000Z",
    "summary_long": "SpaceX is set to launch its penultimate Falcon 9 rocket of the month with a mid-morning flight from Vandenberg Space Force Base on Thursday. The Starlink 17-19 mission will add another 25 satellites to its megaconstellation in low Earth orbit. Among the satellites will be the 11,000th Starlink satellite launched by the company since its first batch of production satellites were flown in May 2019. Liftoff from Space Launch Complex 4 East is scheduled for 8:42:10 a.m. Source: spaceflightnow.com. Date: 2026-01-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:msis refreshed prestige series laptops are now available to :2026-01-28T16:52:34.000Z",
    "title": "MSI’s refreshed Prestige series laptops are now available to buy",
    "url": "https://www.engadget.com/computing/laptops/msis-refreshed-prestige-series-laptops-are-now-available-to-buy-165234479.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-01-28T16:52:34.000Z",
    "summary_long": "The latest lineup of MSI's Prestige laptops is now available to buy. The company unveiled its next-generation business laptop at CES earlier this month, all of them powered by the latest Intel Core Ultra Series 3 processors. Available in configurations that include up to the Intel Core Ultra 9, the updated Prestige series are equipped with chunky 91Wh batteries and, depending on the model, offer over 30 hours of 1080p video playback. In more real-world terms, if you’re on a work trip and know you won’t always have a power supply to hand, you can trust one of these to get you through a day of heavy multi-tasking. Source: www.engadget.com. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:sokobench evaluating longhorizon planning and reasoning in l:2026-01-28T18:56:00.000Z",
    "title": "SokoBench: Evaluating Long-Horizon Planning and Reasoning in Large Language Models",
    "url": "https://arxiv.org/abs/2601.20856v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Sebastiano Monti",
    "published_at": "2026-01-28T18:56:00.000Z",
    "summary_long": "Although the capabilities of large language models have been increasingly tested on complex reasoning tasks, their long-horizon planning abilities have not yet been extensively investigated. In this work, we provide a systematic assessment of the planning and long-horizon reasoning capabilities of state-of-the-art Large Reasoning Models (LRMs). We propose a novel benchmark based on Sokoban puzzles, intentionally simplified to isolate long-horizon planning from state persistence. Our findings reveal a consistent degradation in planning performance when more than 25 moves are required to reach the solution, suggesting a fundamental constraint on forward planning capacity. Source: arxiv.org. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:smoothing the blackbox signeddistance supervision for blackb:2026-01-28T17:00:04.000Z",
    "title": "Smoothing the Black-Box: Signed-Distance Supervision for Black-Box Model Copying",
    "url": "https://arxiv.org/abs/2601.20773v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Rubén Jiménez",
    "published_at": "2026-01-28T17:00:04.000Z",
    "summary_long": "Deployed machine learning systems must continuously evolve as data, architectures, and regulations change, often without access to original training data or model internals. In such settings, black-box copying provides a practical refactoring mechanism, i.e. upgrading legacy models by learning replicas from input-output queries alone. When restricted to hard-label outputs, copying turns into a discontinuous surface reconstruction problem from pointwise queries, severely limiting the ability to recover boundary geometry efficiently. Source: arxiv.org. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa telescopes spot surprisingly mature cluster in early un:2026-01-28T16:38:10.000Z",
    "title": "NASA Telescopes Spot Surprisingly Mature Cluster in Early Universe",
    "url": "https://www.nasa.gov/missions/chandra/nasa-telescopes-spot-surprisingly-mature-cluster-in-early-universe/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lee Mohon",
    "published_at": "2026-01-28T16:38:10.000Z",
    "summary_long": "A new discovery captures the cosmic moment when a galaxy cluster – among the largest structures in the universe – started to assemble only about a billion years after the big bang, one or two billion years earlier than previously thought. This result, made using NASA’s Chandra X-ray Observatory and James Webb Space Telescope, will lead astronomers to rethink when and how the largest structures in the universe formed. The findings are described in a paper published [Wednesday] in the journal Nature. The object, known as JADES-ID1 for its location in the “JWST Advanced Deep Extragalactic Survey” (JADES) has a mass about 20 trillion times that of the Sun. Source: www.nasa.gov. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:muralcpd active learning for multiresolution change point de:2026-01-28T15:14:37.000Z",
    "title": "MuRAL-CPD: Active Learning for Multiresolution Change Point Detection",
    "url": "https://arxiv.org/abs/2601.20686v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Stefano Bertolasi",
    "published_at": "2026-01-28T15:14:37.000Z",
    "summary_long": "Change Point Detection (CPD) is a critical task in time series analysis, aiming to identify moments when the underlying data-generating process shifts. Traditional CPD methods often rely on unsupervised techniques, which lack adaptability to task-specific definitions of change and cannot benefit from user knowledge. To address these limitations, we propose MuRAL-CPD, a novel semi-supervised method that integrates active learning into a multiresolution CPD algorithm. MuRAL-CPD leverages a wavelet-based multiresolution decomposition to detect changes across multiple temporal scales and incorporates user feedback to iteratively optimize key hyperparameters. Source: arxiv.org. Date: 2026-01-28. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]