[
  {
    "id": "bigtech:mark zuckerberg and his rayban entourage have their day in c:2026-02-19T04:13:17.000Z",
    "title": "Mark Zuckerberg and his Ray-Ban entourage have their day in court",
    "url": "https://www.theverge.com/policy/881210/mark-zuckerberg-meta-ceo-testimony-filters",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Lauren Feiner",
    "published_at": "2026-02-19T04:13:17.000Z",
    "summary_long": "Meta CEO Mark Zuckerberg entered a downtown Los Angeles courthouse in largely the same way as all the attorneys, reporters, and advocates who'd come to watch his landmark trial testimony, but with one notable difference: he was flanked by an entourage that appeared to be wearing Meta's Ray-Ban smart glasses. To get to the courtroom, he walked past a crowd of parents whose children died after struggling with issues they attribute to the design of social media platforms including those that Meta makes. He would spend the next eight hours often answering questions in his signature matter-of-fact (or less charitably, monotone) cadence, denying h … Read the full story at The Verge. Source: www.theverge.com. Date: 2026-02-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:is your startups check engine light on google clouds vp expl:2026-02-18T21:07:00.000Z",
    "title": "Is your startup’s check engine light on? Google Cloud’s VP explains what to do",
    "url": "https://techcrunch.com/video/is-your-startups-check-engine-light-on-google-clouds-vp-explains-what-to-do/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Theresa Loconsolo",
    "published_at": "2026-02-18T21:07:00.000Z",
    "summary_long": "Startup founders are being pushed to move faster than ever, using AI while facing tighter funding, rising infrastructure costs, and more pressure to show real traction early. Cloud credits, access to GPUs, and foundation models have made it easier to get started, but those early infrastructure choices can have unforeseen consequences once startups move beyond […] Source: techcrunch.com. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:5 changes to know about in apples latest ios macos and ipado:2026-02-18T19:28:26.000Z",
    "title": "5 changes to know about in Apple's latest iOS, macOS, and iPadOS betas",
    "url": "https://arstechnica.com/gadgets/2026/02/5-changes-to-know-about-in-apples-latest-ios-macos-and-ipados-betas/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-02-18T19:28:26.000Z",
    "summary_long": "This week, Apple released the first developer betas for iOS 26.4, iPadOS 26.4, macOS 26.4, and its other operating systems. On Tuesday, it followed those up with public beta versions of the same updates. Usually released around the midpoint between one major iOS release and the next, the *.4 updates to its operating system usually include a significant batch of new features and other refinements, and if the first beta is any indication, this year's releases uphold that tradition. Read full article Comments Source: arstechnica.com. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:research project launches free tool to make ai safer and mor:2026-02-19T03:00:02.000Z",
    "title": "Research project launches free tool to make AI safer and more trustworthy",
    "url": "https://techxplore.com/news/2026-02-free-tool-ai-safer-trustworthy.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-19T03:00:02.000Z",
    "summary_long": "A University of Glasgow-led research project is releasing a free tool to help organizations, policymakers, and the public maximize the benefits of AI applications while identifying their potential harms. The tool, developed as part of the Participatory Harm Auditing Workbenches and Methodologies (PHAWM) project, aims to help address the urgent need for rigorous assessments of AI risks caused by the rapid expansion and adoption of the technology across a wide range of sectors. Source: techxplore.com. Date: 2026-02-19. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:introducing openai for india:2026-02-18T21:00:00.000Z",
    "title": "Introducing OpenAI for India",
    "url": "https://openai.com/index/openai-for-india",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-02-18T21:00:00.000Z",
    "summary_long": "Introducing OpenAI for India Source: openai.com. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:vantor archive imagery added to satellite data explorer:2026-02-18T20:54:31.000Z",
    "title": "Vantor Archive Imagery Added to Satellite Data Explorer",
    "url": "https://science.nasa.gov/uncategorized/vantor-archive-imagery-added-to-satellite-data-explorer/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2026-02-18T20:54:31.000Z",
    "summary_long": "4 min read VANTOR ARCHIVE IMAGERY ADDED TO SATELLITE DATA EXPLORER A high-resolution multispectral image of Washington, DC from Vantor. Visible are the Washington Monument (left), Tidal Basin (the body of water in the center-right), and the Jefferson Memorial (right). Credit: Vantor NASA’s Commercial Satellite Data Acquisition (CSDA) Program announces the addition of imagery from Vantor to its Satellite Data Explorer (SDX) data access and discovery tool. The imagery, which was obtained by Vantor’s Legion satellites, comes from Vantor’s 125-plus petabyte imagery archive, which dates back to 1999. Source: science.nasa.gov. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:csda releases new data acquisition request system:2026-02-18T20:42:16.000Z",
    "title": "CSDA Releases New Data Acquisition Request System",
    "url": "https://science.nasa.gov/uncategorized/csda-releases-new-data-acquisition-request-system/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2026-02-18T20:42:16.000Z",
    "summary_long": "4 min read CSDA RELEASES NEW DATA ACQUISITION REQUEST SYSTEM This screen capture of the SDX dashboard shows a map of Earth’s surface, and on the right, the search filters SDX users can manipulate to find the imagery that they need. Credit: CSDA NASA’s Commercial Satellite Data Acquisition (CSDA) Program released a new Data Acquisition Request System, which lets authorized users submit proposals for yet-to-be-collected data from CSDA’s commercial partners and track their requests through an easy-to-use dashboard. “With the Data Acquisition Request System, approved users will be able to ‘task,’ meaning to request future data, from a CSDA commercial partner’s satellite,” said Aaron Kaulfus, CSDA Data Management Team Lead. “The process begins with a user submitting a proposal that is subject to an approval process. Source: science.nasa.gov. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:csda program announces eight new data agreements:2026-02-18T20:23:53.000Z",
    "title": "CSDA Program Announces Eight New Data Agreements",
    "url": "https://science.nasa.gov/uncategorized/csda-program-announces-eight-new-data-agreements/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2026-02-18T20:23:53.000Z",
    "summary_long": "CSDA PROGRAM ANNOUNCES EIGHT NEW DATA AGREEMENTS This Spotlight Mode SAR image from Capella Space shows a portion of the city of Pittsburgh, Pennsylvania, on August 21, 2021. Credit: Capella Space NASA’s Commercial Satellite Data Acquisition (CSDA) Program announced eight new agreements with seven of its commercial partners— Airbus Defense and Space GEO Inc (Airbus U.S.), Capella Space Corporation, ICEYE US, MDA Space, Planet Labs, Umbra, and Vantor (formerly Maxar)—to give users more access to near‑global multispectral and synthetic aperture radar (SAR) data. With these agreements, the CSDA program further advances its mission to acquire data from commercial providers that supports NASA’s Earth science research and applications, and expands the quality, coverage, and range of Earth observation data NASA offers to the scientific community. “These new agreements will provide users with a range of high-quality multispectral and SAR data that can be used in a variety of applications from environmental monitoring to surface deformation,” said CSDA Project Manager Dana Ostrenga.…",
    "tags": []
  },
  {
    "id": "ai_data:policy compiler for secure agentic systems:2026-02-18T18:57:12.000Z",
    "title": "Policy Compiler for Secure Agentic Systems",
    "url": "https://arxiv.org/abs/2602.16708v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Nils Palumbo",
    "published_at": "2026-02-18T18:57:12.000Z",
    "summary_long": "LLM-based agents are increasingly being deployed in contexts requiring complex authorization policies: customer service protocols, approval workflows, data access restrictions, and regulatory compliance. Embedding these policies in prompts provides no enforcement guarantees. We present PCAS, a Policy Compiler for Agentic Systems that provides deterministic policy enforcement. Enforcing such policies requires tracking information flow across agents, which linear message histories cannot capture. Source: arxiv.org. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:what to expect for open source in 2026:2026-02-18T18:41:42.000Z",
    "title": "What to expect for open source in 2026",
    "url": "https://github.blog/open-source/maintainers/what-to-expect-for-open-source-in-2026/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Dylan Birtolo",
    "published_at": "2026-02-18T18:41:42.000Z",
    "summary_long": "Over the years (decades), open source has grown and changed along with software development, evolving as the open source community becomes more global. But with any growth comes pain points. In order for open source to continue to thrive, it’s important for us to be aware of these challenges and determine how to overcome them. To that end, let’s take a look at what Octoverse 2025 reveals about the direction open source is taking. Source: github.blog. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:heres what to expect at apples product launch event on march:2026-02-18T17:36:12.000Z",
    "title": "Here's what to expect at Apple's product launch event on March 4",
    "url": "https://www.engadget.com/computing/heres-what-to-expect-at-apples-product-launch-event-on-march-4-173612772.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2026-02-18T17:36:12.000Z",
    "summary_long": "Apple has scheduled a product launch event, dubbed an \"Apple Experience\", for March 4 at 9AM ET. The company is reportedly holding this event in NYC, London and Shanghai. Everyone loves shiny new products, so what can we expect to see at Apple's first launch event of 2026? We don't know anything for certain, but we have plenty of educated guesses that have been sourced from industry reports and speculation from analysts. Source: www.engadget.com. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:creating a digital poet:2026-02-18T16:25:10.000Z",
    "title": "Creating a digital poet",
    "url": "https://arxiv.org/abs/2602.16578v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Vered Tohar",
    "published_at": "2026-02-18T16:25:10.000Z",
    "summary_long": "Can a machine write good poetry? Any positive answer raises fundamental questions about the nature and value of art. We report a seven-month poetry workshop in which a large language model was shaped into a digital poet through iterative in-context expert feedback, without retraining. Across sessions, the model developed a distinctive style and a coherent corpus, supported by quantitative and qualitative analyses, and it produced a pen name and author image. Source: arxiv.org. Date: 2026-02-18. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]