[
  {
    "id": "bigtech:apple hit with 115m fine for extremely burdensome app store :2025-12-22T16:29:41.000Z",
    "title": "Apple hit with $115M fine for “extremely burdensome” App Store privacy policy",
    "url": "https://arstechnica.com/tech-policy/2025/12/apple-hit-with-115m-for-extremely-burdensome-app-store-privacy-policy/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-12-22T16:29:41.000Z",
    "summary_long": "Apple was hit with a $115 million fine Monday after Italy's competition authority alleged the tech giant was abusing its dominant position to harm third-party developers in its App Store. In a press release, the Italian Competition Authority said that an \"App Tracking Transparency\" (ATT) privacy policy that Apple introduced in 2021 forced third-party developers to seek consent twice for the same data collection. Requiring such \"double consent\" was \"extremely burdensome\" and \"harmful\" to some developers—especially the smallest developers, the regulator said. Many developers struggled to earn ad revenue after the policy was introduced, as users increasingly declined to opt into personalized ads. Source: arstechnica.com. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:in a surprise announcement tory bruno is out as ceo of unite:2025-12-22T23:51:44.000Z",
    "title": "In a surprise announcement, Tory Bruno is out as CEO of United Launch Alliance",
    "url": "https://arstechnica.com/space/2025/12/in-a-surprise-announcement-tory-bruno-is-out-as-ceo-of-united-launch-alliance/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-12-22T23:51:44.000Z",
    "summary_long": "Tory Bruno, a veteran engineer and aerospace industry executive, has resigned from the top job at United Launch Alliance after more than a decade competing against the growing dominance of SpaceX, the company announced Monday. The news of Bruno's sudden resignation was unexpected. His tenure was marked by a decline in ULA's market share as rival SpaceX competed for and won ever-larger US government launch contracts. More recently, Bruno oversaw the successful debut of ULA's Vulcan rocket, followed by struggles to ramp up the new rocket's launch cadence. Source: arstechnica.com. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:nasa rewraps boeing starliner astrovan ii for artemis ii rid:2025-12-22T16:20:31.000Z",
    "title": "NASA rewraps Boeing Starliner Astrovan II for Artemis II ride to launch pad",
    "url": "https://arstechnica.com/space/2025/12/nasa-rewraps-boeing-starliner-astrovan-ii-for-artemis-ii-ride-to-launch-pad/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Robert Pearlman\n                ",
    "published_at": "2025-12-22T16:20:31.000Z",
    "summary_long": "Artemis II, meet Astrovan II. NASA's first astronauts who will fly by the moon in more than 50 years participated in a practice launch countdown on Saturday, December 20, including taking their first trip on a transport vehicle steeped in almost the entire span of US space history—from Apollo through to the ongoing commercial crew program. Artemis II astronauts (from right to left) Reid Wiseman, Victor Glover, Christina Koch, and Jeremy Hansen pose for photographs before boarding the Astrovan II crew transport vehicle for a ride to their rocket during a rehearsal of their launch-day activities at NASA's Kennedy Space Center in Florida on Saturday, Dec. 20, 2025. Source: arstechnica.com. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:pirate group annas archive says it has scraped spotify in it:2025-12-23T03:45:23.000Z",
    "title": "Pirate group Anna's Archive says it has scraped Spotify in its entirety",
    "url": "https://www.engadget.com/entertainment/streaming/pirate-group-annas-archive-says-it-has-scraped-spotify-in-its-entirety-211914755.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-12-23T03:45:23.000Z",
    "summary_long": "Anna's Archive, the open-source search engine for shadow libraries, says it scraped Spotify's entire library of music. The group acquired metadata for around 256 million tracks, with 86 million actual songs, and is just under 300TB in total size. \"A while ago, we discovered a way to scrape Spotify at scale. We saw a role for us here to build a music archive primarily aimed at preservation,\" the group said in a blog post. Source: www.engadget.com. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:us bans new foreignmade drones and components:2025-12-23T05:32:01.000Z",
    "title": "US bans new foreign-made drones and components",
    "url": "https://www.engadget.com/big-tech/us-bans-new-foreign-made-drones-and-components-053201854.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2025-12-23T05:32:01.000Z",
    "summary_long": "The Federal Communications Commission has added foreign-made drones and their critical components to the agency’s “Covered List,” making them prohibited to import into the US. In a public notice published by the FCC, it said several national security agencies have determined that umanned aircraft systems (UAS) and their critical components produced in foreign countries pose an unacceptable risk to the national security of the United States. “UAS and UAS critical components must be produced in the United States,” the agency said. “UAS are inherently dual-use: they are both commercial platforms and potentially military or paramilitary sensors and weapons. Source: www.engadget.com. Date: 2025-12-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:keeping up with pace summary of the 2025 pac3 meeting:2025-12-22T19:57:58.000Z",
    "title": "Keeping Up with PACE: Summary of the 2025 PAC3 Meeting",
    "url": "https://science.nasa.gov/science-research/earth-science/keeping-up-with-pace-summary-of-the-2025-pac3-meeting/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-12-22T19:57:58.000Z",
    "summary_long": "Explore This Section * Earth * Earth Observer * Editor’s Corner * Feature Articles * Meeting Summaries * News * Science in the News * Calendars * In Memoriam * Announcements * More * Archives * Conference Schedules * Style Guide 12 min read KEEPING UP WITH PACE: SUMMARY OF THE 2025 PAC3 MEETING Introduction Launched in Feb. 2024, NASA’s Plankton, Aerosol, Cloud, ocean Ecosystem (PACE) mission is a cornerstone of Earth system science designed to deepen our understanding of how these environmental and biological components come together to influence our climate, carbon cycle, and ecosystems. PACE has funded three supporting components: the PACE Postlaunch Airborne eXperiment (PACE–PAX), the third PACE Science and Applications Team (SAT3), and the PACE Validation Science Team (PVST). Each group serves distinct but interdependent roles in advancing the scientific objectives of the mission through product development and rigorous assessment of data quality. Source: science.nasa.gov. Date: 2025-12-22.",
    "tags": []
  },
  {
    "id": "space:sentinel6b extends global ocean height record:2025-12-22T19:29:23.000Z",
    "title": "Sentinel-6B Extends Global Ocean Height Record",
    "url": "https://science.nasa.gov/science-research/earth-science/sentinel-6b-extends-global-ocean-height-record/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-12-22T19:29:23.000Z",
    "summary_long": "Explore This Section * Earth * Earth Observer * Editor’s Corner * Feature Articles * Meeting Summaries * News * Science in the News * Calendars * In Memoriam * Announcements * More * Archives * Conference Schedules * Style Guide 7 min read SENTINEL-6B EXTENDS GLOBAL OCEAN HEIGHT RECORD Introduction On November 16, 2025, the Sentinel-6B satellite launched from Vandenberg Space Force Base (VSFB) in California. The mission is a partnership between NASA, the National Oceanic and Atmospheric Administration (NOAA), and several European partners – the European Space Agency (ESA), the European Organisation for the Exploitation of Meteorological Satellites (EUMETSAT), the French Centre National d’Études Spatiales (CNES), and the European Commission. Its objective is to continue collecting data to extend the ocean height record, which was started in 1992 with the U.S./French TOPEX/Poseidon satellite mission. During the past three decades, NASA and its partners have operated a satellite in the same orbit, precisely tracking the height of the oceans…",
    "tags": []
  },
  {
    "id": "ai_data:results of the 2024 commonroad motion planning competition f:2025-12-22T16:46:40.000Z",
    "title": "Results of the 2024 CommonRoad Motion Planning Competition for Autonomous Vehicles",
    "url": "https://arxiv.org/abs/2512.19564v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yanliang Huang",
    "published_at": "2025-12-22T16:46:40.000Z",
    "summary_long": "Over the past decade, a wide range of motion planning approaches for autonomous vehicles has been developed to handle increasingly complex traffic scenarios. However, these approaches are rarely compared on standardized benchmarks, limiting the assessment of relative strengths and weaknesses. To address this gap, we present the setup and results of the 4th CommonRoad Motion Planning Competition held in 2024, conducted using the CommonRoad benchmark suite. This annual competition provides an open-source and reproducible framework for benchmarking motion planning algorithms. Source: arxiv.org. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:initialization of a polyharmonic cascade launch and testing:2025-12-22T16:17:37.000Z",
    "title": "Initialization of a Polyharmonic Cascade, Launch and Testing",
    "url": "https://arxiv.org/abs/2512.19524v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yuriy N. Bakhvalov",
    "published_at": "2025-12-22T16:17:37.000Z",
    "summary_long": "This paper concludes a series of studies on the polyharmonic cascade, a deep machine learning architecture theoretically derived from indifference principles and the theory of random functions. A universal initialization procedure is proposed, based on symmetric constellations in the form of hyperoctahedra with a central point. This initialization not only ensures stable training of cascades with tens and hundreds of layers (up to 500 layers without skip connections), but also radically simplifies the computations. Scalability and robustness are demonstrated on MNIST (98.3% without convolutions or augmentations), HIGGS (AUC approximately 0.885 on 11M examples), and Epsilon (AUC approximately 0.963 with 2000 features). Source: arxiv.org. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:holidays in space 25 years of space station celebrations:2025-12-22T22:09:47.000Z",
    "title": "Holidays in Space: 25 Years of Space Station Celebrations",
    "url": "https://www.nasa.gov/centers-and-facilities/johnson/nasa-johnson-celebrates-25-years-of-holidays-in-space/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Sumer Loggins",
    "published_at": "2025-12-22T22:09:47.000Z",
    "summary_long": "In the quarter century that humans have lived and worked aboard the International Space Station, astronauts and visitors from around the world have celebrated countless holidays more than 250 miles above Earth while traveling 17,500 miles per hour. Crews have marked Thanksgiving, Christmas and Hanukkah, New Year’s, birthdays, and national holidays as they circle the planet every 90 minutes. Holiday traditions in space often look familiar, just adapted for microgravity. NASA astronauts share special meals packed by the Space Food Systems Laboratory at the agency’s Johnson Space Center in Houston, where crews select their menus with help from nutritionists and food scientists before launch. Source: www.nasa.gov. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:causalguided detoxify backdoor attack of openweight lora mod:2025-12-22T11:40:47.000Z",
    "title": "Causal-Guided Detoxify Backdoor Attack of Open-Weight LoRA Models",
    "url": "https://arxiv.org/abs/2512.19297v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Linzhi Chen",
    "published_at": "2025-12-22T11:40:47.000Z",
    "summary_long": "Low-Rank Adaptation (LoRA) has emerged as an efficient method for fine-tuning large language models (LLMs) and is widely adopted within the open-source community. However, the decentralized dissemination of LoRA adapters through platforms such as Hugging Face introduces novel security vulnerabilities: malicious adapters can be easily distributed and evade conventional oversight mechanisms. Despite these risks, backdoor attacks targeting LoRA-based fine-tuning remain relatively underexplored. Existing backdoor attack strategies are ill-suited to this setting, as they often rely on inaccessible training data, fail to account for the structural properties unique to LoRA, or suffer from high false trigger rates (FTR), thereby compromising their stealth. Source: arxiv.org. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:washing machine filter captures microfibers as small as 20 m:2025-12-22T17:47:53.000Z",
    "title": "Washing machine filter captures microfibers as small as 20 micrometers in size",
    "url": "https://techxplore.com/news/2025-12-machine-filter-captures-microfibers-small.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-22T17:47:53.000Z",
    "summary_long": "A single laundry load containing synthetic clothing can release thousands of plastic microfibers from nylon, acrylic and polyester materials. Lab testing of an SA-made washing machine filter at Flinders University shows it can be a useful new way to help protect waterways from polyester and other synthetic microparticles. Source: techxplore.com. Date: 2025-12-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]