[
  {
    "id": "bigtech:californias newly signed ai law just gave big tech exactly w:2025-09-30T15:12:10.000Z",
    "title": "California’s newly signed AI law just gave Big Tech exactly what it wanted",
    "url": "https://arstechnica.com/ai/2025/09/californias-newly-signed-ai-law-just-gave-big-tech-exactly-what-it-wanted/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-09-30T15:12:10.000Z",
    "summary_long": "On Monday, California Governor Gavin Newsom signed the Transparency in Frontier Artificial Intelligence Act into law, requiring AI companies to disclose their safety practices while stopping short of mandating actual safety testing. The law requires companies with annual revenues of at least $500 million to publish safety protocols on their websites and report incidents to state authorities, but it lacks the stronger enforcement teeth of the bill Newsom vetoed last year after tech companies lobbied heavily against it. The legislation, S.B. 53, replaces Senator Scott Wiener's previous attempt at AI regulation, known as S.B. Source: arstechnica.com. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:deepseek tests sparse attention to slash ai processing costs:2025-09-30T20:18:39.000Z",
    "title": "DeepSeek tests “sparse attention” to slash AI processing costs",
    "url": "https://arstechnica.com/ai/2025/09/deepseek-tests-sparse-attention-to-slash-ai-processing-costs/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-09-30T20:18:39.000Z",
    "summary_long": "Ever wonder why ChatGPT slows down during long conversations? The culprit is a fundamental mathematical challenge: Processing long sequences of text requires massive computational resources, even with the efficiency tricks that companies have already deployed. While US tech giants can afford to throw more hardware at the problem, Chinese AI company DeepSeek, which is cut off from a steady supply of some advanced AI chips by export restrictions, has extra motivation to squeeze more performance from less silicon. On Monday, DeepSeek released an experimental version of its latest simulated reasoning language model, DeepSeek-V3.2-Exp, which introduces what it calls \"DeepSeek Sparse Attention\" (DSA). Source: arstechnica.com. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:youtuber unboxes what seems to be a prerelease version of an:2025-09-30T19:12:15.000Z",
    "title": "YouTuber unboxes what seems to be a pre-release version of an M5 iPad Pro",
    "url": "https://arstechnica.com/gadgets/2025/09/youtuber-unboxes-what-seems-to-be-a-pre-release-version-of-an-m5-ipad-pro/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2025-09-30T19:12:15.000Z",
    "summary_long": "Apple's biggest product event of the year happens in September, when the company puts out a new batch of iPhones and Apple Watches and other odds and ends. But in most years, Apple either has another smaller event or just a handful of additional product announcements later in the fall in October or November—usually the focus is on the Mac, the iPad, or both. It seems like a new iPad Pro could be one of the announcements on tap. Russian YouTube channel Wylsacom has posted an unboxing video and early tour of what appears to be a retail boxed version of a new 256GB 13-inch iPad Pro, as well as an M5 processor that we haven't seen in any other Apple product yet. Source: arstechnica.com. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:mexc ventures raises ethena investment to 66m:2025-10-01T03:00:00.000Z",
    "title": "MEXC Ventures Raises Ethena Investment to $66M",
    "url": "https://www.coindesk.com/business/2025/09/30/mexc-ventures-raises-ethena-investment-to-usd66m",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-10-01T03:00:00.000Z",
    "summary_long": "MEXC Ventures has doubled down on its investment in the Ethena ecosystem, bringing its total exposure to $66 million, according to a press release shared with CoinDesk. The latest move includes a $14 million investment in ENA, the governance token of the Ethena protocol, building on a $16 million ENA purchase and $20 million acquisition of USDe made earlier this year. USDe is a synthetic stablecoin designed to track the value of the dollar without holding traditional reserves. Instead, it uses a combination of collateralized stablecoins and futures contracts. Source: www.coindesk.com. Date: 2025-10-01. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:coinbases bitcoinbacked loans surpass 1b as exchange prepare:2025-09-30T18:53:02.000Z",
    "title": "Coinbase’s Bitcoin-Backed Loans Surpass $1B as Exchange Prepares to Lift Borrowing Cap",
    "url": "https://www.coindesk.com/markets/2025/09/30/coinbase-s-bitcoin-backed-loans-surpass-usd1b-as-exchange-prepares-to-lift-borrowing-cap",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2025-09-30T18:53:02.000Z",
    "summary_long": "Coinbase (COIN) said its bitcoin-backed loan program has surpassed $1 billion in originations since launching in January, underscoring growing demand for crypto as collateral. The exchange currently offers retail customers in the U.S. the ability to borrow cash against bitcoin (BTC) holdings through the on-chain Morpho platform. A spokesperson said the average loan size sits at $54,000 but noted the firm plans to raise its borrowing cap from $1 million to $5 million in the coming weeks. Source: www.coindesk.com. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:stablecoin market surges on us regulation with circles usdc :2025-09-30T13:32:42.000Z",
    "title": "Stablecoin Market Surges on U.S. Regulation, With Circle's USDC Gaining Ground: JPMorgan",
    "url": "https://www.coindesk.com/markets/2025/09/30/stablecoin-market-surges-on-u-s-regulation-with-circle-s-usdc-gaining-ground-jpmorgan",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-09-30T13:32:42.000Z",
    "summary_long": "JPMorgan analysts said the stablecoin market has pulled ahead of the broader crypto ecosystem this year, fueled in part by the passage of the U.S. GENIUS Act. At nearly $300 billion, the market has grown 42% year-to-date, nearly double the 21% growth of crypto overall, according to a report published Tuesday. The report notes that stablecoins now make up about 7.5% of the $3.8 trillion total crypto market cap and roughly 1.3% of the U.S. Source: www.coindesk.com. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:branching out broadening ai measurement and evaluation with :2025-09-30T17:58:59.000Z",
    "title": "Branching Out: Broadening AI Measurement and Evaluation with Measurement Trees",
    "url": "http://arxiv.org/abs/2509.26632v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Craig Greenberg",
    "published_at": "2025-09-30T17:58:59.000Z",
    "summary_long": "This paper introduces \\textit{measurement trees}, a novel class of metrics designed to combine various constructs into an interpretable multi-level representation of a measurand. Unlike conventional metrics that yield single values, vectors, surfaces, or categories, measurement trees produce a hierarchical directed graph in which each node summarizes its children through user-defined aggregation methods. In response to recent calls to expand the scope of AI system evaluation, measurement trees enhance metric transparency and facilitate the integration of heterogeneous evidence, including, e.g., agentic, business, energy-efficiency, sociotechnical, or security signals. We present definitions and examples, demonstrate practical utility through a large-scale measurement exercise, and provide accompanying open-source Python code. Source: arxiv.org. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:linking process to outcome conditional reward modeling for l:2025-09-30T17:38:45.000Z",
    "title": "Linking Process to Outcome: Conditional Reward Modeling for LLM Reasoning",
    "url": "http://arxiv.org/abs/2509.26578v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Zheng Zhang",
    "published_at": "2025-09-30T17:38:45.000Z",
    "summary_long": "Process Reward Models (PRMs) have emerged as a promising approach to enhance the reasoning capabilities of large language models (LLMs) by guiding their step-by-step reasoning toward a final answer. However, existing PRMs either treat each reasoning step in isolation, failing to capture inter-step dependencies, or struggle to align process rewards with the final outcome. Consequently, the reward signal fails to respect temporal causality in sequential reasoning and faces ambiguous credit assignment. These limitations make downstream models vulnerable to reward hacking and lead to suboptimal performance. Source: arxiv.org. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:parametric neural amp modeling with active learning:2025-09-30T17:30:00.000Z",
    "title": "Parametric Neural Amp Modeling with Active Learning",
    "url": "http://arxiv.org/abs/2509.26564v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Florian Grötschla",
    "published_at": "2025-09-30T17:30:00.000Z",
    "summary_long": "We introduce Panama, an active learning framework to train parametric guitar amp models end-to-end using a combination of an LSTM model and a WaveNet-like architecture. With \\model, one can create a virtual amp by recording samples that are determined through an ensemble-based active learning strategy to minimize the amount of datapoints needed (i.e., amp knob settings). Our strategy uses gradient-based optimization to maximize the disagreement among ensemble models, in order to identify the most informative datapoints. MUSHRA listening tests reveal that, with 75 datapoints, our models are able to match the perceptual quality of NAM, the leading open-source non-parametric amp modeler. Source: arxiv.org. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa blue origin invite media to attend mars mission launch:2025-09-30T22:00:25.000Z",
    "title": "NASA, Blue Origin Invite Media to Attend Mars Mission Launch",
    "url": "https://www.nasa.gov/news-release/nasa-blue-origin-invite-media-to-attend-mars-mission-launch/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lauren E. Low",
    "published_at": "2025-09-30T22:00:25.000Z",
    "summary_long": "A stylized illustration shows the twin ESCAPADE spacecraft entering Mars’ orbit. Credits: James Rattray/Rocket Lab USA NASA and Blue Origin are reopening media accreditation for the launch of the agency’s ESCAPADE (Escape and Plasma Acceleration and Dynamics Explorers) mission. The twin ESCAPADE spacecraft will study the solar wind’s interaction with Mars, providing insight into the planet’s real-time response to space weather and how solar activity drives atmospheric escape. This will be the second launch of Blue Origin’s New Glenn rocket. Source: www.nasa.gov. Date: 2025-09-30. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:headquarters and center chief counsel contacts:2025-09-30T18:07:41.000Z",
    "title": "Headquarters and Center Chief Counsel Contacts",
    "url": "https://www.nasa.gov/organizations/headquarters-and-center-chief-counsel-contacts/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "NASA",
    "published_at": "2025-09-30T18:07:41.000Z",
    "summary_long": "HEADQUARTERS * General Counsel Iris Lan * Deputy General Counsel Bryan R. Diederich (Acting) * Chief of Legal Operations Christine Pham (Acting) * Associate General Counsel for Contracts and Procurement, Headquarters Karen Reilley (Acting) * Associate General Counsel for Contracts and Acquisition Integrity Law Practice Group, Headquarters Karen Reilley (Acting) * Associate General Counsel for General Law Practice Group, Headquarters Katie Spear * Associate General Counsel for International and Space Law Practice Group, Headquarters Rebecca Bresnik * Agency Counsel for Ethics, Headquarters Adam Greenstone * Agency Counsel for the Acquisition Integrity Program, Headquarters Adam Supple (Acting) * Agency Counsel for Intellectual Property, Headquarters Trenton Roche CENTERS * Chief Counsel, Ames Research Center Christine Pham * Chief Counsel, Armstrong Flight Research Center Brett Swanson * Chief Counsel, Glenn Research Center James Jackson (Acting) * Chief Counsel, Goddard Space Flight Center Dave Barrett * Chief Counsel, Johnson Space Center Randall Suratt * Chief Counsel, Kennedy Space Center Alex Vinson * Chief Counsel,…",
    "tags": []
  },
  {
    "id": "space:widely attended gatherings wags determinations:2025-09-30T17:57:19.000Z",
    "title": "Widely Attended Gatherings (WAGs) Determinations",
    "url": "https://www.nasa.gov/organizations/nasa-ethics-advice-for-widely-attended-gatherings-wags/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "NASA",
    "published_at": "2025-09-30T17:57:19.000Z",
    "summary_long": "2025 Space Policy Institute 10.21.2025 MSBR Space Business Roundtable 10.15.2025 76th International Astronautical Congress_IAC 9-29-25 2025 Von Braun Memorial Dinner 10.29.25 Space Foundation Reception 9.16.25 Evening with the Stars 9.10.25 MSBR Rooftop Reception 9.8.25 AIAA Dinner 8.18.25 STScI Event 7.29.25 MSBR Lunch 7.16.25 Rocket Lab Event 7.16.25 MSBR Lunch Reception 6.18.25 2025 Paris Airshow 6.13-19.25 Greater Houston Partnership Reception 6.12.25 Axiom Space X-4 Event Space Foundation and German Embassy Reception 6.5.25 Mission 2 Moon Landing 6.5.25 H2M Conference and Events 5.28-29.25 Planetary Society 5.19.25 American Rocketry Challenge Reception 5.17.25 Rockets on the Hill Reception 5.16.25 Dayton Development Coalition Event 5.13.25 PA State Day Reception 5.6.25 MSBR STEM Gala 5.2.25 2025 ASF Hall of Fame Gala AIAA Awards Gala 4.30.25 RNASA Awards Dinner 4.25.25 2025 Space Heroes and Legends Gala Thunderbird School and Global Management Reception 40th Space Symposium Main Events GovExec Awards Dinner 4.3.25 AIA Reception.4.2.25 SPI/GWU Dinner.4.2.25 Astrolab and Axiom.3.27.25 SPI/GWU/USRA Symposium.3.27.25 IDGA 18th Annual Event Artemis VIP Reception.3.24.25…",
    "tags": []
  }
]