[
  {
    "id": "bigtech:supply chains ai and the cloud the biggest failures and one :2025-12-31T13:15:40.000Z",
    "title": "Supply chains, AI, and the cloud: The biggest failures (and one success) of 2025",
    "url": "https://arstechnica.com/security/2025/12/supply-chains-ai-and-the-cloud-the-biggest-failures-and-one-success-of-2025/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-12-31T13:15:40.000Z",
    "summary_long": "In a roundup of the top stories of 2024, Ars included a supply-chain attack that came dangerously close to inflicting a catastrophe for thousands—possibly millions—of organizations, which included a large assortment of Fortune 500 companies and government agencies. Supply-chain attacks played prominently again this year, as a seemingly unending rash of them hit organizations large and small. For threat actors, supply-chain attacks are the gift that keeps on giving—or, if you will, the hack that keeps on hacking. By compromising a single target with a large number of downstream users—say a cloud service or maintainers or developers of widely used open source or proprietary software—attackers can infect potentially millions of the target’s downstream users. Source: arstechnica.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:korbit fined 19 million for anti moneylaundering customer ve:2025-12-31T12:47:03.000Z",
    "title": "Korbit fined $1.9 million for anti money-laundering, customer verification breaches",
    "url": "https://www.coindesk.com/policy/2025/12/31/korbit-fined-usd1-9-million-for-anti-money-laundering-customer-verification-breaches",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2025-12-31T12:47:03.000Z",
    "summary_long": "Korbit fined $1.9 million for anti money-laundering, customer verification breaches Source: www.coindesk.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:reliable and resilient collective communication library for :2025-12-31T18:53:11.000Z",
    "title": "Reliable and Resilient Collective Communication Library for LLM Training and Serving",
    "url": "https://arxiv.org/abs/2512.25059v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Wei Wang",
    "published_at": "2025-12-31T18:53:11.000Z",
    "summary_long": "Modern ML training and inference now span tens to tens of thousands of GPUs, where network faults can waste 10--15\\% of GPU hours due to slow recovery. Common network errors and link fluctuations trigger timeouts that often terminate entire jobs, forcing expensive checkpoint rollback during training and request reprocessing during inference. We present R$^2$CCL, a fault-tolerant communication library that provides lossless, low-overhead failover by exploiting multi-NIC hardware. R$^2$CCL performs rapid connection migration, bandwidth-aware load redistribution, and resilient collective algorithms to maintain progress under failures. Source: arxiv.org. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:responserank dataefficient reward modeling through preferenc:2025-12-31T18:21:52.000Z",
    "title": "ResponseRank: Data-Efficient Reward Modeling through Preference Strength Learning",
    "url": "https://arxiv.org/abs/2512.25023v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Timo Kaufmann",
    "published_at": "2025-12-31T18:21:52.000Z",
    "summary_long": "Binary choices, as often used for reinforcement learning from human feedback (RLHF), convey only the direction of a preference. A person may choose apples over oranges and bananas over grapes, but which preference is stronger? Strength is crucial for decision-making under uncertainty and generalization of preference models, but hard to measure reliably. Metadata such as response times and inter-annotator agreement can serve as proxies for strength, but are often noisy and confounded. Source: arxiv.org. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:haineifrdm explore diffusion to restore defects in fastmovem:2025-12-31T16:18:07.000Z",
    "title": "HaineiFRDM: Explore Diffusion to Restore Defects in Fast-Movement Films",
    "url": "https://arxiv.org/abs/2512.24946v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Rongji Xun",
    "published_at": "2025-12-31T16:18:07.000Z",
    "summary_long": "Existing open-source film restoration methods show limited performance compared to commercial methods due to training with low-quality synthetic data and employing noisy optical flows. In addition, high-resolution films have not been explored by the open-source methods.We propose HaineiFRDM(Film Restoration Diffusion Model), a film restoration framework, to explore diffusion model's powerful content-understanding ability to help human expert better restore indistinguishable film defects.Specifically, we employ a patch-wise training and testing strategy to make restoring high-resolution films on one 24GB-VRAMR GPU possible and design a position-aware Global Prompt and Frame Fusion Modules.Also, we introduce a global-local frequency module to reconstruct consistent textures among different patches. Besides, we firstly restore a low-resolution result and use it as global residual to mitigate blocky artifacts caused by patching process.Furthermore, we construct a film restoration dataset that contains restored real-degraded films and realistic synthetic data.Comprehensive experimental results conclusively demonstrate the superiority of our model in defect restoration ability over existing open-source methods. Code and the dataset will…",
    "tags": []
  },
  {
    "id": "consumer:how to watch samsungs first look ces 2026 presentation:2025-12-31T19:00:27.000Z",
    "title": "How to watch Samsung's \"First Look\" CES 2026 presentation",
    "url": "https://www.engadget.com/mobile/how-to-watch-samsungs-first-look-ces-2026-presentation-190027604.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Katie Teague",
    "published_at": "2025-12-31T19:00:27.000Z",
    "summary_long": "Samsung is arguably the 800-pound gorilla of CES, with a full spectrum of products that range from phones and computers to refrigerators to AI assistants and rolling robots. But for CES 2026, the company is shaking up the schedule a bit: Instead of its longtime midday Monday press conference position, the Korean giant will front-run the entire show with a Sunday night presentation. Samsung has already given a few hints as to what's on the agenda, but what we're really hoping to see is an update on the Ballie robot — a star of previous CES presentations that ostensibly missed its previously promised 2025 release date. HOW TO WATCH SAMSUNG'S \"THE FIRST LOOK\" PRESENTATION AT CES 2026 The event will stream live from the Wynn Hotel in Las Vegas on Sunday, January 4 at 10PM ET. Source: www.engadget.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:here we go again retiring coal plant forced to stay open by :2025-12-31T16:30:33.000Z",
    "title": "Here we go again: Retiring coal plant forced to stay open by Trump Admin",
    "url": "https://arstechnica.com/science/2025/12/trump-admin-orders-another-coal-plant-to-stay-open/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    John Timmer\n                ",
    "published_at": "2025-12-31T16:30:33.000Z",
    "summary_long": "On Tuesday, US Secretary of Energy Chris Wright issued a now familiar order: because of a supposed energy emergency, a coal plant scheduled for closure would be forced to remain open. This time, the order targeted one of the three units present at Craig Station in Colorado, which was scheduled to close at the end of this year. The remaining two units were expected to shut in 2028. The supposed reason for this order is an emergency caused by a shortage of generating capacity. Source: arstechnica.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:softbank lifts openai stake to 11 with 41bln investment:2025-12-31T10:10:01.000Z",
    "title": "SoftBank lifts OpenAI stake to 11% with $41bln investment",
    "url": "https://techxplore.com/news/2025-12-softbank-openai-stake-41bln-investment.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-31T10:10:01.000Z",
    "summary_long": "SoftBank lifts OpenAI stake to 11% with $41bln investment Source: techxplore.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:from prophet to product how ai came back down to earth in 20:2025-12-31T12:00:31.000Z",
    "title": "From prophet to product: How AI came back down to earth in 2025",
    "url": "https://arstechnica.com/ai/2025/12/from-prophet-to-product-how-ai-came-back-down-to-earth-in-2025/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-12-31T12:00:31.000Z",
    "summary_long": "Following two years of immense hype in 2023 and 2024, this year felt more like a settling-in period for the LLM-based token prediction industry. After more than two years of public fretting over AI models as future threats to human civilization or the seedlings of future gods, it's starting to look like hype is giving way to pragmatism: Today's AI can be very useful, but it's also clearly imperfect and prone to mistakes. That view isn't universal, of course. There's a lot of money (and rhetoric) betting on a stratospheric, world-rocking trajectory for AI. Source: arstechnica.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:france plans social media ban for children under 15:2025-12-31T17:28:18.000Z",
    "title": "France plans social media ban for children under 15",
    "url": "https://techxplore.com/news/2025-12-france-social-media-children.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-31T17:28:18.000Z",
    "summary_long": "France plans social media ban for children under 15 Source: techxplore.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:lighter trading platform sees 250 million withdrawn 24 hours:2025-12-31T15:29:13.000Z",
    "title": "Lighter trading platform sees $250 million withdrawn 24 hours after airdrop",
    "url": "https://www.coindesk.com/markets/2025/12/31/lighter-trading-platform-sees-usd250-million-withdrawn-24-hours-after-tge",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2025-12-31T15:29:13.000Z",
    "summary_long": "Lighter trading platform sees $250 million withdrawn 24 hours after airdrop Source: www.coindesk.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:how to watch the sony honda afeela ces 2026 press conference:2025-12-31T18:42:16.000Z",
    "title": "How to watch the Sony Honda Afeela CES 2026 press conference",
    "url": "https://www.engadget.com/transportation/evs/how-to-watch-the-sony-honda-afeela-ces-2026-press-conference-130048622.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Katie Teague",
    "published_at": "2025-12-31T18:42:16.000Z",
    "summary_long": "Sony's CES 2026 press conference is just days away, but this year has a twist: Instead of an overview of Sony's electronics, video game and Hollywood studio plans for the new year, the presser will apparently have a more narrow focus: electric vehicles. That's because the traditional end-of-press-day slot isn't just Sony, but rather Sony Honda Mobility — the joint venture responsible for the Afeela 1 electric car that has been showcased at CES for the better part of a decade. This year, however, we'll also apparently get to see a an all-new concept model at the event, too. HOW TO WATCH THE SONY AFEELA CES 2026 PRESS CONFERENCE The event will be streamed live from Las Vegas on Monday, January 5 at 8PM ET via the Afeela official YouTube channel. Source: www.engadget.com. Date: 2025-12-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]