[
  {
    "id": "bigtech:polands energy grid was targeted by neverbeforeseen wiper ma:2026-01-24T19:08:06.000Z",
    "title": "Poland's energy grid was targeted by never-before-seen wiper malware",
    "url": "https://arstechnica.com/security/2026/01/wiper-malware-targeted-poland-energy-grid-but-failed-to-knock-out-electricity/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2026-01-24T19:08:06.000Z",
    "summary_long": "Researchers on Friday said that Poland’s electric grid was targeted by wiper malware, likely unleashed by Russia state hackers, in an attempt to disrupt electricity delivery operations. A cyberattack, Reuters reported, occurred during the last week of December. The news organization said it was aimed at disrupting communications between renewable installations and the power distribution operators but failed for reasons not explained. WIPERS R US On Friday, security firm ESET said the malware responsible was a wiper, a type of malware that permanently erases code and data stored on servers with the goal of destroying operations completely. Source: arstechnica.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:microsoft handed the government encryption keys for customer:2026-01-24T22:39:57.000Z",
    "title": "Microsoft handed the government encryption keys for customer data",
    "url": "https://www.theverge.com/news/867244/microsoft-bitlocker-privacy-fbi",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Terrence O’Brien",
    "published_at": "2026-01-24T22:39:57.000Z",
    "summary_long": "The FBI went to Microsoft last year with a warrant, asking them to hand over keys to unlock encrypted data stored on three laptops as part of an investigation into potential fraud involving the COVID unemployment assistance program in Guam - and Microsoft complied. Typically, companies resist handing over encryption keys to authorities. Most famously, Apple refused to grant the FBI access to a phone used by the San Bernardino shooters in 2016. The FBI eventually found a third-party to hack their way into the phone, but ultimately withdrew its case. Source: www.theverge.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:gmails spam filter and automatic sorting are broken:2026-01-24T17:54:10.000Z",
    "title": "Gmail’s spam filter and automatic sorting are broken",
    "url": "https://www.theverge.com/tech/867247/gmails-spam-filter-broken",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Terrence O’Brien",
    "published_at": "2026-01-24T17:54:10.000Z",
    "summary_long": "Some Gmail users may have noticed that promotional emails that normally go to their own siloed tab have started flooding their inbox. Reports hit the Google forums and Reddit that messages are bypassing the Updates and Promotional filters and went straight to Gmail inboxes. Some also reported seeing a banner at the top of some messages warning them to \"be careful with this message,\" explaining that it hasn't been fully scanned for spam or malware. Google acknowledged the issue, posting on the Workspace Status Dashboard: > Gmail users might see banners indicating missing spam checks.We are experiencing an issue with Gmail beginning on Saturd … Read the full story at The Verge. Source: www.theverge.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch 25 starlink satellites to pol:2026-01-25T03:41:11.000Z",
    "title": "Live coverage: SpaceX to launch 25 Starlink satellites to polar, low Earth orbit",
    "url": "https://spaceflightnow.com/2026/01/25/live-coverage-spacex-to-launch-25-starlink-satellites-to-polar-low-earth-orbit/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-25T03:41:11.000Z",
    "summary_long": "SpaceX plans to launch 25 of its Starlink V2 Mini Optimized satellites from California on Sunday morning. The Starlink 17-20 mission will send the broadband satellites into a polar low Earth orbit. The Falcon 9 rocket will fly on a southerly trajectory upon leaving Vandenberg Space Force Base. Liftoff from Space Launch Complex 4 East is scheduled for 7:38:20 a.m. Source: spaceflightnow.com. Date: 2026-01-25. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:ntsb will investigate why waymos robotaxis are illegally pas:2026-01-24T16:09:43.000Z",
    "title": "NTSB will investigate why Waymo's robotaxis are illegally passing school buses",
    "url": "https://www.engadget.com/transportation/ntsb-will-investigate-why-waymos-robotaxis-are-illegally-passing-school-buses-160943613.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2026-01-24T16:09:43.000Z",
    "summary_long": "Waymo has caught the attention of the National Transportation Safety Board as the federal agency launched an official investigation into the company for its robotaxis improperly passing school buses in Austin, Texas. The NTSB said on X that it would \"examine the interaction between Waymo vehicles and school buses stopped for loading and unloading students.\" The latest federal probe stems from a preliminary evaluation by the National Highway Traffic Safety Administration that looked into how Waymo reacts to stopped school buses in the Texas city. That report led to Waymo's voluntary software recall in December. However, the school district said in a memo that the robotaxis were seen repeating the same offense days after the software update. Source: www.engadget.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:ukraine banned polymarket and theres no legal way for it to :2026-01-24T15:40:09.000Z",
    "title": "Ukraine banned Polymarket and there’s no legal way for it to come back",
    "url": "https://www.coindesk.com/policy/2026/01/24/ukraine-banned-polymarket-and-there-s-no-legal-way-for-it-to-come-back",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2026-01-24T15:40:09.000Z",
    "summary_long": "Ukraine banned Polymarket and there’s no legal way for it to come back Source: www.coindesk.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:spacecoin launches space token just days after partnering wi:2026-01-24T16:47:39.000Z",
    "title": "Spacecoin launches SPACE token just days after partnering with Trump family-linked DeFi project",
    "url": "https://www.coindesk.com/business/2026/01/24/spacecoin-launches-space-token-just-days-after-partnering-with-trump-family-linked-defi-project",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2026-01-24T16:47:39.000Z",
    "summary_long": "Spacecoin launches SPACE token just days after partnering with Trump family-linked DeFi project Source: www.coindesk.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:coinbase ceo says big banks now view crypto as an existentia:2026-01-24T19:22:36.000Z",
    "title": "Coinbase CEO says Big banks now view crypto as an ‘existential’ threat to their business",
    "url": "https://www.coindesk.com/business/2026/01/24/coinbase-ceo-says-big-banks-now-view-crypto-as-an-existential-threat-to-their-business",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Aoyon Ashraf",
    "published_at": "2026-01-24T19:22:36.000Z",
    "summary_long": "Coinbase CEO says Big banks now view crypto as an ‘existential’ threat to their business Source: www.coindesk.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:report reveals that openais gpt52 model cites grokipedia:2026-01-24T19:25:32.000Z",
    "title": "Report reveals that OpenAI's GPT-5.2 model cites Grokipedia",
    "url": "https://www.engadget.com/ai/report-reveals-that-openais-gpt-52-model-cites-grokipedia-192532977.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2026-01-24T19:25:32.000Z",
    "summary_long": "OpenAI may have called GPT-5.2 its \"most advanced frontier model for professional work,\" but tests conducted by the Guardian cast doubt on its credibility. According to the report, OpenAI's GPT-5.2 model cited Grokipedia, the online encyclopedia powered by xAI, when it came to specific, but controversial topics related to Iran or the Holocaust. As seen in the Guardian's report, ChatGPT used Grokipedia as a source for claims about the Iranian government being tied to telecommunications company MTN-Irancell and questions related to Richard Evans, a British historian who served as an expert witness during a libel trial for Holocaust denier David Irving. However, the Guardian noted ChatGPT didn't use Grokipedia when it came to a prompt asking about media bias against Donald Trump and other controversial topics. Source: www.engadget.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:how the use of ai for apologies could cause the canadian sor:2026-01-24T18:00:01.000Z",
    "title": "How the use of AI for apologies could cause the 'Canadian sorry' to lose its soul",
    "url": "https://techxplore.com/news/2026-01-ai-canadian-soul.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-24T18:00:01.000Z",
    "summary_long": "It is a stereotype that Canadians apologize for everything. We say sorry when you bump into us. We say sorry for the weather. But as we trudge through the gray days of winter, that national instinct for politeness hits a wall of fatigue. Source: techxplore.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:swarms of mini robots that bloom could lead to adaptive arch:2026-01-24T15:50:02.000Z",
    "title": "Swarms of mini robots that 'bloom' could lead to adaptive architecture",
    "url": "https://techxplore.com/news/2026-01-swarms-mini-robots-bloom-architecture.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-24T15:50:02.000Z",
    "summary_long": "Nature is, of course, the master engineer—been there, seen it, solved it. While we struggle to design buildings that don't overheat or feel like concrete cages, nature has been perfecting comfortable living structures for ages. Now scientists are borrowing from the natural world again; this time, to build a swarm of interconnected mini-robots that could lead to buildings with dynamic facades that respond to sunlight and the people inside. Source: techxplore.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:how to use google photos new me meme feature:2026-01-24T14:00:00.000Z",
    "title": "How to use Google Photos' new Me Meme feature",
    "url": "https://www.engadget.com/ai/how-to-use-google-photos-new-me-meme-feature-140000157.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2026-01-24T14:00:00.000Z",
    "summary_long": "Google has started rolling out a new feature for its Photos app that can turn your images into memes. The feature, called Me Meme, uses Google Gemini to take meme templates and recreate them with the photo you use from within the app. It’s still in its experimental stages and will only be available for users in the US in the English language. In addition, it seems to be rolling out for Android users only at the moment, and Google warns that the generated images may not match the original photo at times. Source: www.engadget.com. Date: 2026-01-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]