[
  {
    "id": "bigtech:nintendo switch is the secondbestselling game console ever b:2026-02-03T18:56:20.000Z",
    "title": "Nintendo Switch is the second-bestselling game console ever, behind only the PS2",
    "url": "https://arstechnica.com/gadgets/2026/02/original-nintendo-switch-passes-the-ds-to-become-nintendos-bestselling-console/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-02-03T18:56:20.000Z",
    "summary_long": "Although it was finally replaced last year by the new Switch 2, the orginal switch isn't done just yet. Many recent Switch games (and a handful of major updates, like the one for Animal Crossing) have been released in both Switch and Switch 2 editions, and Nintendo continues to sell all editions of the original console as entry-level systems for those who can't pay $450 for a Switch 2. The 9-year-old Switch's continued availability has helped it clear a milestone, according to the company's third-quarter financial results (PDF). As of December 31, 2025, Nintendo says the Switch \"has reached the highest sales volume of any Nintendo hardware\" with a total of 155.37 million units sold, surpassing the original DS's lifetime total of 154.02 million units. Source: arstechnica.com. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:upset at reports that hed given up trump now wants 1b from h:2026-02-03T17:08:34.000Z",
    "title": "Upset at reports that he'd given up, Trump now wants $1B from Harvard",
    "url": "https://arstechnica.com/tech-policy/2026/02/upset-at-reports-that-hed-given-up-trump-now-wants-1b-from-harvard/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    John Timmer\n                ",
    "published_at": "2026-02-03T17:08:34.000Z",
    "summary_long": "Amid the Trump administration's attack on universities, Harvard has emerged as a particular target. Early on, the administration put $2.2 billion in research money on hold and shortly thereafter blocked all future funding while demanding intrusive control over Harvard's hiring and admissions. Unlike many of its peer institutions, Harvard fought back, filing and ultimately winning a lawsuit that restored the cut funds. Despite Harvard's victory, the Trump administration continued to push for some sort of formal agreement that would settle the administration's accusations that Harvard created an environment that allowed antisemitism to flourish. Source: arstechnica.com. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:netflix says users can cancel service if hbo max merger make:2026-02-03T23:41:39.000Z",
    "title": "Netflix says users can cancel service if HBO Max merger makes it too expensive",
    "url": "https://arstechnica.com/gadgets/2026/02/netflix-claims-subscribers-will-get-more-content-for-less-if-it-buys-hbo-max/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Scharon Harding\n                ",
    "published_at": "2026-02-03T23:41:39.000Z",
    "summary_long": "Discovery’s (WBD's) streaming and movie studios businesses. One of the biggest fears is that the merger would lead to higher prices due to Netflix having less competition. During a Senate hearing today, Netflix co-CEO Ted Sarandos suggested that the merger would have an opposite effect. Sarandos was speaking at a hearing held by the US Senate Judiciary Committee’s Subcommittee on Antitrust, Competition Policy, and Consumer Rights, “Examining the Competitive Impact of the Proposed Netflix-Warner Brothers Transaction.” Sarandos aimed to convince the subcommittee that Netflix wouldn’t become a monopoly in streaming or in movie and TV production if regulators allowed its acquisition to close. Source: arstechnica.com. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:amd suggests the nextgen xbox will arrive in 2027:2026-02-04T05:27:07.000Z",
    "title": "AMD suggests the next-gen Xbox will arrive in 2027",
    "url": "https://www.engadget.com/gaming/xbox/amd-suggests-the-next-gen-xbox-will-arrive-in-2027-052707822.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2026-02-04T05:27:07.000Z",
    "summary_long": "Microsoft could launch the next-generation Xbox console sometime in 2027, AMD CEO Lisa Su has revealed during the semiconductor company’s latest earnings call. Valve is on track to start shipping its AMD-powered Steam Machine early this year, she said, while Microsoft’s development of an Xbox with a semi-custom SOC from AMD is “progressing well to support a launch in 2027.” While it doesn’t necessarily mean Microsoft is releasing a new Xbox console next year, that seems to be the company’s current goal. Xbox president Sarah Bond announced Microsoft’s multi-year partnership with AMD for its consoles in mid-2025. Based on Bond’s statement back then, Microsoft is embracing the use of artificial intelligence and machine learning in future Xbox games. Source: www.engadget.com. Date: 2026-02-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:python 3143 and 31312 are now available:2026-02-03T22:08:00.002Z",
    "title": "Python 3.14.3 and 3.13.12 are now available!",
    "url": "https://pythoninsider.blogspot.com/2026/02/python-3143-and-31312-are-now-available.html",
    "category_id": "code",
    "region": "Global",
    "source": "pythoninsider.blogspot.com",
    "author": "Thomas Wouters",
    "published_at": "2026-02-03T22:08:00.002Z",
    "summary_long": "PYTHON 3.14.3 IS NOW AVAILABLE! Two snakes enjoying a pie with 3.14 on the top and π crimping538×507 110 KB THIS IS THIRD MAINTENANCE RELEASE OF PYTHON 3.14 Python 3.14.3 is the third maintenance release of 3.14, containing around 299 bugfixes, build improvements and documentation changes since 3.14.2. MAJOR NEW FEATURES OF THE 3.14 SERIES, COMPARED TO 3.13 Some of the major new features and changes in Python 3.14 are: NEW FEATURES * PEP 779: Free-threaded Python is officially supported * PEP 649: The evaluation of annotations is now deferred, improving the semantics of using annotations. * PEP 750: Template string literals (t-strings) for custom string processing, using the familiar syntax of f-strings. Source: pythoninsider.blogspot.com. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:xs paris hq raided by french prosecutors:2026-02-03T21:03:18.000Z",
    "title": "X's Paris HQ raided by French prosecutors",
    "url": "https://www.engadget.com/social-media/xs-paris-hq-raided-by-french-prosecutors-110411170.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2026-02-03T21:03:18.000Z",
    "summary_long": "Paris prosecutors announced that a search was underway at offices belong to Elon Musk’s X platform as part of an ongoing investigation first launched in January 2025. The raid is being conducted by Paris and national cybercrime units, with support from Interpol, according to post from Paris prosecutors on X. Officials from X have yet to comment on the matter. At the same time, Paris prosecutors issued summonses to Elon Musk and Linda Yaccarino for “voluntary interviews” on April 20, 2026 in Paris. Source: www.engadget.com. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:fitbit founders launch luffu a way to integrate your familys:2026-02-03T18:14:45.000Z",
    "title": "Fitbit founders launch Luffu, a way to integrate your family's health data",
    "url": "https://www.engadget.com/mobile/fitbit-founders-launch-luffu-a-way-to-integrate-your-familys-health-data-173251994.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2026-02-03T18:14:45.000Z",
    "summary_long": "Fitbit's founders have a new startup. Two years after leaving Google, James Park and Eric Friedman announced a new platform that shifts the focus from the individual to the family. They say the Luffu mobile app \"uses AI quietly in the background\" to collect and organize family health information. \"At Fitbit, we focused on personal health — but after Fitbit, health for me became bigger than just thinking about myself,\" Park said in a press release. Source: www.engadget.com. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:bridging online and offline rl contextual bandit learning fo:2026-02-03T18:08:41.000Z",
    "title": "Bridging Online and Offline RL: Contextual Bandit Learning for Multi-Turn Code Generation",
    "url": "https://arxiv.org/abs/2602.03806v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Ziru Chen",
    "published_at": "2026-02-03T18:08:41.000Z",
    "summary_long": "Recently, there have been significant research interests in training large language models (LLMs) with reinforcement learning (RL) on real-world tasks, such as multi-turn code generation. While online RL tends to perform better than offline RL, its higher training cost and instability hinders wide adoption. In this paper, we build on the observation that multi-turn code generation can be formulated as a one-step recoverable Markov decision process and propose contextual bandit learning with offline trajectories (Cobalt), a new method that combines the benefits of online and offline RL. Cobalt first collects code generation trajectories using a reference LLM and divides them into partial trajectories as contextual prompts. Source: arxiv.org. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:understanding agent scaling in llmbased multiagent systems v:2026-02-03T17:58:10.000Z",
    "title": "Understanding Agent Scaling in LLM-Based Multi-Agent Systems via Diversity",
    "url": "https://arxiv.org/abs/2602.03794v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yingxuan Yang",
    "published_at": "2026-02-03T17:58:10.000Z",
    "summary_long": "LLM-based multi-agent systems (MAS) have emerged as a promising approach to tackle complex tasks that are difficult for individual LLMs. A natural strategy is to scale performance by increasing the number of agents; however, we find that such scaling exhibits strong diminishing returns in homogeneous settings, while introducing heterogeneity (e.g., different models, prompts, or tools) continues to yield substantial gains. This raises a fundamental question: what limits scaling, and why does diversity help? We present an information-theoretic framework showing that MAS performance is bounded by the intrinsic task uncertainty, not by agent count. Source: arxiv.org. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:what the fastestgrowing tools reveal about how software is b:2026-02-03T17:00:00.000Z",
    "title": "What the fastest-growing tools reveal about how software is being built",
    "url": "https://github.blog/news-insights/octoverse/what-the-fastest-growing-tools-reveal-about-how-software-is-being-built/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Dylan Birtolo",
    "published_at": "2026-02-03T17:00:00.000Z",
    "summary_long": "In 2025, software development crossed a quiet threshold. In our latest Octoverse report, we found that the fastest-growing languages, tools, and open source projects on GitHub are no longer about shipping more code. Instead, they’re about reducing friction in a world where AI is helping developers build more, faster. By looking at some of the areas of fastest growth over the past year, we can see how developers are adapting through: * The programming languages that are growing most in AI-assisted development workflows. Source: github.blog. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:fastmwem private data release in sublinear time:2026-02-03T16:51:40.000Z",
    "title": "Fast-MWEM: Private Data Release in Sublinear Time",
    "url": "https://arxiv.org/abs/2602.03732v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Themistoklis Haris",
    "published_at": "2026-02-03T16:51:40.000Z",
    "summary_long": "The Multiplicative Weights Exponential Mechanism (MWEM) is a fundamental iterative framework for private data analysis, with broad applications such as answering $m$ linear queries, or privately solving systems of $m$ linear constraints. However, a critical bottleneck hindering its scalability is the $Θ(m)$ time complexity required to execute the exponential mechanism in each iteration. We introduce a modification to the MWEM framework that improves the per-iteration runtime dependency to $Θ(\\sqrt{m})$ in expectation. This is done via a lazy sampling approach to the Report-Noisy-Max mechanism, which we implement efficiently using Gumbel noise and a $k$-Nearest Neighbor data structure. Source: arxiv.org. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:spain considers social media ban for under16s joining others:2026-02-03T16:00:08.000Z",
    "title": "Spain considers social media ban for under-16s, joining others in Europe",
    "url": "https://techxplore.com/news/2026-02-spain-social-media-16s-europe.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-03T16:00:08.000Z",
    "summary_long": "Spain considers social media ban for under-16s, joining others in Europe Source: techxplore.com. Date: 2026-02-03. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]