[
  {
    "id": "bigtech:jaguar land rover looking at 25 billion price tag from cripp:2025-10-22T13:39:57.000Z",
    "title": "Jaguar Land Rover looking at $2.5 billion price tag from crippling cyberattack",
    "url": "https://arstechnica.com/security/2025/10/jaguar-land-rover-struggling-8-weeks-after-most-expensive-uk-cyberattack/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kana Inagaki and Kieran Smith, Financial Times\n                ",
    "published_at": "2025-10-22T13:39:57.000Z",
    "summary_long": "The cyberattack on Jaguar Land Rover is estimated to have cost the UK at least £1.9 billion in what is likely to be “the most economically damaging cyber event” for the country. The month-long shutdown of internal systems and production at JLR affected over 5,000 British organisations, according to an analysis by Cyber Monitoring Centre, a non-profit organization that ranks the severity of cyber events in the UK. “This incident looks to have been by some distance, the single most financially damaging cyber event ever to hit the UK,” said Ciaran Martin, former head of the National Cyber Security Centre and chair of CMC’s technical committee. Read full article Comments Source: arstechnica.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:musk wants to get rid of teslas robotaxi babysitters by the :2025-10-22T22:59:25.000Z",
    "title": "Musk wants to get rid of Tesla’s robotaxi babysitters ‘by the end of the year’",
    "url": "https://www.theverge.com/transportation/804972/tesla-robotaxi-safety-monitor-remove-austin-musk",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Andrew J. Hawkins",
    "published_at": "2025-10-22T22:59:25.000Z",
    "summary_long": "Tesla CEO Elon Musk predicted the company would be able to remove the safety monitors from its robotaxis \"by the end of the year.\" He also said Tesla would launch a robotaxi service in 8-10 new markets also before the end of 2025. \"We are expecting to have no safety drivers in at least large parts of Austin by the end of this year,\" Musk said in an earnings call with investors. \"So within a few months, we expect to have no safety drivers at all, at least in parts of Austin. We're obviously being very cautious about the deployment.\" Tesla's robotaxis in Austin and San Francisco include safety monitors with access to a kill switch - a fallb … Read the full story at The Verge. Source: www.theverge.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:here are amazons smart delivery glasses that guide drivers a:2025-10-22T22:27:04.000Z",
    "title": "Here are Amazon’s smart delivery glasses that guide drivers and scan packages",
    "url": "https://www.theverge.com/news/804962/amazon-reveals-smart-delivery-glasses-that-guide-drivers-and-scan-packages",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Sean Hollister",
    "published_at": "2025-10-22T22:27:04.000Z",
    "summary_long": "Remember when word got out that Amazon was building smart glasses for its delivery drivers before possibly launching a version for consumers as well? Amazon has just revealed those “Amelia” glasses to the world — with a built-in display and an always-on camera to assist drivers as they go. They can help drivers find the right packages inside their delivery vans, give them turn-by-turn directions to the right address, and take a hands-free photo of a successful delivery instead of needing them to whip out a phone. (Ever had an Amazon driver tell you, “Please don’t take your package yet, I have to take a pic first?”) “If there are hazards, or a need to navigate complex environments like apartment buildings, the glasses will guide [drivers] safely to their destination,” Amazon claims, showing off mocked-up video clips of what drivers should see as they work. Source: www.theverge.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "consumer:sonic rumble is coming out november 5:2025-10-22T16:00:31.000Z",
    "title": "Sonic Rumble is coming out November 5",
    "url": "https://www.engadget.com/gaming/pc/sonic-rumble-is-coming-out-november-5-160031039.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2025-10-22T16:00:31.000Z",
    "summary_long": "Sonic Rumble has a new worldwide launch date: November 5. The game, which we've previously likened to Fall Guys, was supposed to come out last winter before its release was rescheduled for May 8 this year. By the end of April, however, Sega announced that its global launch had been postponed yet again because its developers needed more time to \"build the kind of high-quality, long-lasting Sonic game [their] players deserve.\" At the time, the company said it had blasted past its goal of 1.4 million pre-registrations and that it had received \"amazing positive response\" from players in pre-launch regions. Players who pre-register will receive bonuses when the game launches globally. Source: www.engadget.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:matrixfree least squares solvers values gradients and what t:2025-10-22T14:31:51.000Z",
    "title": "Matrix-Free Least Squares Solvers: Values, Gradients, and What to Do With Them",
    "url": "http://arxiv.org/abs/2510.19634v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Hrittik Roy",
    "published_at": "2025-10-22T14:31:51.000Z",
    "summary_long": "This paper argues that the method of least squares has significant unfulfilled potential in modern machine learning, far beyond merely being a tool for fitting linear models. To release its potential, we derive custom gradients that transform the solver into a differentiable operator, like a neural network layer, enabling many diverse applications. Empirically, we demonstrate: (i) scalability by enforcing weight sparsity on a 50 million parameter model; (ii) imposing conservativeness constraints in score-based generative models; and (iii) hyperparameter tuning of Gaussian processes based on predictive performance. By doing this, our work represents the next iteration in developing differentiable linear-algebra tools and making them widely accessible to machine learning practitioners. Source: arxiv.org. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:ai in south koreaopenais economic blueprint:2025-10-23T00:00:00.000Z",
    "title": "AI in South Korea—OpenAI’s Economic Blueprint",
    "url": "https://openai.com/index/south-korea-economic-blueprint",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2025-10-23T00:00:00.000Z",
    "summary_long": "AI in South Korea—OpenAI’s Economic Blueprint Source: openai.com. Date: 2025-10-23. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:picobanana400k a largescale dataset for textguided image edi:2025-10-22T17:43:15.000Z",
    "title": "Pico-Banana-400K: A Large-Scale Dataset for Text-Guided Image Editing",
    "url": "http://arxiv.org/abs/2510.19808v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yusu Qian",
    "published_at": "2025-10-22T17:43:15.000Z",
    "summary_long": "Recent advances in multimodal models have demonstrated remarkable text-guided image editing capabilities, with systems like GPT-4o and Nano-Banana setting new benchmarks. However, the research community's progress remains constrained by the absence of large-scale, high-quality, and openly accessible datasets built from real images. We introduce Pico-Banana-400K, a comprehensive 400K-image dataset for instruction-based image editing. Our dataset is constructed by leveraging Nano-Banana to generate diverse edit pairs from real photographs in the OpenImages collection. Source: arxiv.org. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:no man skys latest update let you explore a space wreck:2025-10-22T16:40:42.000Z",
    "title": "No Man Sky's latest update let you explore a space wreck",
    "url": "https://www.engadget.com/gaming/no-man-skys-latest-update-let-you-explore-a-space-wreck-164042151.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2025-10-22T16:40:42.000Z",
    "summary_long": "One of the greatest comeback stories in the history of video games just keeps writing itself new chapters. If you’ve checked in on the wildly ambitious space sim, No Man’s Sky, in the last few years then you’ll know just how much UK-based developer Hello Games has turned things around for a game that was once the subject of a false advertising investigation. And its latest update introduces fully explorable space wrecks. The follow-up to August’s substantial Voyagers expansion, the new Breach update adds floating wrecks that you're invited to salvage to your heart’s content. Source: www.engadget.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:bananaselling robots pitch customers in test run in chicago :2025-10-22T16:32:04.000Z",
    "title": "Banana-selling robots pitch customers in test run in Chicago suburbs",
    "url": "https://techxplore.com/news/2025-10-banana-robots-pitch-customers-chicago.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-22T16:32:04.000Z",
    "summary_long": "Banana-selling robots pitch customers in test run in Chicago suburbs Source: techxplore.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:kraken revenue more than doubled in q3 as company preps for :2025-10-22T15:41:18.000Z",
    "title": "Kraken Revenue More Than Doubled in Q3 as Company Preps for Possible IPO",
    "url": "https://www.coindesk.com/business/2025/10/22/kraken-revenue-more-than-doubled-in-q3-as-company-preps-for-possible-ipo",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-10-22T15:41:18.000Z",
    "summary_long": "Kraken Revenue More Than Doubled in Q3 as Company Preps for Possible IPO Source: www.coindesk.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:inveniam capital partners acquires storj to advance decentra:2025-10-22T15:29:56.000Z",
    "title": "Inveniam Capital Partners Acquires Storj to Advance Decentralized Data Infrastructure",
    "url": "https://www.coindesk.com/business/2025/10/22/inveniam-capital-partners-acquires-storj-to-advance-decentralized-data-infrastructure",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-10-22T15:29:56.000Z",
    "summary_long": "Inveniam Capital Partners Acquires Storj to Advance Decentralized Data Infrastructure Source: www.coindesk.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:toyotas new allhybrid rav4 has software you might actually w:2025-10-22T14:00:00.000Z",
    "title": "Toyota's new all-hybrid RAV4 has software you might actually want to use",
    "url": "https://www.engadget.com/transportation/evs/toyotas-new-all-hybrid-rav4-has-software-you-might-actually-want-to-use-140000442.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-22T14:00:00.000Z",
    "summary_long": "If I had a dollar for every time a vehicle manufacturer launched a new in-car software experience designed to achieve the same levels of user experience as your average tablet or smartphone, I'd probably have about enough cash for a decent lunch at a middling restaurant. It's a common refrain, and yet after years of hearing that same story over and over, I still find myself firing up Android Auto or Apple CarPlay as soon as I get into just about every new car I evaluate. At the launch of the 2026 Toyota RAV4, I heard that story yet again, about how they'd rewritten their in-car software to deliver an experience like that found in modern mobile devices. And I have to say, for once, they might have actually delivered. Source: www.engadget.com. Date: 2025-10-22. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]