[
  {
    "id": "bigtech:many bluetooth devices with google fast pair vulnerable to w:2026-01-15T17:46:40.000Z",
    "title": "Many Bluetooth devices with Google Fast Pair vulnerable to “WhisperPair” hack",
    "url": "https://arstechnica.com/gadgets/2026/01/researchers-reveal-whisperpair-attack-to-eavesdrop-on-google-fast-pair-headphones/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2026-01-15T17:46:40.000Z",
    "summary_long": "Pairing Bluetooth devices can be a pain, but Google Fast Pair makes it almost seamless. Unfortunately, it may also leave your headphones vulnerable to remote hacking. A team of security researchers from Belgium’s KU Leuven University has revealed a vulnerability dubbed WhisperPair that allows an attacker to hijack Fast Pair-enabled devices to spy on the owner. Fast Pair is widely used, and your device may be vulnerable even if you've never used a Google product. Source: arstechnica.com. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:bully online mod taken down abruptly one month after launch:2026-01-15T16:23:14.000Z",
    "title": "Bully Online mod taken down abruptly one month after launch",
    "url": "https://arstechnica.com/gaming/2026/01/online-mod-for-rockstars-classic-bully-is-abruptly-taken-down-after-one-month/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kyle Orland\n                ",
    "published_at": "2026-01-15T16:23:14.000Z",
    "summary_long": "A PC mod that added online gameplay to Rockstar's 2006 school-exploration title Bully was abruptly taken down on Wednesday, roughly a month after it was first made available. While the specific reason for the \"Bully Online\" takedown hasn't been publicly discussed, a message posted by the developers to the project's now-defunct Discord server clarifies that \"this was not something we wanted.\" The Bully Online mod was spearheaded by Swegta, a Rockstar-focused YouTuber who formally announced the project in October as a mod that \"allows you and your friends to play minigames, role-play, compete in racing, fend off against NPCs, and much more.\" At the time of the announcement, Swegta said the mod was \"a project me and my team have been working on for a very long time\" and that early access in December would be limited to those who contributed at least $8 to a Ko-Fi account. When December actually rolled around, though, a message on Swegta.com (archived) suggested…",
    "tags": []
  },
  {
    "id": "bigtech:spotify raises its subscription prices in the us again:2026-01-15T14:32:12.000Z",
    "title": "Spotify raises its subscription prices in the US again",
    "url": "https://techcrunch.com/2026/01/15/spotify-raises-its-subscription-prices-in-the-u-s-again/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Ivan Mehta",
    "published_at": "2026-01-15T14:32:12.000Z",
    "summary_long": "Spotify raises its subscription prices in the US again Source: techcrunch.com. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:procedural fairness in multiagent bandits:2026-01-15T17:11:51.000Z",
    "title": "Procedural Fairness in Multi-Agent Bandits",
    "url": "https://arxiv.org/abs/2601.10600v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Joshua Caiata",
    "published_at": "2026-01-15T17:11:51.000Z",
    "summary_long": "In the context of multi-agent multi-armed bandits (MA-MAB), fairness is often reduced to outcomes: maximizing welfare, reducing inequality, or balancing utilities. However, evidence in psychology, economics, and Rawlsian theory suggests that fairness is also about process and who gets a say in the decisions being made. We introduce a new fairness objective, procedural fairness, which provides equal decision-making power for all agents, lies in the core, and provides for proportionality in outcomes. Empirical results confirm that fairness notions based on optimizing for outcomes sacrifice equal voice and representation, while the sacrifice in outcome-based fairness objectives (like equality and utilitarianism) is minimal under procedurally fair policies. Source: arxiv.org. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bank of america ceo says stablecoins could drain trillions i:2026-01-15T15:08:08.000Z",
    "title": "Bank of America CEO says stablecoins could drain trillions in bank deposits",
    "url": "https://www.coindesk.com/business/2026/01/15/bank-of-america-ceo-says-stablecoins-could-drain-trillions-in-bank-deposits",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Olivier Acuna",
    "published_at": "2026-01-15T15:08:08.000Z",
    "summary_long": "Bank of America CEO says stablecoins could drain trillions in bank deposits Source: www.coindesk.com. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:urban sociosemantic segmentation with visionlanguage reasoni:2026-01-15T15:00:36.000Z",
    "title": "Urban Socio-Semantic Segmentation with Vision-Language Reasoning",
    "url": "https://arxiv.org/abs/2601.10477v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yu Wang",
    "published_at": "2026-01-15T15:00:36.000Z",
    "summary_long": "As hubs of human activity, urban surfaces consist of a wealth of semantic entities. Segmenting these various entities from satellite imagery is crucial for a range of downstream applications. Current advanced segmentation models can reliably segment entities defined by physical attributes (e.g., buildings, water bodies) but still struggle with socially defined categories (e.g., schools, parks). In this work, we achieve socio-semantic segmentation by vision-language model reasoning. Source: arxiv.org. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:mentras first smart glasses are opensource and come with the:2026-01-15T15:00:21.000Z",
    "title": "Mentra’s first smart glasses are open-source and come with their own app store",
    "url": "https://www.engadget.com/wearables/mentras-first-smart-glasses-are-open-source-and-come-with-their-own-app-store-150021126.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-01-15T15:00:21.000Z",
    "summary_long": "Mentra will soon start shipping its first smart glasses, the Mentra Live. At first glance, there’s nothing obvious setting Mentra’s glasses apart from its more well-known competitors, but they come with their own dedicated app store, and employ an open-source OS with an SDK that developers have had access to since early 2025. Mentra says the MiniApp Store is the first app store of its nature for smart glasses, and it will be available to iOS and Android users through the Mentra app. It might be a bit of a reach to call it the smartphone-ification of smart glasses at this early stage, but that seems to be Mentra’s aim. Source: www.engadget.com. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:aibased system enables realtime detection of whip sounds in :2026-01-15T14:55:35.000Z",
    "title": "AI-based system enables real-time detection of whip sounds in horse racing",
    "url": "https://techxplore.com/news/2026-01-ai-based-enables-real-horse.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-01-15T14:55:35.000Z",
    "summary_long": "Regulations limit both the intensity and frequency of whip use during horse racing. Nevertheless, compliance is currently verified manually after each race. Researchers at University of Tsukuba have developed an innovative system combining high-resolution audio recording with artificial intelligence for automatic detection of whip sounds. The work is published in the journal Engineering Applications of Artificial Intelligence. Source: techxplore.com. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:molmo2 open weights and data for visionlanguage models with :2026-01-15T17:27:44.000Z",
    "title": "Molmo2: Open Weights and Data for Vision-Language Models with Video Understanding and Grounding",
    "url": "https://arxiv.org/abs/2601.10611v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Christopher Clark",
    "published_at": "2026-01-15T17:27:44.000Z",
    "summary_long": "Today's strongest video-language models (VLMs) remain proprietary. The strongest open-weight models either rely on synthetic data from proprietary VLMs, effectively distilling from them, or do not disclose their training data or recipe. As a result, the open-source community lacks the foundations needed to improve on the state-of-the-art video (and image) language models. Crucially, many downstream applications require more than just high-level video understanding; they require grounding -- either by pointing or by tracking in pixels. Source: arxiv.org. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:dtcc aiming to make all 14 million securities in its custody:2026-01-15T20:41:09.000Z",
    "title": "DTCC aiming to make all 1.4 million securities in its custody digitally eligible",
    "url": "https://www.coindesk.com/markets/2026/01/15/dtcc-says-it-aims-to-make-all-1-4-million-securities-in-its-custody-digitally-eligible",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2026-01-15T20:41:09.000Z",
    "summary_long": "DTCC aiming to make all 1.4 million securities in its custody digitally eligible Source: www.coindesk.com. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:how to claim verizons 20 credit for wednesdays service outag:2026-01-15T17:59:03.000Z",
    "title": "How to claim Verizon's $20 credit for Wednesday's service outage",
    "url": "https://www.engadget.com/mobile/how-to-claim-verizons-20-credit-for-wednesdays-service-outage-171909695.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2026-01-15T17:59:03.000Z",
    "summary_long": "Verizon is offering a very small mea culpa after Wednesday's massive outage, which drew more than 1.5 million reports on Downdetector and lasted hours. The carrier posted on X that it will offer a $20 credit, but customers must redeem it in the myVerizon app. \"This credit isn’t meant to make up for what happened. No credit really can,\" the company wrote. Source: www.engadget.com. Date: 2026-01-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:how aws reinvented the cloud:2026-01-16T08:40:00.000Z",
    "title": "How AWS re:Invented the cloud",
    "url": "https://stackoverflow.blog/2026/01/16/how-aws-re-invented-the-cloud/",
    "category_id": "code",
    "region": "Global",
    "source": "stackoverflow.blog",
    "author": "Phoebe Sajor",
    "published_at": "2026-01-16T08:40:00.000Z",
    "summary_long": "From the floor at AWS re:Invent, Ryan is joined by AWS Senior Principal Engineer David Yanacek to chat about all things AWS, from the truth behind AWS’s Black Friday origin mythos to the development of essential cloud tools like SQS and DynamoDB. Plus, how David envisions autonomous agents will ease developers' operational burdens. Source: stackoverflow.blog. Date: 2026-01-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]