[
  {
    "id": "bigtech:us cant deport hate speech researcher for protected speech l:2025-12-29T21:30:29.000Z",
    "title": "US can’t deport hate speech researcher for protected speech, lawsuit says",
    "url": "https://arstechnica.com/tech-policy/2025/12/us-cant-deport-hate-speech-researcher-for-protected-speech-lawsuit-says/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-12-29T21:30:29.000Z",
    "summary_long": "Imran Ahmed's biggest thorn in his side used to be Elon Musk, who made the hate speech researcher one of his earliest legal foes during his Twitter takeover. Now, it's the Trump administration, which planned to deport Ahmed, a legal permanent resident, just before Christmas. It would then ban him from returning to the United States, where he lives with his wife and young child, both US citizens. After suing US officials to block any attempted arrest or deportation, Ahmed was quickly granted a temporary restraining order on Christmas Day. Source: arstechnica.com. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:gog8217s steamalternative pc game store is leaving cd projek:2025-12-29T18:34:20.000Z",
    "title": "GOG&#8217;s Steam-alternative PC game store is leaving CD Projekt, staying DRM-free",
    "url": "https://www.theverge.com/news/850832/gog-cd-projekt-acquisition-steam",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Emma Roth",
    "published_at": "2025-12-29T18:34:20.000Z",
    "summary_long": "GOG is splitting from CD Projekt, the game company that launched the preservation-focused PC gaming marketplace in 2008. In an update on Monday, GOG announced that its co-founder, Michał Kiciński, has acquired the digital storefront and its online gaming platform GOG Galaxy from CD Projekt - which he also co-founded - for $25.2 million. The acquisition isn't changing anything about GOG's mission to keep games DRM-free, according to the announcement that says it's \"more central to GOG than ever:\" > GOG has always been built on strong values and clear principles. When Marcin Iwiński and Michał Kiciński first came up with the idea for GOG in 2 … Read the full story at The Verge. Source: www.theverge.com. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:leonardos wood charring method predates japanese practice:2025-12-29T19:30:47.000Z",
    "title": "Leonardo’s wood charring method predates Japanese practice",
    "url": "https://arstechnica.com/science/2025/12/did-one-line-in-a-leonardo-codex-anticipate-yakisugi/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jennifer Ouellette\n                ",
    "published_at": "2025-12-29T19:30:47.000Z",
    "summary_long": "Yakisugi is a Japanese architectural technique for charring the surface of wood. It has become quite popular in bioarchitecture because the carbonized layer protects the wood from water, fire, insects, and fungi, thereby prolonging the lifespan of the wood. Yakisugi techniques were first codified in written form in the 17th and 18th centuries. But it seems Italian Renaissance polymath Leonardo da Vinci wrote about the protective benefits of charring wood surfaces more than 100 years earlier, according to a paper published in Zenodo, an open repository for EU funded research. Source: arstechnica.com. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:the earth observer offering perspectives from space through :2025-12-29T23:52:34.000Z",
    "title": "The Earth Observer: Offering Perspectives from Space through Time",
    "url": "https://science.nasa.gov/science-research/earth-science/the-earth-observer-offering-perspectives-from-space-through-time/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-12-29T23:52:34.000Z",
    "summary_long": "Explore This Section * Earth * Earth Observer * Editor’s Corner * Feature Articles * Meeting Summaries * News * Science in the News * Calendars * In Memoriam * Announcements * More * Archives * Conference Schedules * Style Guide 39 min read THE EARTH OBSERVER: OFFERING PERSPECTIVES FROM SPACE THROUGH TIME An Intertwined History: The Earth Observer and EOS The Earth Observer, a newsletter issued for more than 36 years, will release its last online content at the close of 2025. This newsletter evolved in parallel with NASA’s Earth Observing System (EOS). It is almost impossible to speak of this newsletter without mentioning EOS. As The Earth Observer prepares its final publication, NASA also plans to shutter its three EOS flagship satellites (discussed below) possibly as early as the end of 2026. Source: science.nasa.gov. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:terra the end of an era:2025-12-29T22:20:01.000Z",
    "title": "Terra: The End of An Era",
    "url": "https://science.nasa.gov/science-research/earth-science/terra-the-end-of-an-era/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-12-29T22:20:01.000Z",
    "summary_long": "Explore This Section * Earth * Earth Observer * Editor’s Corner * Feature Articles * Meeting Summaries * News * Science in the News * Calendars * In Memoriam * Announcements * More * Archives * Conference Schedules * Style Guide 27 min read TERRA: THE END OF AN ERA Introduction Launched into the night sky nearly 26 years ago, on December 19, 1999, from Vandenberg Air Force Base (now Space Force Base), Terra was NASA’s first Earth Observing System (EOS) Flagship mission to study Earth’s land surface from space via a coordinated series of polar-orbiting and low-inclination satellites that produce long-term global observations useful for understanding the interactions between Earth’s atmosphere, land, snow and ice, oceans, and radiant energy balance. Scheduled for a six-year tour, Terra outlasted its life expectancy by nearly two decades. Despite its longevity, Terra’s mission scientists stopped making inclination adjustments in 2020, allowing the satellite to slowly drift out of its contained orbit. The mission…",
    "tags": []
  },
  {
    "id": "space:the final earth observer editors corner octoberdecember 2025:2025-12-29T22:08:25.000Z",
    "title": "The Final Earth Observer Editor’s Corner: October–December 2025",
    "url": "https://science.nasa.gov/science-research/earth-science/the-final-earth-observer-editors-corner-october-december-2025/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-12-29T22:08:25.000Z",
    "summary_long": "Explore This Section * Earth * Earth Observer * Editor’s Corner * Feature Articles * Meeting Summaries * News * Science in the News * Calendars * In Memoriam * Announcements * More * Archives * Conference Schedules * Style Guide 14 min read THE FINAL EARTH OBSERVER EDITOR’S CORNER: OCTOBER–DECEMBER 2025 It is with a heavy heart that I announce that NASA Earth Science Communications has directed The Earth Observer to conduct an orderly shutdown of the publication. No new content will be published after Dec. 31, 2025. While the sunset of The Earth Observer is bittersweet for our team, the good news is that all of the rich historical and descriptive content preserved on The Earth Observer’s archives page will remain accessible to the world. Source: science.nasa.gov. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:bugs that survive the heat of continuous fuzzing:2025-12-29T22:01:14.000Z",
    "title": "Bugs that survive the heat of continuous fuzzing",
    "url": "https://github.blog/security/vulnerability-research/bugs-that-survive-the-heat-of-continuous-fuzzing/",
    "category_id": "code",
    "region": "Global",
    "source": "github.blog",
    "author": "Antonio Morales",
    "published_at": "2025-12-29T22:01:14.000Z",
    "summary_long": "Even when a project has been intensively fuzzed for years, bugs can still survive. OSS-Fuzz is one of the most impactful security initiatives in open source. In collaboration with the OpenSSF Foundation, it has helped to find thousands of bugs in open-source software. Today, OSS-Fuzz fuzzes more than 1,300 open source projects at no cost to maintainers. Source: github.blog. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:the evolution of digital nomadism from hitech hacker spaces :2025-12-29T19:30:02.000Z",
    "title": "The evolution of digital nomadism: From hi-tech hacker spaces to crypto coworking",
    "url": "https://techxplore.com/news/2025-12-evolution-digital-nomadism-tech-hacker.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-29T19:30:02.000Z",
    "summary_long": "One of the first modern coworking spaces, C-Base in Berlin, was launched 30 years ago by a group of computer engineers as a \"hacker space\" in which to share their tech and techniques. Similarly, many of the people we first encountered in our anthropological research into the emerging world of digital nomadism in the mid-2010s were hackers and computer coders. Source: techxplore.com. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:nested browseruse learning for agentic information seeking:2025-12-29T17:59:14.000Z",
    "title": "Nested Browser-Use Learning for Agentic Information Seeking",
    "url": "https://arxiv.org/abs/2512.23647v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Baixuan Li",
    "published_at": "2025-12-29T17:59:14.000Z",
    "summary_long": "Information-seeking (IS) agents have achieved strong performance across a range of wide and deep search tasks, yet their tool use remains largely restricted to API-level snippet retrieval and URL-based page fetching, limiting access to the richer information available through real browsing. While full browser interaction could unlock deeper capabilities, its fine-grained control and verbose page content returns introduce substantial complexity for ReAct-style function-calling agents. To bridge this gap, we propose Nested Browser-Use Learning (NestBrowse), which introduces a minimal and complete browser-action framework that decouples interaction control from page exploration through a nested structure. This design simplifies agentic reasoning while enabling effective deep-web information acquisition. Source: arxiv.org. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:boad discovering hierarchical software engineering agents vi:2025-12-29T17:41:11.000Z",
    "title": "BOAD: Discovering Hierarchical Software Engineering Agents via Bandit Optimization",
    "url": "https://arxiv.org/abs/2512.23631v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Iris Xu",
    "published_at": "2025-12-29T17:41:11.000Z",
    "summary_long": "Large language models (LLMs) have shown strong reasoning and coding capabilities, yet they struggle to generalize to real-world software engineering (SWE) problems that are long-horizon and out of distribution. Existing systems often rely on a single agent to handle the entire workflow-interpreting issues, navigating large codebases, and implementing fixes-within one reasoning chain. Such monolithic designs force the model to retain irrelevant context, leading to spurious correlations and poor generalization. Motivated by how human engineers decompose complex problems, we propose structuring SWE agents as orchestrators coordinating specialized sub-agents for sub-tasks such as localization, editing, and validation. Source: arxiv.org. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:pathfound an agentic multimodal model activating evidencesee:2025-12-29T15:34:27.000Z",
    "title": "PathFound: An Agentic Multimodal Model Activating Evidence-seeking Pathological Diagnosis",
    "url": "https://arxiv.org/abs/2512.23545v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Shengyi Hua",
    "published_at": "2025-12-29T15:34:27.000Z",
    "summary_long": "Recent pathological foundation models have substantially advanced visual representation learning and multimodal interaction. However, most models still rely on a static inference paradigm in which whole-slide images are processed once to produce predictions, without reassessment or targeted evidence acquisition under ambiguous diagnoses. This contrasts with clinical diagnostic workflows that refine hypotheses through repeated slide observations and further examination requests. We propose PathFound, an agentic multimodal model designed to support evidence-seeking inference in pathological diagnosis. Source: arxiv.org. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:samsung plans to integrate google photos into its tvs:2025-12-29T13:27:39.000Z",
    "title": "Samsung plans to integrate Google Photos into its TVs",
    "url": "https://www.engadget.com/home/samsung-plans-to-integrate-google-photos-into-its-tvs-132739713.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-12-29T13:27:39.000Z",
    "summary_long": "Samsung has announced that it \"aims to be the first\" to natively integrate Google Photos into TVs. The aim is for Google Photos to work seamlessly with Vision AI Companion, Samsung's souped-up version of Bixby. This would help to make user photos part of the day-to-day TV experience, with photos appearing while navigating the TV's OS during \"contextual and convenient moments.\" The company says users will be able to explore their Google Photos libraries in three new experiences. The first is called Memories, and will show curated stories based on \"people, locations and meaningful moments.\" This has a planned launch in March 2026 and will be exclusive to Samsung TVs for six months. Source: www.engadget.com. Date: 2025-12-29. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]