[
  {
    "id": "bigtech:intel launches core ultra series 3 cpus made using its longa:2026-01-06T03:45:49.000Z",
    "title": "Intel launches Core Ultra Series 3 CPUs, made using its long-awaited 18A process",
    "url": "https://arstechnica.com/gadgets/2026/01/intel-launches-core-ultra-series-3-cpus-made-using-its-long-awaited-18a-process/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-01-06T03:45:49.000Z",
    "summary_long": "Intel will formally launch its first Core Ultra Series 3 laptop processors later this month, the company announced at its CES keynote today. Codenamed Panther Lake and targeted, at least for now, at high-end ultraportable PCs, the Core Ultra 3 chips will also be the first to use Intel's 18A manufacturing process, the company's effort to catch up with the chip manufacturing technology of Taiwan Semiconductor (TSMC). The launch will start with 14 chips across 5 product families, which Intel says will be used in \"over 200\" PC designs. The first of these will be available on January 27th, with others following \"throughout the first half of this year.\" * The Core Ultra X9 and Core Ultra X7 processors include all of Intel's latest CPU and GPU architectures, plus a fully-enabled 12-core Intel Arc B390 integrated GPU and support for slightly faster LPDDR5x-9600. Source: arstechnica.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:amd reheats last years ryzen ai and x3d cpus for 2026s lapto:2026-01-06T03:30:30.000Z",
    "title": "AMD reheats last year’s Ryzen AI and X3D CPUs for 2026’s laptops and desktops",
    "url": "https://arstechnica.com/gadgets/2026/01/amd-reheats-last-years-ryzen-ai-and-x3d-cpus-for-2026s-laptops-and-desktops/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Andrew Cunningham\n                ",
    "published_at": "2026-01-06T03:30:30.000Z",
    "summary_long": "Intel, AMD, Nvidia, and other chip companies usually have some kind of news to announce at CES to kick off the year, but some of those announcements are more interesting than others. Sometimes you see new chips with significant speed boosts and other new technologies, and sometimes you get rebranded versions of old silicon meant to fill out a lineup or make an existing architecture seem newer and more exciting than it is. AMD's Ryzen CPU announcements this year fall firmly into the latter camp—these are all gently tweaked variants of chips that launched in 2024 and 2025. \"NEW,\" FOR CERTAIN VALUES OF \"NEW\" Let's start with the Ryzen AI 400 series. Source: arstechnica.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:nasas science budget wont be a train wreck after all:2026-01-05T22:14:50.000Z",
    "title": "NASA’s science budget won’t be a train wreck after all",
    "url": "https://arstechnica.com/space/2026/01/nasas-science-budget-wont-be-a-train-wreck-after-all/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2026-01-05T22:14:50.000Z",
    "summary_long": "In June, the White House released a budget proposal for fiscal year 2026 that slashed funding for NASA's science programs by nearly 50 percent. Then, in July, the Trump administration began telling the leaders of dozens of space science missions to prepare \"closeout\" plans for their spacecraft. Things looked pretty grim for a while, but then Congress stepped in. Congress, of course, sets the federal government's budget. Source: arstechnica.com. Date: 2026-01-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:poseidon physicsoptimized seismic energy inference and detec:2026-01-05T16:46:34.000Z",
    "title": "POSEIDON: Physics-Optimized Seismic Energy Inference and Detection Operating Network",
    "url": "https://arxiv.org/abs/2601.02264v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Boris Kriuk",
    "published_at": "2026-01-05T16:46:34.000Z",
    "summary_long": "Earthquake prediction and seismic hazard assessment remain fundamental challenges in geophysics, with existing machine learning approaches often operating as black boxes that ignore established physical laws. We introduce POSEIDON (Physics-Optimized Seismic Energy Inference and Detection Operating Network), a physics-informed energy-based model for unified multi-task seismic event prediction, alongside the Poseidon dataset -- the largest open-source global earthquake catalog comprising 2.8 million events spanning 30 years. POSEIDON embeds fundamental seismological principles, including the Gutenberg-Richter magnitude-frequency relationship and Omori-Utsu aftershock decay law, as learnable constraints within an energy-based modeling framework. The architecture simultaneously addresses three interconnected prediction tasks: aftershock sequence identification, tsunami generation potential, and foreshock detection. Source: arxiv.org. Date: 2026-01-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:naoxs wireless earbuds have a builtin eeg to monitor your br:2026-01-06T03:00:00.000Z",
    "title": "NAOX's wireless earbuds have a built-in EEG to monitor your brain health",
    "url": "https://www.engadget.com/wearables/naoxs-wireless-earbuds-have-a-built-in-eeg-to-monitor-your-brain-health-030000605.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Daniel Cooper",
    "published_at": "2026-01-06T03:00:00.000Z",
    "summary_long": "French startup NAOX is at CES with a groundbreaking wearable EEG for clinics and research, but that’s not what we’re interested in today. Because it’s also here showing off a prototype of the consumer version, which incorporates its brain-scanning technology in wireless earbuds. As early as the end of this year, your earbuds could pull double-duty, pumping out tunes and keeping an eye on your brain’s health. The product being released today is the NAOX Link NX01, an in-ear EEG designed to replace the wire-covered caps you’ve seen at a sleep clinic. Source: www.engadget.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:heterogeneous lowbandwidth pretraining of llms:2026-01-05T18:59:57.000Z",
    "title": "Heterogeneous Low-Bandwidth Pre-Training of LLMs",
    "url": "https://arxiv.org/abs/2601.02360v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yazan Obeidi",
    "published_at": "2026-01-05T18:59:57.000Z",
    "summary_long": "Pre-training large language models (LLMs) increasingly requires distributed compute, yet bandwidth constraints make it difficult to scale beyond well-provisioned datacenters-especially when model parallelism forces frequent, large inter-device communications. We study whether SparseLoCo, a low-communication data parallel method based on infrequent synchronization and sparse pseudo-gradient exchange, can be combined with low-bandwidth pipeline model parallelism via activation and activation-gradient compression. We introduce a heterogeneous distributed training framework where some participants host full replicas on high-bandwidth interconnects, while resource-limited participants are grouped to jointly instantiate a replica using pipeline parallelism with subspace-projected inter-stage communication. To make the recently introduced subspace pipeline compression compatible with SparseLoCo, we study a number of adaptations. Source: arxiv.org. Date: 2026-01-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:dept of the air force opens bidding for space launch complex:2026-01-06T01:26:23.000Z",
    "title": "Dept. of the Air Force opens bidding for Space Launch Complex 14 at Vandenberg SFB",
    "url": "https://spaceflightnow.com/2026/01/06/dept-of-the-air-force-opens-bidding-for-space-launch-complex-14-at-vandenberg-sfb/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-01-06T01:26:23.000Z",
    "summary_long": "A new orbital launch site is up for grabs at Vandenberg Space Force Base (VSFB) in California. On Monday, the Department of the Air Force published a new request for information from launch providers to determine the level of interest in what would become the southern most launch complex on the Western Range. The space, which will be designated as Space Launch Complex 14 or SLC-14, is being set aside for orbital rockets in a heavy or super-heavy vertical launch class. The government defines “heavy” as having payload capacity of between 20,000-50,000 kg (44,092-110,231 lbs) and “super-heavy” anything greater than 50,000 kg. Source: spaceflightnow.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:ces 2026 intel hopes its core ultra series 3 chips are the s:2026-01-06T00:01:55.000Z",
    "title": "CES 2026: Intel hopes its Core Ultra Series 3 chips are the start of a comeback",
    "url": "https://www.engadget.com/computing/ces-2026-intel-hopes-its-core-ultra-series-3-chips-are-the-start-of-a-comeback-000155611.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Daniel Cooper",
    "published_at": "2026-01-06T00:01:55.000Z",
    "summary_long": "Intel turned up to CES 2026 to herald the birth of the Core Ultra Series 3, a new range of chips offering “exceptional performance.” It says the mobile processors, formerly known as Panther Lake, deliver great graphics and battery life alongside the aforementioned grunt. And that, for the first time, the silicon has been certified for embedded and industrial use cases, including robotics and smart cities. But, like so many stories about Intel these days, the launch is loaded with so much subtext you’ll need a copy of Cliffs Notes to understand it. On the face of it, these are just some snappy flagship chips, available in Core Ultra 7 and 9 ranges as well as Core X7 and X9, which ship with 12 Xe graphics cores over the usual four. Source: www.engadget.com. Date: 2026-01-06. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:vibe visual instruction based editor:2026-01-05T16:17:20.000Z",
    "title": "VIBE: Visual Instruction Based Editor",
    "url": "https://arxiv.org/abs/2601.02242v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Grigorii Alekseenko",
    "published_at": "2026-01-05T16:17:20.000Z",
    "summary_long": "Instruction-based image editing is among the fastest developing areas in generative AI. Over the past year, the field has reached a new level, with dozens of open-source models released alongside highly capable commercial systems. However, only a limited number of open-source approaches currently achieve real-world quality. In addition, diffusion backbones, the dominant choice for these pipelines, are often large and computationally expensive for many deployments and research settings, with widely used variants typically containing 6B to 20B parameters. Source: arxiv.org. Date: 2026-01-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:uber reveals the design of its robotaxi at ces 2026:2026-01-05T23:00:56.000Z",
    "title": "Uber reveals the design of its robotaxi at CES 2026",
    "url": "https://www.engadget.com/transportation/uber-reveals-the-design-of-its-robotaxi-at-ces-2026-230056302.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2026-01-05T23:00:56.000Z",
    "summary_long": "Waymo is getting a good look at the competition as Uber revealed the design of its robotaxi that's due to launch in San Francisco later this year. The upcoming robotaxi is a result of a partnership announced in July between Uber, Lucid and Nuro. The plan is still to deploy at least 20,000 Lucid EVs that will use the Nuro Driver autonomous driving tech and be available through the Uber platform. It's important to note that the robotaxi reveal will be a \"production intent design,\" so there may be some modifications to the version that will eventually hit the streets. Source: www.engadget.com. Date: 2026-01-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:5 tips to craft a standout nasa internship application:2026-01-05T17:01:54.000Z",
    "title": "5 Tips to Craft a Standout NASA Internship Application",
    "url": "https://www.nasa.gov/learning-resources/tips-to-craft-standout-internship-application/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Sandra May",
    "published_at": "2026-01-05T17:01:54.000Z",
    "summary_long": "3 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) Four NASA interns pose in front of the NASA Pavilion at the EAA AirVenture Oshkosh, an annual airshow in Oshkosh, Wisconsin. NASA A NASA internship provides a stellar opportunity to launch your future as part of America’s aerospace workforce. NASA interns take on meaningful work and contribute to exciting agency projects with the guidance of a supportive mentor. The agency’s internship program regularly ranks as the nation’s most prestigious and competition is steep: in fiscal year 2025, NASA’s Office of STEM Engagement received about 250,000 internship applications for its roughly 1,800 internship opportunities. Source: www.nasa.gov. Date: 2026-01-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:scientific balloon begins antarctic ascent:2026-01-05T16:40:28.000Z",
    "title": "Scientific Balloon Begins Antarctic Ascent",
    "url": "https://www.nasa.gov/image-article/scientific-balloon-begins-antarctic-ascent/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2026-01-05T16:40:28.000Z",
    "summary_long": "NASA/Scott Battaion A scientific balloon starts its ascent into the air as it prepares to launch carrying NASA’s Payload for Ultrahigh Energy Observations (PUEO) mission. The mission lifted off from Antarctica at 5:56 a.m. NZST, Saturday, Dec. 20 (11:56 a.m., Friday, Dec. Source: www.nasa.gov. Date: 2026-01-05. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]