[
  {
    "id": "bigtech:chatgpt hyped up violent stalker who believed he was gods as:2025-12-04T18:40:36.000Z",
    "title": "ChatGPT hyped up violent stalker who believed he was “God’s assassin,” DOJ says",
    "url": "https://arstechnica.com/tech-policy/2025/12/chatgpt-hyped-up-violent-stalker-who-believed-he-was-gods-assassin-doj-says/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-12-04T18:40:36.000Z",
    "summary_long": "ChatGPT allegedly validated the worst impulses of a wannabe influencer accused of stalking more than 10 women at boutique gyms, where the chatbot supposedly claimed he’d meet the “wife type.” In a press release on Tuesday, the Department of Justice confirmed that 31-year-old Brett Michael Dadig currently remains in custody after being charged with cyberstalking, interstate stalking, and making interstate threats. He now faces a maximum sentence of up to 70 years in prison that could be coupled with “a fine of up to $3.5 million,” the DOJ said. The podcaster—who primarily posted about “his desire to find a wife and his interactions with women”—allegedly harassed and sometimes even doxxed his victims through his videos on platforms including Instagram, Spotify, and TikTok. Over time, his videos and podcasts documented his intense desire to start a family, which was frustrated by his “anger towards women,” whom he claimed were “all the same from fucking 18 to fucking 40 to fucking 90”…",
    "tags": []
  },
  {
    "id": "bigtech:in comedy of errors men accused of wiping gov databases turn:2025-12-04T21:51:36.000Z",
    "title": "In comedy of errors, men accused of wiping gov databases turned to an AI tool",
    "url": "https://arstechnica.com/information-technology/2025/12/previously-convicted-contractors-wiped-gov-databases-after-being-fired-feds-say/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dan Goodin\n                ",
    "published_at": "2025-12-04T21:51:36.000Z",
    "summary_long": "Two sibling contractors convicted a decade ago for hacking into US State Department systems have once again been charged, this time for a comically hamfisted attempt to steal and destroy government records just minutes after being fired from their contractor jobs. The Department of Justice on Thursday said that Muneeb Akhter and Sohaib Akhter, both 34, of Alexandria, Virginia, deleted databases and documents maintained and belonging to three government agencies. The brothers were federal contractors working for an undisclosed company in Washington, DC, that provides software and services to 45 US agencies. Prosecutors said the men coordinated the crimes and began carrying them out just minutes after being fired. Source: arstechnica.com. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:engineer proves that kohlers smart toilet cameras arent very:2025-12-04T21:23:40.000Z",
    "title": "Engineer proves that Kohler’s smart toilet cameras aren’t very private",
    "url": "https://arstechnica.com/gadgets/2025/12/despite-accessing-user-data-kohler-still-says-its-smart-toilet-cameras-use-e2ee/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Scharon Harding\n                ",
    "published_at": "2025-12-04T21:23:40.000Z",
    "summary_long": "Kohler is facing backlash after an engineer pointed out that the company’s new smart toilet cameras may not be as private as it wants people to believe. The discussion raises questions about Kohler’s use of the term “end-to-end encryption” (E2EE) and the inherent privacy limitations of a device that films the goings-on of a toilet bowl. In October, Kohler announced its first “health” product, the Dekoda. Kohler’s announcement described the $599 device (it also requires a subscription that starts at $7 per month) as a toilet bowl attachment that uses “optical sensors and validated machine-learning algorithms” to deliver “valuable insights into your health and wellness.” The announcement added: > Data flows to the personalized Kohler Health app, giving users continuous, private awareness of key health and wellness indicators—right on their phone. Source: arstechnica.com. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:uk fines porn company 1 million for weak age checks:2025-12-04T13:00:56.000Z",
    "title": "UK fines porn company £1 million for weak age checks",
    "url": "https://www.engadget.com/general/uk-fines-porn-company-%C2%A31-million-for-weak-age-checks-130056578.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Steve Dent",
    "published_at": "2025-12-04T13:00:56.000Z",
    "summary_long": "The UK has fined a porn operator called AVS Group £1 million ($1.33 million) for failing to have strong enough age checks, regulator Ofcom announced. The company which was also hit with an additional £50,000 fine for its failure to respond to information request and now has 72 hours to introduce effective age checks or face a further penalty of £1,000 a day. In July, the UK government announced it would start checking compliance by websites that publish or display pornographic content to implement a system for \"highly effective age checks.\" Methods approved by Ofcom include credit card checks, photo ID matching and even estimating a user's age with a provided selfie. However, users have been circumventing the age checks via methods like using a VPN and providing a fake ChatGPT-generated photo ID. Source: www.engadget.com. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:are your agents upward deceivers:2025-12-04T14:47:05.000Z",
    "title": "Are Your Agents Upward Deceivers?",
    "url": "https://arxiv.org/abs/2512.04864v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Dadi Guo",
    "published_at": "2025-12-04T14:47:05.000Z",
    "summary_long": "Large Language Model (LLM)-based agents are increasingly used as autonomous subordinates that carry out tasks for users. This raises the question of whether they may also engage in deception, similar to how individuals in human organizations lie to superiors to create a good image or avoid punishment. We observe and define agentic upward deception, a phenomenon in which an agent facing environmental constraints conceals its failure and performs actions that were not requested without reporting. To assess its prevalence, we construct a benchmark of 200 tasks covering five task types and eight realistic scenarios in a constrained environment, such as broken tools or mismatched information sources. Source: arxiv.org. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:unwrapdiff conditional diffusion for robust insar phase unwr:2025-12-04T12:38:00.000Z",
    "title": "UnwrapDiff: Conditional Diffusion for Robust InSAR Phase Unwrapping",
    "url": "https://arxiv.org/abs/2512.04749v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Yijia Song",
    "published_at": "2025-12-04T12:38:00.000Z",
    "summary_long": "Phase unwrapping is a fundamental problem in InSAR data processing, supporting geophysical applications such as deformation monitoring and hazard assessment. Its reliability is limited by noise and decorrelation in radar acquisitions, which makes accurate reconstruction of the deformation signal challenging. We propose a denoising diffusion probabilistic model (DDPM)-based framework for InSAR phase unwrapping, UnwrapDiff, in which the output of the traditional minimum cost flow algorithm (SNAPHU) is incorporated as conditional guidance. To evaluate robustness, we construct a synthetic dataset that incorporates atmospheric effects and diverse noise patterns, representative of realistic InSAR observations. Source: arxiv.org. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:russia reportedly bans snapchat and facetime:2025-12-04T19:49:06.000Z",
    "title": "Russia reportedly bans Snapchat and FaceTime",
    "url": "https://www.engadget.com/apps/russia-reportedly-bans-snapchat-and-facetime-194906404.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-12-04T19:49:06.000Z",
    "summary_long": "Roskomnadzor, Russia's federal agency for monitoring and censoring mass media, has blocked access to Snapchat and FaceTime in the country, Bloomberg reports, citing Russian news service Interfax. The bans were reportedly put in place because the platforms were used \"to organize and carry out terrorist acts,” and commit fraud. It's not clear if either service is still accessible by using a VPN, but banning Snapchat and FaceTime fits with Russia’s crackdown on communication and social platforms that started after the country’s invasion of Ukraine in 2022. Facebook and X were blocked in March of that year, and Instagram was added to the ban list not long after. Source: www.engadget.com. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:eu hits meta with antitrust probe over whatsapp ai features:2025-12-04T19:20:04.000Z",
    "title": "EU hits Meta with antitrust probe over WhatsApp AI features",
    "url": "https://techxplore.com/news/2025-12-eu-meta-antitrust-probe-whatsapp.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-12-04T19:20:04.000Z",
    "summary_long": "EU hits Meta with antitrust probe over WhatsApp AI features Source: techxplore.com. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:introducing openai for australia:2025-12-04T19:00:00.000Z",
    "title": "Introducing OpenAI for Australia",
    "url": "https://openai.com/global-affairs/openai-for-australia",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2025-12-04T19:00:00.000Z",
    "summary_long": "Introducing OpenAI for Australia Source: openai.com. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex launches 28 starlink satellites on falcon 9 rocket fr:2025-12-04T17:05:59.000Z",
    "title": "SpaceX launches 28 Starlink satellites on Falcon 9 rocket from Vandengerg SFB",
    "url": "https://spaceflightnow.com/2025/12/04/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-vandengerg-sfb/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-12-04T17:05:59.000Z",
    "summary_long": "SpaceX launches 28 Starlink satellites on Falcon 9 rocket from Vandengerg SFB Source: spaceflightnow.com. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:when data relate to us:2025-12-04T16:20:45.000Z",
    "title": "When data relate to us?",
    "url": "https://edri.org/our-work/when-data-relate-to-us/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2025-12-04T16:20:45.000Z",
    "summary_long": "The EDPS vs. Single Resolution Board judgment goes to the heart of the EU’s fundamental right to data protection, shaping how artificial intelligence, data spaces and so-called privacy-enhancing technologies (PETs) will be governed in practice. The ruling of the Court of Justice of the European Union (CJEU) arrives at a crucial time to reiterate what counts as personal data, reinforcing the importance of the protection that the GDPR was designed to guarantee. The post When data relate to us? Source: edri.org. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa software raises bar for aircraft icing research:2025-12-04T15:00:00.000Z",
    "title": "NASA Software Raises Bar for Aircraft Icing Research",
    "url": "https://www.nasa.gov/general/nasa-software-raises-bar-for-aircraft-icing-research/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Heather Roe",
    "published_at": "2025-12-04T15:00:00.000Z",
    "summary_long": "4 min read PREPARATIONS FOR NEXT MOONWALK SIMULATIONS UNDERWAY (AND UNDERWATER) Researchers at NASA’s Glenn Research Center in Cleveland used the Glenn Icing Computational Environment (GlennICE) software to create 3D computational models of this advanced air mobility rotor and study propeller icing issues. The physical model of this rotor was installed and tested in the Icing Research Tunnel in 2023 as part of an icing evaluation study, which also sought to validate the computational models. Credit: NASA/Jordan Cochran When flying in certain weather conditions, tiny freezing water droplets floating in the air can pose a risk to aircraft. If not taken into consideration, these water droplets can accumulate on an aircraft as ice and pose a safety risk. Source: www.nasa.gov. Date: 2025-12-04. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]