[
  {
    "id": "bigtech:a record supply load wont reach the international space stat:2025-09-16T23:13:28.000Z",
    "title": "A record supply load won’t reach the International Space Station as scheduled",
    "url": "https://arstechnica.com/space/2025/09/a-record-supply-load-wont-reach-the-international-space-station-as-scheduled/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-09-16T23:13:28.000Z",
    "summary_long": "A problem with the main engine on Northrop Grumman's Cygnus XL spacecraft will keep it from delivering 11,000 pounds of supplies and experiments to the International Space Station as scheduled on Wednesday. In a statement released Tuesday afternoon, NASA said ground teams are evaluating backup plans that might still allow the Cygnus spacecraft to reach the space station, just not on schedule. The problem arose early Tuesday when the spacecraft's main engine shut down earlier than expected during two burns to boost the ship's orbit for its rendezvous with the ISS, according to NASA. Officials didn't release any other details about the engine problem, but all other systems on the Cygnus XL spacecraft are performing as designed, NASA said. Source: arstechnica.com. Date: 2025-09-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:icarus raises 61m to take on spaces warehouse work with embo:2025-09-17T13:00:00.000Z",
    "title": "Icarus raises $6.1M to take on space’s “warehouse work” with embodied-AI robots",
    "url": "https://techcrunch.com/2025/09/17/icarus-raises-6-1m-to-take-on-spaces-warehouse-work-with-embodied-ai-robots/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Aria Alamalhodaei",
    "published_at": "2025-09-17T13:00:00.000Z",
    "summary_long": "Icarus raises $6.1M to take on space’s “warehouse work” with embodied-AI robots Source: techcrunch.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:chatgpt may soon require id verification from adults ceo say:2025-09-16T20:09:22.000Z",
    "title": "ChatGPT may soon require ID verification from adults, CEO says",
    "url": "https://arstechnica.com/ai/2025/09/chatgpt-may-soon-require-id-verification-from-adults-ceo-says/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-09-16T20:09:22.000Z",
    "summary_long": "On Tuesday, OpenAI announced plans to develop an automated age-prediction system that will determine whether ChatGPT users are over or under 18, automatically directing younger users to a restricted version of the AI chatbot. The company also confirmed that parental controls will launch by the end of September. In a companion blog post, OpenAI CEO Sam Altman acknowledged the company is explicitly \"prioritizing safety ahead of privacy and freedom for teens,\" even though it means that adults may eventually need to verify their age to use a more unrestricted version of the service. \"In some cases or countries we may also ask for an ID,\" Altman wrote. Source: arstechnica.com. Date: 2025-09-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:mavryk network raises 10m for uae realestate tokenization pl:2025-09-17T14:26:00.000Z",
    "title": "Mavryk Network Raises $10M for UAE Real-Estate Tokenization Plans",
    "url": "https://www.coindesk.com/business/2025/09/17/mavryk-network-raises-usd10m-for-uae-real-estate-tokenization-plans",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jamie Crawley",
    "published_at": "2025-09-17T14:26:00.000Z",
    "summary_long": "Layer-1 network Mavryk said it raised $10 million in a strategic investment led by financial derivatives provider MultiBank Group to expand its real-world asset (RWA) tokenization plans. Mavryk Network and MultiBank have an existing partnership to tokenize over $10 billion worth of real estate in the United Arab Emirates through the latter's RWA platform. The two companies aim to broaden access to premium investments, such as real estate, according to an emailed announcement on Wednesday. The initiative is also supported by major digital asset custody provider Fireblocks, which provides the multiparty computation wallets that safeguard the tokenized assets on Mavryk's network. Source: www.coindesk.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:forward industries launches 4b atm offering to expand solana:2025-09-17T14:23:23.000Z",
    "title": "Forward Industries Launches $4B ATM Offering to Expand Solana Treasury",
    "url": "https://www.coindesk.com/business/2025/09/17/forward-industries-launches-usd4b-atm-offering-to-expand-solana-treasury",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-17T14:23:23.000Z",
    "summary_long": "Forward Industries (FORD), a publicly-traded design and manufacturing firm that’s building out a solana (SOL) treasury, has filed a $4 billion at-the-market (ATM) equity offering program with the SEC. The company will use any funds raised for working capital, business expansion and to bolster its SOL holdings, according to an announcement on Wednesday. The offering gives Forward a flexible way to sell new shares incrementally through Cantor Fitzgerald, the program’s designated agent. This step comes just weeks after Forward completed what it says was the largest Solana-focused treasury raise to date. Source: www.coindesk.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:house committee asks discord valve twitch and reddit to test:2025-09-17T18:41:00.000Z",
    "title": "House committee asks Discord, Valve, Twitch and Reddit to testify on online radicalization",
    "url": "https://www.engadget.com/social-media/house-committee-asks-discord-valve-twitch-and-reddit-to-testify-on-online-radicalization-184100470.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Ian Carlos Campbell",
    "published_at": "2025-09-17T18:41:00.000Z",
    "summary_long": "House Oversight and Government Reform Committee Chairman James Comer (R-KY) has asked the CEOs of Discord, Twitch, Valve and Reddit to testify at a hearing on online radicalization. The hearing will be held on October 8, 2025, and is in direct response to the assassination of political activist Charlie Kirk, an event some have tried to connect to the online communities the alleged shooter, Tyler Robinson, participated in. \"Congress has a duty to oversee the online platforms that radicals have used to advance political violence,\" Comer shared in the press release announcing the hearing. \"To prevent future radicalization and violence, the CEOs of Discord, Steam, Twitch, and Reddit must appear before the Oversight Committee and explain what actions they will take to ensure their platforms are not exploited for nefarious purposes.\" Following Kirk's death, law enforcement, regulators and the press have exerted significant effort to both understand Robinson's actions and structure them into a coherent narrative. Source: www.engadget.com. Date: 2025-09-17.",
    "tags": []
  },
  {
    "id": "fintech:fed cuts rates in risk management move as bitcoin eyes possi:2025-09-17T18:05:37.000Z",
    "title": "Fed Cuts Rates in 'Risk Management' Move as Bitcoin Eyes Possible Upside",
    "url": "https://www.coindesk.com/markets/2025/09/16/fed-cuts-fed-fund-rate-by-25-basis-points-in-first-reduction-since-december",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2025-09-17T18:05:37.000Z",
    "summary_long": "The Federal Reserve has returned to easing mode after ten months of taking a wait and see approach on the U.S. economy. In a widely expected move on Wednesday, the U.S. central bank cut its benchmark fed funds interest rate range by 25 basis points to 4%-4.25%, the lowest since December 2022, in what Fed chair Jerome Powell called a \"risk management cut.\" The Fed acknowledged that economic growth in the first half of the year \"moderated\" and the job market has \"slowed.\" This slowdown, Powell said during a press conference, is mostly due to changes in immigration. Source: www.coindesk.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa rideshares integrated ahead of launch:2025-09-17T17:28:55.000Z",
    "title": "NASA Rideshares Integrated Ahead of Launch",
    "url": "https://www.nasa.gov/image-article/nasa-rideshares-integrated-ahead-of-launch/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Elyna Niles-Carnes",
    "published_at": "2025-09-17T17:28:55.000Z",
    "summary_long": "Technicians completed integrating NASA’s Carruthers Geocorona Observatory and the National Oceanic and Atmospheric Administration’s (NOAA) Space Weather Follow-On Lagrange 1 (SWFO-L1) satellite to an Evolved Expendable Launch Vehicle Secondary Payload Adapter ring at the Astrotech Space Operations Facility near NASA’s Kennedy Space Center in Florida on Sept. 4. Integrating the rideshares to the ring precedes the next prelaunch launch milestone: attaching NASA’s IMAP (Interstellar Mapping and Acceleration Probe) heliosphere mapping observatory to a payload adapter that connects to the ring. This configuration allows all three spacecraft to launch atop a single SpaceX Falcon 9 rocket, maximizing efficiency by sharing the ride to space. Source: www.nasa.gov. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:one in three south africans have never heard of ai what this:2025-09-17T17:26:29.000Z",
    "title": "One in three South Africans have never heard of AI: What this means for policy",
    "url": "https://techxplore.com/news/2025-09-south-africans-heard-ai-policy.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-17T17:26:29.000Z",
    "summary_long": "Artificial intelligence or AI uses computers to perform tasks that would normally have needed human intelligence. Today AI is being put to use in many aspects of everyday life, like virtual banking assistants, health chatbots, self-driving cars, even the recommendations you see on social media. Source: techxplore.com. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasas imap mission to study boundaries of our home in space:2025-09-17T15:12:01.000Z",
    "title": "NASA’s IMAP Mission to Study Boundaries of Our Home in Space",
    "url": "https://science.nasa.gov/missions/nasas-imap-mission-to-study-boundaries-of-our-home-in-space/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2025-09-17T15:12:01.000Z",
    "summary_long": "6 min read NASA’S IMAP MISSION TO STUDY BOUNDARIES OF OUR HOME IN SPACE Summary * NASA’s new Interstellar Mapping and Acceleration Probe, or IMAP, will launch no earlier than Tuesday, Sept. 23 to study the heliosphere, a giant shield created by the Sun. * The mission will chart the heliosphere’s boundaries to help us better understand the protection it offers life on Earth and how it changes with the Sun’s activity. * The IMAP mission will also provide near real-time measurements of the solar wind, data that can be used to improve models predicting the impacts of space weather ranging from power-line disruptions to loss of satellites, to the health of voyaging astronauts. Source: science.nasa.gov. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:hacking electronic safes:2025-09-17T11:05:59.000Z",
    "title": "Hacking Electronic Safes",
    "url": "https://www.schneier.com/blog/archives/2025/09/hacking-electronic-safes.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2025-09-17T11:05:59.000Z",
    "summary_long": "Vulnerabilities in electronic safes that use Securam Prologic locks: > While both their techniques represent glaring security vulnerabilities, Omo says it’s the one that exploits a feature intended as a legitimate unlock method for locksmiths that’s the more widespread and dangerous. “This attack is something where, if you had a safe with this kind of lock, I could literally pull up the code right now with no specialized hardware, nothing,” Omo says. “All of a sudden, based on our testing, it seems like people can get into almost any Securam Prologic lock in the world.” > > […] > > Omo and Rowley say they informed Securam about both their safe-opening techniques in spring of last year, but have until now kept their existence secret because of legal threats from the company. “We will refer this matter to our counsel for trade libel if you choose the route of public announcement or disclosure,” a Securam representative wrote to the two…",
    "tags": []
  },
  {
    "id": "policy:why europes new tech laws have the world on edge:2025-09-17T09:01:03.000Z",
    "title": "Why Europe’s new tech laws have the world on edge",
    "url": "https://edri.org/our-work/why-europes-new-tech-laws-have-the-world-on-edge/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2025-09-17T09:01:03.000Z",
    "summary_long": "Trump and the global far-right are trying to discredit Europe’s tech laws with misinformation and political pressure, fearing that these regulations might disrupt their ability to undermine democracy. If Europe wants to safeguard its democracy and its credibility as a global regulatory leader in tech, the European Commission needs to enforce these laws swiftly and decisively. The post Why Europe’s new tech laws have the world on edge appeared first on European Digital Rights (EDRi). Source: edri.org. Date: 2025-09-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]