[
  {
    "id": "bigtech:bytedance backpedals after seedance 20 turned hollywood icon:2026-02-16T17:42:37.000Z",
    "title": "ByteDance backpedals after Seedance 2.0 turned Hollywood icons into AI “clip art”",
    "url": "https://arstechnica.com/tech-policy/2026/02/bytedance-backpedals-after-seedance-2-0-turned-hollywood-icons-into-ai-clip-art/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2026-02-16T17:42:37.000Z",
    "summary_long": "ByteDance says that it's rushing to add safeguards to block Seedance 2.0 from generating iconic characters and deepfaking celebrities, after substantial Hollywood backlash after launching the latest version of its AI video tool. The changes come after Disney and Paramount Skydance sent cease-and-desist letters to ByteDance urging the Chinese company to promptly end the allegedly vast and blatant infringement. Studios claimed the infringement was widescale and immediate, with Seedance 2.0 users across social media sharing AI videos featuring copyrighted characters like Spider-Man, Darth Vader, and SpongeBob Square Pants. In its letter, Disney fumed that Seedance was \"hijacking\" its characters, accusing ByteDance of treating Disney characters like they were \"free public domain clip art,\" Axios reported. Source: arstechnica.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:michigan antitrust lawsuit says oil companies hobbled evs an:2026-02-16T14:47:38.000Z",
    "title": "Michigan antitrust lawsuit says oil companies hobbled EVs and renewables",
    "url": "https://arstechnica.com/tech-policy/2026/02/michigan-accuses-oil-companies-of-antitrust-violations-in-climate-change-lawsuit/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Dana Drugman, Inside Climate News\n                ",
    "published_at": "2026-02-16T14:47:38.000Z",
    "summary_long": "Michigan is taking on major oil and gas companies in court, joining nearly a dozen other states that have brought climate-related lawsuits against ExxonMobil and its industry peers. But Michigan’s approach is different: accusing Big Oil not of deceiving consumers or misrepresenting climate change risks, but of driving up energy costs by colluding to suppress competition from cleaner and cheaper technologies like solar power and electric vehicles. The strategy is risky and might run into challenges, but it could potentially be a game changer if the state can overcome initial dismissal attempts by the industry defendants, legal experts say. Michigan Attorney General Dana Nessel filed the lawsuit last month in federal District Court against BP, Chevron, ExxonMobil, Shell and the American Petroleum Institute. Source: arstechnica.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:african defensetech terra industries founded by two gen zers:2026-02-16T08:01:00.000Z",
    "title": "African defensetech Terra Industries, founded by two Gen Zers, raises additional $22M in a month",
    "url": "https://techcrunch.com/2026/02/16/terra-industries-raises-22-million/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Dominic-Madori Davis",
    "published_at": "2026-02-16T08:01:00.000Z",
    "summary_long": "African defensetech Terra Industries, founded by two Gen Zers, raises additional $22M in a month Source: techcrunch.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:algorithmic simplification of neural networks with mosaicofm:2026-02-16T16:30:38.000Z",
    "title": "Algorithmic Simplification of Neural Networks with Mosaic-of-Motifs",
    "url": "https://arxiv.org/abs/2602.14896v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Pedram Bakhtiarifard",
    "published_at": "2026-02-16T16:30:38.000Z",
    "summary_long": "Large-scale deep learning models are well-suited for compression. Methods like pruning, quantization, and knowledge distillation have been used to achieve massive reductions in the number of model parameters, with marginal performance drops across a variety of architectures and tasks. This raises the central question: \\emph{Why are deep neural networks suited for compression?} In this work, we take up the perspective of algorithmic complexity to explain this behavior. We hypothesize that the parameters of trained models have more structure and, hence, exhibit lower algorithmic complexity compared to the weights at (random) initialization. Source: arxiv.org. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa to attempt second full fueling test of its space launch:2026-02-17T00:34:09.000Z",
    "title": "NASA to attempt second full fueling test of its Space Launch System rocket",
    "url": "https://spaceflightnow.com/2026/02/17/nasa-to-attempt-second-full-fueling-test-of-its-space-launch-system-rocket/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2026-02-17T00:34:09.000Z",
    "summary_long": "NASA will try again to fully load its Space Launch System rocket with more than 700,000 gallons of liquid hydrogen and liquid oxygen this week at the conclusion of a full launch countdown rehearsal. The operation, called a wet dress rehearsal or a WDR, will begin with a call to stations inside Firing Room 1 at the Launch Control Center at 6:40 p.m. EST (2340 UTC) on Tuesday, Feb. 17. Source: spaceflightnow.com. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:parameterminimal neural de solvers via horner polynomials:2026-02-16T13:29:38.000Z",
    "title": "Parameter-Minimal Neural DE Solvers via Horner Polynomials",
    "url": "https://arxiv.org/abs/2602.14737v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "T. Matulić",
    "published_at": "2026-02-16T13:29:38.000Z",
    "summary_long": "We propose a parameter-minimal neural architecture for solving differential equations by restricting the hypothesis class to Horner-factorized polynomials, yielding an implicit, differentiable trial solution with only a small set of learnable coefficients. Initial conditions are enforced exactly by construction by fixing the low-order polynomial degrees of freedom, so training focuses solely on matching the differential-equation residual at collocation points. To reduce approximation error without abandoning the low-parameter regime, we introduce a piecewise (\"spline-like\") extension that trains multiple small Horner models on subintervals while enforcing continuity (and first-derivative continuity) at segment boundaries. On illustrative ODE benchmarks and a heat-equation example, Horner networks with tens (or fewer) parameters accurately match the solution and its derivatives and outperform small MLP and sinusoidal-representation baselines under the same training settings, demonstrating a practical accuracy-parameter trade-off for resource-efficient scientific modeling. Source: arxiv.org. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:why zeroknowledge encryption may not stop password theft if :2026-02-16T16:10:02.000Z",
    "title": "Why 'zero-knowledge encryption' may not stop password theft if servers are hacked",
    "url": "https://techxplore.com/news/2026-02-knowledge-encryption-password-theft-servers.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-16T16:10:02.000Z",
    "summary_long": "Why 'zero-knowledge encryption' may not stop password theft if servers are hacked Source: techxplore.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:digital monitoring is growing in south africas public servic:2026-02-16T15:17:29.000Z",
    "title": "Digital monitoring is growing in South Africa's public service—regulation needs to catch up",
    "url": "https://techxplore.com/news/2026-02-digital-south-africa.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-16T15:17:29.000Z",
    "summary_long": "Government departments across South Africa are increasingly relying on digital tools to evaluate public programs and monitor performance. This is part of broader public-sector reforms. Their aims are to improve accountability, respond to audit pressure and manage large-scale programs with limited staff and budgets. Source: techxplore.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:bytedance promises to tighten up its new ai video generator :2026-02-16T11:29:41.000Z",
    "title": "ByteDance promises to tighten up its new AI video generator after viral Cruise vs. Pitt clip",
    "url": "https://www.engadget.com/ai/bytedance-promises-to-tighten-up-its-new-ai-video-generator-after-viral-cruise-vs-pitt-clip-112941384.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Sarah Fielding",
    "published_at": "2026-02-16T11:29:41.000Z",
    "summary_long": "ByteDance released Seedance 2.0 less than a week ago and enraged artists everywhere with a viral clip AI-generated clip of Tom Cruise and Brad Pitt fighting. Unsurprisingly, the AI video-making tool has reportedly already received multiple cease-and-desist letters around copyright infringement. Now, it appears ByteDance is going to curb the new media generator's use of prohibited content. In a statement to the BBC, ByteDance said, \"We are taking steps to strengthen current safeguards as we work to prevent the unauthorised use of intellectual property and likeness by users.\" It added that the company \"respects intellectual property rights and we have heard the concerns regarding Seedance 2.0.\" However, when pressed for more information on exactly how they would do this, ByteDance didn't respond. Source: www.engadget.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:from wall street to web3 this is cryptos year of integration:2026-02-16T15:00:00.000Z",
    "title": "From Wall Street to Web3: This is crypto’s year of integration, Silicon Valley Bank says",
    "url": "https://www.coindesk.com/business/2026/02/16/from-wall-street-to-web3-this-is-crypto-s-year-of-integration-silicon-valley-bank-says",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2026-02-16T15:00:00.000Z",
    "summary_long": "From Wall Street to Web3: This is crypto’s year of integration, Silicon Valley Bank says Source: www.coindesk.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:energysaving 5g features could cut carbon emissions across t:2026-02-16T13:52:47.000Z",
    "title": "Energy-saving 5G features could cut carbon emissions across the UK economy",
    "url": "https://techxplore.com/news/2026-02-energy-5g-features-carbon-emissions.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-16T13:52:47.000Z",
    "summary_long": "An optimal combination of energy-efficient 5G network features—including AI systems that let mobile mast and antenna base stations go into sleep mode when usage is low, and phones that avoid unnecessary background network checks—could help cut indirect carbon emissions across the U.K. economy by around 25 million metric tons of CO2, according to new research from the University of Surrey. Source: techxplore.com. Date: 2026-02-16. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "code:data is the new oil and your database is the only way to ext:2026-02-17T08:40:00.000Z",
    "title": "Data is the new oil, and your database is the only way to extract it",
    "url": "https://stackoverflow.blog/2026/02/17/data-is-the-new-oil/",
    "category_id": "code",
    "region": "Global",
    "source": "stackoverflow.blog",
    "author": "Phoebe Sajor",
    "published_at": "2026-02-17T08:40:00.000Z",
    "summary_long": "Ryan sits down with Shireesh Thota, CVP of Azure Databases at Microsoft, to discuss the evolution of databases at Microsoft; Azure’s comprehensive portfolio that includes SQL Server, CosmosDB, and Postgres; and the challenges that come with database architecture, from the importance of cost governance and multi-cloud strategies to the future of databases when it comes to AI. Source: stackoverflow.blog. Date: 2026-02-17. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]