[
  {
    "id": "bigtech:apple ups the reward for finding major exploits to 2 million:2025-10-11T11:15:22.000Z",
    "title": "Apple ups the reward for finding major exploits to $2 million",
    "url": "https://arstechnica.com/security/2025/10/apple-ups-the-reward-for-finding-major-exploits-to-2-million/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Lily Hay Newman, wired.com\n                ",
    "published_at": "2025-10-11T11:15:22.000Z",
    "summary_long": "Since launching its bug bounty program nearly a decade ago, Apple has always touted notable maximum payouts—$200,000 in 2016 and $1 million in 2019. Now the company is upping the stakes again. At the Hexacon offensive security conference in Paris on Friday, Apple vice president of security engineering and architecture Ivan Krstić announced a new maximum payout of $2 million for a chain of software exploits that could be abused for spyware. The move reflects how valuable exploitable vulnerabilities can be within Apple's highly protected mobile environment—and the lengths the company will go to to keep such discoveries from falling into the wrong hands. Source: arstechnica.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:fridays 20b crypto market meltdown a bitwise portfolio manag:2025-10-11T23:57:30.000Z",
    "title": "Friday’s $20B Crypto Market Meltdown: A Bitwise Portfolio Manager’s Postmortem Analysis",
    "url": "https://www.coindesk.com/markets/2025/10/12/friday-s-usd20b-crypto-market-meltdown-a-bitwise-portfolio-manager-s-postmortem-analysis",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-10-11T23:57:30.000Z",
    "summary_long": "Friday’s sell-off triggered what Bitwise portfolio manager Jonathan Man called the worst liquidation event in crypto history, with more than $20 billion wiped out as liquidity vanished and forced deleveraging took hold, in an article on X published Saturday. Perpetual futures — “perps” in trading shorthand — are cash-settled contracts with no expiry that mirror spot via funding payments, not delivery. Profits and losses net against a shared margin pool, which is why, in stress, venues may need to reallocate exposure quickly to keep books balanced. Man, who is the lead portfolio manager of the Bitwise Multi-Strategy Alpha Fund, said bitcoin fell 13% from peak to trough in a single hour, while losses in long-tail tokens were far steeper — he added that ATOM “fell to virtually zero” on some venues before rebounding. Source: www.coindesk.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:is the coros nomad really an adventure watch:2025-10-11T12:00:00.000Z",
    "title": "Is the Coros Nomad really an adventure watch?",
    "url": "https://www.theverge.com/tech/798613/coros-nomad-thru-hike-rucking",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Elizabeth Lopatto",
    "published_at": "2025-10-11T12:00:00.000Z",
    "summary_long": "Coros' Nomad is marketed as a \"go-anywhere, do-anything\" adventure watch. It's got GPS and offline maps and will track a lot of activities, from yoga to bouldering. There's an \"Adventure Journal,\" which the marketing copy promises will help you record \"every step, catch, and summit.\" While it doesn't have some of the bells and whistles of a more expensive competitor like Garmin, it's a product seemingly aimed at campers, backpackers, and other outdoorsy types who aren't satisfied with something all-purpose like an Apple Watch. So when my colleague Victoria Song flagged the Nomad to me, I took Coros at its word - and, as The Verge's resident … Read the full story at The Verge. Source: www.theverge.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:coinbases upcoming amex card with btc cashback everything we:2025-10-11T18:57:55.000Z",
    "title": "Coinbase’s Upcoming Amex Card With BTC Cashback: Everything We Know So Far",
    "url": "https://www.coindesk.com/markets/2025/10/11/coinbase-s-upcoming-amex-card-with-btc-cashback-everything-we-know-so-far",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-10-11T18:57:55.000Z",
    "summary_long": "Coinbase is preparing to launch a new American Express credit card in the U.S. this fall, and everything about it — from the design to the rewards — seems tailored to bitcoin enthusiasts. A CARD BUILT AROUND BITCOIN’S ORIGIN STORY Unlike most crypto-linked cards, Coinbase’s upcoming product isn’t just about perks — it’s about symbolism. The card is etched with data from the Genesis Block, the very first block ever created on the Bitcoin network by pseudonymous inventor Satoshi Nakamoto on Jan. Source: www.coindesk.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:why doesnt cards against humanity print its game in the us i:2025-10-11T12:00:05.000Z",
    "title": "Why doesn’t Cards Against Humanity print its game in the US? It’s complicated.",
    "url": "https://arstechnica.com/culture/2025/10/why-doesnt-cards-against-humanity-print-its-game-in-the-us-its-complicated/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Nate Anderson\n                ",
    "published_at": "2025-10-11T12:00:05.000Z",
    "summary_long": "Cards Against Humanity (CAH) this week announced its newest stunt: a \"Cards Against Humanity Explains the Joke\" edition that ditches the game's rules and adds explanatory notes to each card in the box. This makes the project \"informational material\" rather than a \"game,\" and therefore CAH can avoid import tariffs. All profits from the one-off project will be donated to the American Library Association to fight censorship. While a clever way to stick it to Trump, this week's news did raise a question I've heard from several readers: If CAH is this upset about the whiplash-inducing tariff rates, which are added and then removed with almost no warning, why doesn't it print the game in the US? Source: arstechnica.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bitcoin is not an asset class says one of uks largest retail:2025-10-11T14:28:19.000Z",
    "title": "‘Bitcoin Is Not an Asset Class,’ Says One of UK’s Largest Retail Investment Platforms",
    "url": "https://www.coindesk.com/policy/2025/10/11/bitcoin-is-not-an-asset-class-says-one-of-uk-s-largest-retail-investment-platforms",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Siamak Masnavi",
    "published_at": "2025-10-11T14:28:19.000Z",
    "summary_long": "Hargreaves Lansdown, one of the UK’s largest retail investment platforms, has warned that bitcoin should not be treated as a core part of investment portfolios — even as it prepares to offer crypto products to clients for the first time. In a statement published on its website, the Bristol-based firm said bitcoin, despite its long-term price gains, “is not an asset class” and lacks the intrinsic characteristics that would justify including it in a portfolio for growth or income. Hargreaves Lansdown argued that the cryptocurrency’s price history shows periods of “extreme losses,” adding that performance assumptions are impossible to analyze and that the asset “shouldn’t be relied upon” to help clients meet financial goals. The company’s remarks come shortly after the UK’s Financial Conduct Authority (FCA) ended its nearly four-year ban on crypto exchange-traded notes (ETNs) for retail investors. Source: www.coindesk.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "consumer:apple is winding down clips its forgotten videoediting app:2025-10-11T21:09:07.000Z",
    "title": "Apple is winding down Clips, its forgotten video-editing app",
    "url": "https://www.engadget.com/apple-is-winding-down-clips-its-forgotten-video-editing-app-210907085.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-11T21:09:07.000Z",
    "summary_long": "It seems to be the end of the road for Apple's Clips app. The company said on a support page that it has stopped updating the video-editing app, and new users can no longer download it from the App Store. Existing users on iOS and iPadOS will continue to have access for the time being, but the company hasn't said how long that will last. \"If you previously downloaded the Clips app, you can still redownload it from your Apple account in the App Store,\" the support page notes. Source: www.engadget.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:openai no longer has to preserve all of its chatgpt data wit:2025-10-11T19:24:22.000Z",
    "title": "OpenAI no longer has to preserve all of its ChatGPT data, with some exceptions",
    "url": "https://www.engadget.com/ai/openai-no-longer-has-to-preserve-all-of-its-chatgpt-data-with-some-exceptions-192422093.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-10-11T19:24:22.000Z",
    "summary_long": "The controversial preservation order requiring OpenAI to indefinitely keep records of its ChatGPT data has been terminated. Federal judge Ona T. Wang filed a new order on October 9 that frees OpenAI of an obligation to \"preserve and segregate all output log data that would otherwise be deleted on a going forward basis.\" The case kicked off in late 2023, with the New York Times suing OpenAI for copyright infringement, alleging that the AI giant trained its models with the news outlet's intellectual property without proper compensation. In May of this year, OpenAI was ordered to retain all of its chat logs so that the NYT could investigate claims of copyright violation. Source: www.engadget.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:what could burst the ai bubble:2025-10-11T15:10:04.000Z",
    "title": "What could burst the AI bubble?",
    "url": "https://techxplore.com/news/2025-10-ai.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-11T15:10:04.000Z",
    "summary_long": "Some of the world's biggest tech firms have soared in value over the last year. As AI evolves at pace, there are hopes that it will improve lives in ways that people could never have imagined a decade ago—in sectors as diverse as health care, employment and scientific discovery. Source: techxplore.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:old tricks new tech scams in the age of ai:2025-10-11T15:10:01.000Z",
    "title": "Old tricks, new tech: Scams in the age of AI",
    "url": "https://techxplore.com/news/2025-10-tech-scams-age-ai.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-11T15:10:01.000Z",
    "summary_long": "Old tricks, new tech: Scams in the age of AI Source: techxplore.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:windows 10 support ends october 14 but heres how to get an e:2025-10-11T12:51:18.000Z",
    "title": "Windows 10 support ends October 14, but here's how to get an extra year for free",
    "url": "https://www.engadget.com/computing/windows-10-support-ends-october-14-but-heres-how-to-get-an-extra-year-for-free-125118616.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Katie Teague",
    "published_at": "2025-10-11T12:51:18.000Z",
    "summary_long": "You've known it for a while: Microsoft has determined that it's moving Windows 10 to \"end of life\" status starting on October 14. That means while Windows 10 PCs will continue to work after that date, they'll stop getting important security updates by default. That leaves you with three choices if you want to make sure your computer remains secure: 1. You can choose to upgrade to Windows 11 for free if your computer is compatible. Source: www.engadget.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:a us startup plans to deliver sunlight on demand after dark :2025-10-11T19:10:02.000Z",
    "title": "A US startup plans to deliver 'sunlight on demand' after dark. Can it work? Would we want it to?",
    "url": "https://techxplore.com/news/2025-10-startup-sunlight-demand-dark.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-11T19:10:02.000Z",
    "summary_long": "A US startup plans to deliver 'sunlight on demand' after dark. Can it work? Would we want it to? Source: techxplore.com. Date: 2025-10-11. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]