[
  {
    "id": "bigtech:a nonpublic document reveals that science may not be priorit:2026-02-26T14:44:25.000Z",
    "title": "A non-public document reveals that science may not be prioritized on next Mars mission",
    "url": "https://arstechnica.com/space/2026/02/a-non-public-document-reveals-that-science-may-not-be-prioritized-on-next-mars-mission/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2026-02-26T14:44:25.000Z",
    "summary_long": "The US space agency has released a \"pre-solicitation\" for what is expected to be a hotly contested contract to develop a spacecraft to orbit Mars and relay communications from the red planet back to Earth. Ars covered the intrigue surrounding the spacecraft in late January, which was initiated by US Senator Ted Cruz, R-Texas, as part of the \"One Big Beautiful Bill\" legislation in the summer of 2025. The bill provided $700 million for NASA to develop the orbiter and specified funding had to be awarded \"not later than fiscal year 2026,\" which ends September 30, 2026. This legislation was seemingly crafted by Cruz's office to favor a single contractor, Rocket Lab. Source: arstechnica.com. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:google reveals nano banana 2 ai image model coming to gemini:2026-02-26T17:12:10.000Z",
    "title": "Google reveals Nano Banana 2 AI image model, coming to Gemini today",
    "url": "https://arstechnica.com/ai/2026/02/google-releases-nano-banana-2-ai-image-generator-promises-pro-results-with-flash-speed/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2026-02-26T17:12:10.000Z",
    "summary_long": "The last year has been big for Google's AI efforts. Its rapid-fire model releases have brought it to parity with the likes of OpenAI and Anthropic and, in some cases, pushed it into the lead. The Nano Banana image generator was emblematic of that trend when it debuted last year, and subsequent updates only made it better. Now, Google has announced yet another update to its image model with Nano Banana 2, which is available starting today. Source: arstechnica.com. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:new york sues valve for enabling illegal gambling with loot :2026-02-26T14:57:36.000Z",
    "title": "New York sues Valve for enabling \"illegal gambling\" with loot boxes",
    "url": "https://arstechnica.com/gaming/2026/02/new-york-sues-valve-for-enabling-illegal-gambling-with-loot-boxes/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Kyle Orland\n                ",
    "published_at": "2026-02-26T14:57:36.000Z",
    "summary_long": "New York state has filed a lawsuit against Valve alleging that randomized loot boxes in games like Counter-Strike 2, Team Fortress 2, and Dota 2 amount to a form of unregulated gambling, letting users \"pay for the chance to win a rare virtual item of significant monetary value.\" While many randomized video game loot boxes have drawn attention and regulation from various government bodies in recent years, the New York suit calls out Valve's system specifically for \"enabl[ing] users to sell the virtual items they have won, either through its own virtual marketplace, the Steam Community Market, or through third-party marketplaces.\" The vast majority of Valve's in-game loot boxes contain skins that can only be resold for a few cents, the suit notes, while the rarest skins can be worth thousands of dollars through marketplaces on and off of Steam. That fits the statutory definition of gambling as \"charging an individual for a chance to win something of value based…",
    "tags": []
  },
  {
    "id": "consumer:block the parent of square and cash app is laying off over 4:2026-02-26T22:33:43.000Z",
    "title": "Block, the parent of Square and Cash App, is laying off over 4,000 people",
    "url": "https://www.engadget.com/apps/block-the-parent-of-square-and-cash-app-is-laying-off-over-4000-people-223343068.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2026-02-26T22:33:43.000Z",
    "summary_long": "Block is the latest business to announce layoffs, with the operator of payment platforms Square and Cash App opting to cut jobs in favor of using more AI tools. The financial tech company, helmed by Twitter founder Jack Dorsey, is slashing its current staff of 10,000 to \"just under 6,000.\" CNBC highlighted a letter Block sent to shareholders announcing the decision to nearly halve its workforce. According to the message from Dorsey: \"The core thesis is simple. Intelligence tools have changed what it means to build and run a company. Source: www.engadget.com. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the new 25 action game from the creator of just cause arrive:2026-02-26T19:30:58.000Z",
    "title": "The new $25 action game from the creator of Just Cause arrives on April 8",
    "url": "https://www.engadget.com/gaming/pc/the-new-25-action-game-from-the-creator-of-just-cause-arrives-on-april-8-193058294.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-02-26T19:30:58.000Z",
    "summary_long": "We’re still waiting for releases dates for Remedy’s in-development Max Payne remakes, but if you’re in need of a noir fix sooner than that, keep an eye on Liquid Swords’ Samson: A Tyndalston Story, which just got a release date of April 8. The debut game from a new studio formed by Just Cause creator Christofer Sundberg, Samson looks like a tighter, more narrative-led experience than Avalanche’s proudly ridiculous open-world series, but no less packed with over-the-top action. You play as the eponymous Samson McRay, a man down on his luck and seriously in debt in the punishing city of Tyndalston. \"Samson is built on a simple, brutal truth: every day has a cost,\" said the developer in a press release. Source: www.engadget.com. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:landsat 9 more than just a picture:2026-02-26T17:47:04.000Z",
    "title": "Landsat 9: More Than Just A Picture",
    "url": "https://science.nasa.gov/missions/landsat/landsat-9-more-than-just-a-picture/",
    "category_id": "space",
    "region": "Global",
    "source": "science.nasa.gov",
    "author": "",
    "published_at": "2026-02-26T17:47:04.000Z",
    "summary_long": "Landsat Navigation * Landsat Home * Missions * Landsat Next * Landsat 9 * Landsat 8 * Landsat 7 * Landsat 6 * Landsat 5 * Landsat 4 * Landsat 3 * Landsat 2 * Landsat 1 * News * Latest News * People of Landsat * Q&As * Newsletter * Publications * Data * Overview * Cal/Val * Open Data * Benefits * Overview * Agriculture & Food Security * Disaster Management * Ecosystems & Biodiversity * Energy Resources * Forest Management * Human Health * Urban Development * Water Resources * Wildfires * Case Studies * Outreach * Multimedia * About * Search By Chris Burns, NASA’s Goddard Space Flight Center For over 50 years, the Landsat program has provided the longest continuous satellite record of Earth’s land surface from space. Landsat 9, launched in 2021, is the latest mission in this remarkable legacy — building on decades of Earth observation with upgraded technology, including enhanced radiometric resolution,…",
    "tags": []
  },
  {
    "id": "ai_data:evaluating stochasticity in deep research agents:2026-02-26T17:46:42.000Z",
    "title": "Evaluating Stochasticity in Deep Research Agents",
    "url": "https://arxiv.org/abs/2602.23271v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Haotian Zhai",
    "published_at": "2026-02-26T17:46:42.000Z",
    "summary_long": "Deep Research Agents (DRAs) are promising agentic systems that gather and synthesize information to support research across domains such as financial decision-making, medical analysis, and scientific discovery. Despite recent improvements in research quality (e.g., outcome accuracy when ground truth is available), DRA system design often overlooks a critical barrier to real-world deployment: stochasticity. Under identical queries, repeated executions of DRAs can exhibit substantial variability in terms of research outcome, findings, and citations. In this paper, we formalize the study of stochasticity in DRAs by modeling them as information acquisition Markov Decision Processes. Source: arxiv.org. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:riskaware world model predictive control for generalizable e:2026-02-26T17:32:30.000Z",
    "title": "Risk-Aware World Model Predictive Control for Generalizable End-to-End Autonomous Driving",
    "url": "https://arxiv.org/abs/2602.23259v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Jiangxin Sun",
    "published_at": "2026-02-26T17:32:30.000Z",
    "summary_long": "With advances in imitation learning (IL) and large-scale driving datasets, end-to-end autonomous driving (E2E-AD) has made great progress recently. Currently, IL-based methods have become a mainstream paradigm: models rely on standard driving behaviors given by experts, and learn to minimize the discrepancy between their actions and expert actions. However, this objective of \"only driving like the expert\" suffers from limited generalization: when encountering rare or unseen long-tail scenarios outside the distribution of expert demonstrations, models tend to produce unsafe decisions in the absence of prior experience. This raises a fundamental question: Can an E2E-AD system make reliable decisions without any expert action supervision? Source: arxiv.org. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex planning predawn falcon 9 launch from c:2026-02-27T01:14:27.000Z",
    "title": "Live coverage: SpaceX planning pre-dawn Falcon 9 launch from Cape Canaveral of 29 Starlink satellites",
    "url": "https://spaceflightnow.com/2026/02/27/live-coverage-spacex-planning-pre-dawn-falcon-9-launch-from-cape-canaveral-of-29-starlink-satellites/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Spaceflight Now",
    "published_at": "2026-02-27T01:14:27.000Z",
    "summary_long": "SpaceX is planning to launch another 29 satellites for its Starlink internet service before sunrise on Friday at Cape Canaveral. Liftoff from Space Launch Complex 40 is scheduled for 5:20:50 a.m. EST (1020:50 UTC). Spaceflight Now will have live coverage of the launch starting about one hour prior to liftoff. Source: spaceflightnow.com. Date: 2026-02-27. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa invites media to discuss next steps for artemis campaig:2026-02-26T16:07:56.000Z",
    "title": "NASA Invites Media to Discuss Next Steps for Artemis Campaign",
    "url": "https://www.nasa.gov/news-release/nasa-invites-media-to-discuss-next-steps-for-artemis-campaign/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jessica Taveau",
    "published_at": "2026-02-26T16:07:56.000Z",
    "summary_long": "NASA’s crawler-transporter 2, carrying NASA’s Artemis II SLS (Space Launch System) rocket with the Orion spacecraft, arrives Feb. 25, 2026, inside the Vehicle Assembly Building at the agency’s Kennedy Space Center in Florida to troubleshoot the flow of helium to the rocket’s upper stage, the interim cryogenic propulsion stage. Once complete, the SLS rocket will roll back to Launch Complex 39B to prepare to launch four astronauts around the Moon and back for the Artemis II test flight. Credit: NASA/Cory Huston With rollback of NASA’s Artemis II SLS (Space Launch System) rocket and Orion spacecraft to the Vehicle Assembly Building complete, the agency will host a news conference at 10 a.m. Source: www.nasa.gov. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:googles nano banana 2 is a faster version of nano banana pro:2026-02-26T16:00:00.000Z",
    "title": "Google's Nano Banana 2 is a faster version of Nano Banana Pro",
    "url": "https://www.engadget.com/ai/googles-nano-banana-2-is-a-faster-version-of-nano-banana-pro-160000695.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2026-02-26T16:00:00.000Z",
    "summary_long": "Google has launched its new image generation model, the Nano Banana 2, which is powered by Gemini 3.1 Flash Image. The company says the new model has the capabilities, world knowledge and reasoning of Nano Banana Pro, but it can accomplish tasks at “lightning-fast speed.” That enables rapid editing and the quick creation of various iterations using a single prompt. Nano Banana 2 will give more people access to capabilities that were previously exclusive to the Pro model. That includes Pro’s ability to pull real-time information and images from web searches to create, say, infographics and diagrams. Source: www.engadget.com. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:new system designed to protect drones from cyber threats:2026-02-26T15:00:09.000Z",
    "title": "New system designed to protect drones from cyber threats",
    "url": "https://techxplore.com/news/2026-02-drones-cyber-threats.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-26T15:00:09.000Z",
    "summary_long": "Adelaide University researchers have initiated the development of a world-first cybersecurity system designed to protect drones from increasingly sophisticated cyber threats. The new study led by the Industrial AI Research Center and published in the journal Computers & Industrial Engineering, paves the way for safer and more resilient unmanned aerial systems (UAS) that are less vulnerable to hacking, signal disruption and malicious software. Source: techxplore.com. Date: 2026-02-26. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]