[
  {
    "id": "bigtech:who slams usfunded newborn vaccine trial as unethical:2026-02-13T23:16:48.000Z",
    "title": "WHO slams US-funded newborn vaccine trial as \"unethical\"",
    "url": "https://arstechnica.com/health/2026/02/who-slams-us-funded-newborn-vaccine-trial-as-unethical/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2026-02-13T23:16:48.000Z",
    "summary_long": "The World Health Organization on Friday released a formal statement blasting a US-funded vaccine trial as \"unethical,\" because it would withhold an established, safe, and potentially lifesaving vaccine against hepatitis B from some newborns in Guinea-Bissau, Africa. \"In its current form, and based on publicly available information, the trial is inconsistent with established ethical and scientific principles,\" the WHO concluded, after providing a bullet-point list of reasons the trial was harmful and low quality. The trial has drawn widespread condemnation from health experts since notice of the US funding was published in the Federal Register in December. The notice revealed that the Centers for Disease Control and Prevention—under anti-vaccine Health Secretary Robert F. Source: arstechnica.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:the first android 17 beta is now available on pixel devices:2026-02-13T20:58:25.000Z",
    "title": "The first Android 17 beta is now available on Pixel devices",
    "url": "https://arstechnica.com/gadgets/2026/02/the-first-android-17-beta-is-now-available-on-pixel-devices/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2026-02-13T20:58:25.000Z",
    "summary_long": "You might have noticed some reporting a few days ago that Android 17 was rolling out in beta form, but that didn't happen. For reasons Google still has not explained, the release was canceled. Two days later, Android 17 is here for real. If you've got a recent Pixel device, you can try the latest version today, but don't expect big changes just yet—there's still a long way to go before release. Source: arstechnica.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:i spent two days gigging at rentahuman and didnt make a sing:2026-02-13T14:41:21.000Z",
    "title": "I spent two days gigging at RentAHuman and didn't make a single cent",
    "url": "https://arstechnica.com/ai/2026/02/i-spent-two-days-gigging-at-rentahuman-and-didnt-make-a-single-cent/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Reece Rogers, wired.com\n                ",
    "published_at": "2026-02-13T14:41:21.000Z",
    "summary_long": "I’m not above doing some gig work to make ends meet. In my life, I’ve worked snack food pop-ups in a grocery store, ran the cash register for random merch booths, and even hawked my own plasma at $35 per vial. So, when I saw RentAHuman, a new site where AI agents hire humans to perform physical work in the real world on behalf of the virtual bots, I was eager to see how these AI overlords would compare to my past experiences with the gig economy. Launched in early February, RentAHuman was developed by software engineer Alexander Liteplo and his cofounder, Patricia Tani. Source: arstechnica.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:why metal microstructures matter ai pinpoints stress hotspot:2026-02-13T17:19:24.000Z",
    "title": "Why metal microstructures matter: AI pinpoints stress hotspots to guide safer designs",
    "url": "https://techxplore.com/news/2026-02-metal-microstructures-ai-stress-hotspots.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-13T17:19:24.000Z",
    "summary_long": "Metals are made of randomly oriented crystals at the microscopic-length scale. The alignment of the crystal faces creates an infinite number of configurations and complex patterns, making simulations of specific patterns difficult and expensive. Aerospace engineers in The Grainger College of Engineering, University of Illinois Urbana-Champaign created a model to capture the metal material's response to stress and predict failure hotspots at a scale equivalent in pixels to over 600 million dots per inch. Source: techxplore.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:gpt52 derives a new result in theoretical physics:2026-02-13T11:00:00.000Z",
    "title": "GPT-5.2 derives a new result in theoretical physics",
    "url": "https://openai.com/index/new-result-theoretical-physics",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-02-13T11:00:00.000Z",
    "summary_long": "GPT-5.2 derives a new result in theoretical physics Source: openai.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:nintendos virtual boy accessory lets you play vr mario and z:2026-02-13T17:21:38.000Z",
    "title": "Nintendo’s Virtual Boy accessory lets you play VR Mario and Zelda on Switch 2",
    "url": "https://www.engadget.com/gaming/nintendo/nintendos-virtual-boy-accessory-lets-you-play-vr-mario-and-zelda-on-switch-2-172138483.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Lawrence Bonk",
    "published_at": "2026-02-13T17:21:38.000Z",
    "summary_long": "The forthcoming Nintendo Virtual Boy accessory for Switch and Switch 2 can play VR-supported games, as reported by Video Games Chronicle. There are four available games to play, including Super Mario Odyssey, Super Smash Bros Ultimate, The Legend of Zelda: Breath of the Wild and Captain Toad: Treasure Tracker. These aren't new VR builds of the games, rather they are the versions previously released for the Nintendo Labo VR set. This was a kit for the original Switch that allowed users to build a cardboard VR headset, among other items. Source: www.engadget.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:introducing lockdown mode and elevated risk labels in chatgp:2026-02-13T10:00:00.000Z",
    "title": "Introducing Lockdown Mode and Elevated Risk labels in ChatGPT",
    "url": "https://openai.com/index/introducing-lockdown-mode-and-elevated-risk-labels-in-chatgpt",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-02-13T10:00:00.000Z",
    "summary_long": "Introducing Lockdown Mode and Elevated Risk labels in ChatGPT Source: openai.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:beyond rate limits scaling access to codex and sora:2026-02-13T09:00:00.000Z",
    "title": "Beyond rate limits: scaling access to Codex and Sora",
    "url": "https://openai.com/index/beyond-rate-limits",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2026-02-13T09:00:00.000Z",
    "summary_long": "Beyond rate limits: scaling access to Codex and Sora Source: openai.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:organic molecule stores solar energy for years then releases:2026-02-13T16:40:01.000Z",
    "title": "Organic molecule stores solar energy for years, then releases it as heat on demand",
    "url": "https://techxplore.com/news/2026-02-molecule-solar-energy-years-demand.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2026-02-13T16:40:01.000Z",
    "summary_long": "When the sun goes down, solar panels stop working. This is the fundamental hurdle of renewable energy: how to save the sun's power for a rainy day—or a cold night. Chemists at UC Santa Barbara have developed a solution that doesn't require bulky batteries or electrical grids. In a paper published in the journal Science, Associate Professor Grace Han and her team detail a new material that captures sunlight, stores it within chemical bonds and releases it as heat on demand. Source: techxplore.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:crew12 launches:2026-02-13T15:39:10.000Z",
    "title": "Crew-12 Launches",
    "url": "https://www.nasa.gov/image-article/crew-12-launches/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Gary Daines",
    "published_at": "2026-02-13T15:39:10.000Z",
    "summary_long": "NASA/Aubrey Gemignani A SpaceX Falcon 9 rocket carrying the company’s Dragon spacecraft is launched on NASA’s SpaceX Crew-12 mission to the International Space Station with NASA astronauts Jessica Meir, Jack Hathaway, ESA (European Space Agency) astronaut Sophie Adenot, and Roscosmos cosmonaut Andrey Fedyaev onboard, Friday, Feb. 13, 2026, from Cape Canaveral Space Force Station in Florida. NASA’s SpaceX Crew-12 mission is the twelfth crew rotation mission of the SpaceX Dragon spacecraft and Falcon 9 rocket to the International Space Station as part of the agency’s Commercial Crew Program. Meir, Hathaway, Adenot, and Fedyaev launched at 5:15 a.m. Source: www.nasa.gov. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta is reportedly working to bring facial recognition to it:2026-02-13T14:47:21.000Z",
    "title": "Meta is reportedly working to bring facial recognition to its smart glasses",
    "url": "https://www.engadget.com/ai/meta-is-reportedly-working-to-bring-facial-recognition-to-its-smart-glasses-144721330.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Matt Tate",
    "published_at": "2026-02-13T14:47:21.000Z",
    "summary_long": "Meta has backed away from highly controversial facial recognition tech in its products and services before, but seemingly not so far that it isn’t willing to have another crack at it. A new report from The New York Times claims Mark Zuckerberg’s company wants to add facial recognition to its lineup of branded smart glasses at some point this year. The NYT spoke to four anonymous people with knowledge of Meta’s plans, who told the publication that the feature is codenamed \"Name Tag\" internally. As you’d expect, it would let people wearing Meta-powered Oakley or Ray-Ban glasses identify people and \"get information about them\" using AI. Source: www.engadget.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:the ridiculously tiny kodak charmera captured our hearts and:2026-02-13T14:00:00.000Z",
    "title": "The ridiculously tiny Kodak Charmera captured our hearts (and lots of shoddy pictures)",
    "url": "https://www.engadget.com/cameras/the-ridiculously-tiny-kodak-charmera-captured-our-hearts-and-lots-of-shoddy-pictures-140000245.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen,Cheyenne MacDonald",
    "published_at": "2026-02-13T14:00:00.000Z",
    "summary_long": "Every once in a while, a product comes along that sparks a bit of joy in our jaded hearts. This is what happened with the Kodak Charmera, a $30 tiny toy camera that was nearly impossible to get ahold of in the first couple of months after its release, selling out immediately over waves of blind box restocks. Despite the gimmick of it all, the Charmera was just too cute for some of us to resist, and we sprang when they finally started becoming more readily available. A few of us on the Engadget team have one now, and even with all of its shortcomings, we kind of love this thing. Source: www.engadget.com. Date: 2026-02-13. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]