[
  {
    "id": "bigtech:italy tells meta to suspend its policy that bans rival ai ch:2025-12-24T14:40:34.000Z",
    "title": "Italy tells Meta to suspend its policy that bans rival AI chatbots from WhatsApp",
    "url": "https://techcrunch.com/2025/12/24/italy-tells-meta-to-suspend-its-policy-that-bans-rival-ai-chatbots-from-whatsapp/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Ram Iyer",
    "published_at": "2025-12-24T14:40:34.000Z",
    "summary_long": "Italy tells Meta to suspend its policy that bans rival AI chatbots from WhatsApp Source: techcrunch.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:hashkey capitals 500 milliontarget blockchain fund raises 25:2025-12-24T12:32:23.000Z",
    "title": "HashKey Capital's $500 million-target blockchain fund raises $250 million in first round",
    "url": "https://www.coindesk.com/business/2025/12/24/hashkey-capital-s-usd500-million-target-blockchain-fund-raises-usd250-million-in-first-round",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-12-24T12:32:23.000Z",
    "summary_long": "HashKey Capital's $500 million-target blockchain fund raises $250 million in first round Source: www.coindesk.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:causaldriven attribution cda estimating channel influence wi:2025-12-24T14:51:12.000Z",
    "title": "Causal-driven attribution (CDA): Estimating channel influence without user-level data",
    "url": "https://arxiv.org/abs/2512.21211v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Georgios Filippou",
    "published_at": "2025-12-24T14:51:12.000Z",
    "summary_long": "Attribution modelling lies at the heart of marketing effectiveness, yet most existing approaches depend on user-level path data, which are increasingly inaccessible due to privacy regulations and platform restrictions. This paper introduces a Causal-Driven Attribution (CDA) framework that infers channel influence using only aggregated impression-level data, avoiding any reliance on user identifiers or click-path tracking. CDA integrates temporal causal discovery (using PCMCI) with causal effect estimation via a Structural Causal Model to recover directional channel relationships and quantify their contributions to conversions. Using large-scale synthetic data designed to replicate real marketing dynamics, we show that CDA achieves an average relative RMSE of 9.50% when given the true causal graph, and 24.23% when using the predicted graph, demonstrating strong accuracy under correct structure and meaningful signal recovery even under structural uncertainty. Source: arxiv.org. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:prorussian hacker group claims responsibility for ddos attac:2025-12-24T14:00:15.000Z",
    "title": "Pro-Russian hacker group claims responsibility for DDoS attack on French postal service",
    "url": "https://www.engadget.com/cybersecurity/pro-russian-hacker-group-claims-responsibility-for-ddos-attack-on-french-postal-service-140015323.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-12-24T14:00:15.000Z",
    "summary_long": "A pro-Russian hacker group has come forward as the perpetrator of a DDoS attack on the French national postal service La Poste that took place on December 22, according to Reuters. The distributed denial-of-service attack took central computer systems at La Poste entirely offline and caused major disruptions in package deliveries just days before Christmas. Reuters reported that the cyberattack on La Poste was still not fully resolved as of Wednesday morning. While regular letters were not affected, postal workers were unable to track packages and online payments through La Banque Postale, the service's banking division, were also disrupted. Source: www.engadget.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:santa visits artemis ii rocket:2025-12-24T13:59:43.000Z",
    "title": "Santa Visits Artemis II Rocket",
    "url": "https://www.nasa.gov/image-article/santa-visits-artemis-ii-rocket/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Monika Luabeya",
    "published_at": "2025-12-24T13:59:43.000Z",
    "summary_long": "NASA/Adeline Morgan Santa Claus (NASA engineer Guy Naylor) poses with NASA’s Artemis II Orion spacecraft and SLS (Space Launch System) rocket in the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on Dec. 11, 2025. The Orion spacecraft was stacked atop the SLS in October 2025. Set to launch in early 2026, the Artemis II test flight will be NASA’s first mission with crew under Artemis. Source: www.nasa.gov. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:ballast banditassisted learning for latencyaware stable time:2025-12-24T13:25:36.000Z",
    "title": "BALLAST: Bandit-Assisted Learning for Latency-Aware Stable Timeouts in Raft",
    "url": "https://arxiv.org/abs/2512.21165v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Qizhi Wang",
    "published_at": "2025-12-24T13:25:36.000Z",
    "summary_long": "Randomized election timeouts are a simple and effective liveness heuristic for Raft, but they become brittle under long-tail latency, jitter, and partition recovery, where repeated split votes can inflate unavailability. This paper presents BALLAST, a lightweight online adaptation mechanism that replaces static timeout heuristics with contextual bandits. BALLAST selects from a discrete set of timeout \"arms\" using efficient linear contextual bandits (LinUCB variants), and augments learning with safe exploration to cap risk during unstable periods. We evaluate BALLAST on a reproducible discrete-event simulation with long-tail delay, loss, correlated bursts, node heterogeneity, and partition/recovery turbulence. Source: arxiv.org. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:us bans former eu commissioner and others over social media :2025-12-24T12:18:04.000Z",
    "title": "US bans former EU Commissioner and others over social media rules",
    "url": "https://www.engadget.com/big-tech/us-bans-former-eu-commissioner-and-others-over-social-media-rules-121804097.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Mariella Moon",
    "published_at": "2025-12-24T12:18:04.000Z",
    "summary_long": "The Trump administration has issued travel bans that prohibit five European tech researchers, including one former EU Commissioner, from entering the United States. “For far too long, ideologues in Europe have led organized efforts to coerce American platforms to punish American viewpoints they oppose. The Trump Administration will no longer tolerate these egregious acts of extraterritorial censorship,” said US Secretary of State Marco Rubio. That official is Thierry Breton, the former European Commissioner for Internal Markets and Digital Services, who Sarah Rogers called the “mastermind” of the Digital Services Act. Source: www.engadget.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:urban vpn proxy surreptitiously intercepts ai chats:2025-12-24T12:03:03.000Z",
    "title": "Urban VPN Proxy Surreptitiously Intercepts AI Chats",
    "url": "https://www.schneier.com/blog/archives/2025/12/urban-vpn-proxy-surreptitiously-intercepts-ai-chats.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2025-12-24T12:03:03.000Z",
    "summary_long": "This is pretty scary: > Urban VPN Proxy targets conversations across ten AI platforms: ChatGPT, Claude, Gemini, Microsoft Copilot, Perplexity, DeepSeek, Grok (xAI), Meta AI. > > For each platform, the extension includes a dedicated “executor” script designed to intercept and capture conversations. The harvesting is enabled by default through hardcoded flags in the extension’s configuration. > > There is no user-facing toggle to disable this. Source: www.schneier.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:polymarket points to thirdparty login tool after users repor:2025-12-24T10:20:29.000Z",
    "title": "Polymarket points to third-party login tool after users report account breaches",
    "url": "https://www.coindesk.com/business/2025/12/24/polymarket-points-to-third-party-login-tool-after-users-report-account-breaches",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-12-24T10:20:29.000Z",
    "summary_long": "Polymarket points to third-party login tool after users report account breaches Source: www.coindesk.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:transcriptomeconditioned personalized de novo drug generatio:2025-12-24T17:39:37.000Z",
    "title": "Transcriptome-Conditioned Personalized De Novo Drug Generation for AML Using Metaheuristic Assembly and Target-Driven Filtering",
    "url": "https://arxiv.org/abs/2512.21301v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Abdullah G. Elafifi",
    "published_at": "2025-12-24T17:39:37.000Z",
    "summary_long": "Acute Myeloid Leukemia (AML) remains a clinical challenge due to its extreme molecular heterogeneity and high relapse rates. While precision medicine has introduced mutation-specific therapies, many patients still lack effective, personalized options. This paper presents a novel, end-to-end computational framework that bridges the gap between patient-specific transcriptomics and de novo drug discovery. By analyzing bulk RNA sequencing data from the TCGA-LAML cohort, the study utilized Weighted Gene Co-expression Network Analysis (WGCNA) to prioritize 20 high-value biomarkers, including metabolic transporters like HK3 and immune-modulatory receptors such as SIGLEC9. Source: arxiv.org. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:tv technica our favorite shows of 2025:2025-12-24T13:00:53.000Z",
    "title": "TV Technica: Our favorite shows of 2025",
    "url": "https://arstechnica.com/culture/2025/12/tv-technica-our-favorite-shows-of-2025/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jennifer Ouellette\n                ",
    "published_at": "2025-12-24T13:00:53.000Z",
    "summary_long": "Editor’s note: Warning: Although we’ve done our best to avoid spoiling anything major, please note this list does include a few specific references to several of the listed shows that some might consider spoiler-y. This was a pretty good year for television, with established favorites sharing space on our list with some intriguing new shows. Streaming platforms reigned supreme, with Netflix and Apple TV dominating our list with seven and five selections each. Genre-wise, we've got a bit of everything: period dramas (The Gilded Age, Outrageous), superheroes (Daredevil: Born Again), mysteries (Ludwig, Poker Face, Dept. Source: arstechnica.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:how ai coding agents workand what to remember if you use the:2025-12-24T12:00:27.000Z",
    "title": "How AI coding agents work—and what to remember if you use them",
    "url": "https://arstechnica.com/information-technology/2025/12/how-do-ai-coding-agents-work-we-look-under-the-hood/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Benj Edwards\n                ",
    "published_at": "2025-12-24T12:00:27.000Z",
    "summary_long": "AI coding agents from OpenAI, Anthropic, and Google can now work on software projects for hours at a time, writing complete apps, running tests, and fixing bugs with human supervision. But these tools are not magic and can complicate rather than simplify a software project. Understanding how they work under the hood can help developers know when (and if) to use them, while avoiding common pitfalls. We'll start with the basics: At the core of every AI coding agent is a technology called a large language model (LLM), which is a type of neural network trained on vast amounts of text data, including lots of programming code. Source: arstechnica.com. Date: 2025-12-24. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]