[
  {
    "id": "bigtech:an ice raid at an ev factory raises fears about us instabili:2025-09-20T12:00:00.000Z",
    "title": "An ICE raid at an EV factory raises fears about US instability",
    "url": "https://www.theverge.com/transportation/781869/ice-raid-georgia-hyundai-lg-ev-foreign-chilling",
    "category_id": "bigtech",
    "region": "Global",
    "source": "www.theverge.com",
    "author": "Abigail Bassett",
    "published_at": "2025-09-20T12:00:00.000Z",
    "summary_long": "For years, foreign automakers have been sending their employees to the US to open advanced manufacturing and battery plants in states like South Carolina, Georgia, Tennessee, and Kentucky. These plants eventually employ thousands of American workers who build vehicles for both the US market and overseas. And they pump billions of dollars into the state and federal economies, providing jobs for Americans in more rural areas. So it didn't raise any eyebrows when two South Korean companies, Hyundai and LG Energy Solutions, sent hundreds of their workers to Ellabell, Georgia, to oversee the construction of a $7.6 billion EV battery factory. Source: www.theverge.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:bitgo files for ipo with 42b in h1 2025 revenue 90b in crypt:2025-09-20T14:05:42.000Z",
    "title": "BitGo Files for IPO With $4.2B in H1 2025 Revenue, $90B in Crypto on Platform",
    "url": "https://www.coindesk.com/business/2025/09/20/bitgo-files-for-ipo-with-usd4-2b-in-h1-2025-revenue-usd90b-in-crypto-on-platform",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-20T14:05:42.000Z",
    "summary_long": "Crypto custodian BitGo has filed its first public S-1 registration statement with the U.S. Securities and Exchange Commission (SEC), planning to list Class A common stock on the New York Stock Exchange under the ticker BTGO. The filing provides a rare look at the company’s business scale. BitGo generated $4.19 billion in revenue in the first six months of 2025, nearly quadrupling the $1.12 billion recorded in the same period a year earlier. Source: www.coindesk.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:protectnotsurveil coalition raises alarm about eus frontex e:2025-09-20T20:24:51.000Z",
    "title": "ProtectNotSurveil coalition raises alarm about EU’s Frontex expansion plans",
    "url": "https://edri.org/our-work/protectnotsurveil-coalition-raises-alarm-about-eu-frontex-expansion-plans/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2025-09-20T20:24:51.000Z",
    "summary_long": "The European Commission is set to reform Frontex’s mandate again in 2026. Frontex is the European Border and Coast Guard agency. Responding to the consultation call, the ProtectNotSurveil coalition highlights how reckless the expansion of Frontex’s surveillance capacities would be and how the Commission’s foreseen plans go in the opposite direction of what migrants and affected communities are calling for. The post ProtectNotSurveil coalition raises alarm about EU’s Frontex expansion plans appeared first on European Digital Rights (EDRi). Source: edri.org. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:xai debuts a faster and more costeffective version of grok 4:2025-09-20T19:28:15.000Z",
    "title": "xAI debuts a faster and more cost-effective version of Grok 4",
    "url": "https://www.engadget.com/ai/xai-debuts-a-faster-and-more-cost-effective-version-of-grok-4-192815570.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Jackson Chen",
    "published_at": "2025-09-20T19:28:15.000Z",
    "summary_long": "A few months after the release of Grok 4 and an extremely problematic antisemitic meltdown of its chatbot, xAI is already trying to move on with its latest AI model. Elon Musk's xAI announced the release of Grok 4 Fast, a faster, more efficient reasoning model compared to its recent predecessor. According to xAI, Grok 4 Fast offers similar performance to Grok 4 while using 40 percent fewer thinking tokens on average. Along with faster results, xAI said Grok 4 Fast \"results in a 98% reduction in price to achieve the same performance on frontier benchmarks as Grok 4,\" whether it's handling tasks that involve writing code or just browsing the web for quick responses. Source: www.engadget.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:microsofts entra id vulnerabilities could have been catastro:2025-09-20T11:15:27.000Z",
    "title": "Microsoft’s Entra ID vulnerabilities could have been catastrophic",
    "url": "https://arstechnica.com/security/2025/09/microsofts-entra-id-vulnerabilities-could-have-been-catastrophic/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Matt Burgess and Lily Hay Newman, wired.com\n                ",
    "published_at": "2025-09-20T11:15:27.000Z",
    "summary_long": "As businesses around the world have shifted their digital infrastructure over the last decade from self-hosted servers to the cloud, they’ve benefitted from the standardized, built-in security features of major cloud providers like Microsoft. But with so much riding on these systems, there can be potentially disastrous consequences at a massive scale if something goes wrong. Case in point: Security researcher Dirk-jan Mollema recently stumbled upon a pair of vulnerabilities in Microsoft Azure’s identity and access management platform that could have been exploited for a potentially cataclysmic takeover of all Azure customer accounts. Known as Entra ID, the system stores each Azure cloud customer’s user identities, sign-in access controls, applications, and subscription management tools. Source: arstechnica.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:live coverage spacex to launch 28 starlink satellites on fal:2025-09-20T23:19:41.000Z",
    "title": "Live coverage: SpaceX to launch 28 Starlink satellites on Falcon 9 rocket from Cape Canaveral",
    "url": "https://spaceflightnow.com/2025/09/20/live-coverage-spacex-to-launch-28-starlink-satellites-on-falcon-9-rocket-from-cape-canaveral-12/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-09-20T23:19:41.000Z",
    "summary_long": "SpaceX is preparing for a near sunrise Falcon 9 launch from Cape Canaveral on Sunday. The Starlink 10-27 mission will send 28 Starlink V2 Mini satellites into low Earth orbit. The spacecraft will deploy from the rocket’s upper stage a little more than an hour after the rocket clears the pad at Space Launch Complex 40. SpaceX is targeting liftoff from Cape Canaveral Space Force Station at 6:53 a.m. Source: spaceflightnow.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:consultation response to the european commissions call for e:2025-09-20T20:12:58.000Z",
    "title": "Consultation response to the European Commission’s call for evidence on a new Europol regulation",
    "url": "https://edri.org/our-work/consultation-response-european-commissions-call-for-evidence-new-europol-regulation/",
    "category_id": "policy",
    "region": "Global",
    "source": "edri.org",
    "author": "EDRi",
    "published_at": "2025-09-20T20:12:58.000Z",
    "summary_long": "The European Commission launched a call for evidence to gather views on the reform of Europol’s mandate. Europol is the EU law enforcement cooperation agency. EDRi along with Resist Europol coalition members submitted a response to the consultation, sharing their concerns about this renewed expansion of powers, despite Europol’s numerous issues around opacity and lack of accountability. The post Consultation response to the European Commission’s call for evidence on a new Europol regulation appeared first on European Digital Rights (EDRi). Source: edri.org. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:trump hits h1b visas with 100000 fee targeting the program t:2025-09-20T19:13:20.000Z",
    "title": "Trump hits H-1B visas with $100,000 fee, targeting the program that launched Elon Musk and Instagram",
    "url": "https://techcrunch.com/2025/09/20/trump-hits-h-1b-visas-with-100000-fee-targeting-the-program-that-launched-elon-musk-and-instagram/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "techcrunch.com",
    "author": "Connie Loizos",
    "published_at": "2025-09-20T19:13:20.000Z",
    "summary_long": "President Trump signed a proclamation Friday requiring employers to pay a hefty $100,000 fee for new H-1B visa applications—an enormous jump from the current $215 lottery registration fee—targeting the very program that helped create some of Silicon Valley's biggest success stories. Source: techcrunch.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:kalshi outpaces polymarket in prediction market volume amid :2025-09-20T23:00:13.000Z",
    "title": "Kalshi Outpaces Polymarket in Prediction Market Volume Amid Surge in U.S. Trading",
    "url": "https://www.coindesk.com/markets/2025/09/20/kalshi-outpaces-polymarket-in-prediction-market-volume-amid-surge-in-u-s-trading",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Francisco Rodrigues",
    "published_at": "2025-09-20T23:00:13.000Z",
    "summary_long": "Kalshi is pulling ahead in the prediction market race, capturing a dominant share of trading volume even as competitors like Polymarket push into regulated U.S. territory. From Sept. 11 to 17, Kalshi accounted for 62% of total volume in the on-chain prediction market sector, according to data from Dune Analytics, while Polymarket’s stood at 37%. Source: www.coindesk.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:internet computer bets big on ai as crypto markets play catc:2025-09-20T21:00:00.000Z",
    "title": "Internet Computer Bets Big on AI as Crypto Markets Play Catch-Up",
    "url": "https://www.coindesk.com/tech/2025/09/20/internet-computer-bets-big-on-ai-as-crypto-markets-play-catch-up",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Jamie Crawley",
    "published_at": "2025-09-20T21:00:00.000Z",
    "summary_long": "The Internet Computer (ICP), a blockchain project that has sought to differentiate itself from rivals, is doubling down on its pitch as the go-to network for on-chain artificial intelligence (AI). This could be the beginning of a new tech stack - one in which AI, not humans, becomes the primary developer of applications, according to Dominic Williams, founder of Internet Computer developer Dfinity. Williams argued that while crypto prices remain driven largely by market mechanics - treasury operations, liquidity games and speculation - the underlying technology will eventually force a reckoning in an interview with CoinDesk. “In the long run, markets begin to reflect realities on the ground,” he said. Source: www.coindesk.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:cyberattack hits european airports:2025-09-20T20:27:44.000Z",
    "title": "Cyberattack hits European airports",
    "url": "https://techxplore.com/news/2025-09-cyberattack-european-airports.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-20T20:27:44.000Z",
    "summary_long": "Cyberattack hits European airports Source: techxplore.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:eu to finalize probes into tech platforms soon commissioner:2025-09-20T10:10:02.000Z",
    "title": "EU to finalize probes into tech platforms soon: Commissioner",
    "url": "https://techxplore.com/news/2025-09-eu-probes-tech-platforms-commissioner.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-09-20T10:10:02.000Z",
    "summary_long": "EU to finalize probes into tech platforms soon: Commissioner Source: techxplore.com. Date: 2025-09-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]