[
  {
    "id": "bigtech:new glenn rocket has clear path to launch after testfiring a:2025-10-31T19:10:53.000Z",
    "title": "New Glenn rocket has clear path to launch after test-firing at Cape Canaveral",
    "url": "https://arstechnica.com/space/2025/10/blue-origin-test-fires-second-new-glenn-rocket-ahead-of-launch-next-month/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-10-31T19:10:53.000Z",
    "summary_long": "The road to the second flight of Blue Origin’s heavy-lifting New Glenn rocket got a lot clearer Thursday night with a success test-firing of the launcher’s seven main engines on a launch pad at Cape Canaveral Space Force Station, Florida. Standing on a seaside launch pad, the New Glenn rocket ignited its seven BE-4 main engines at 9:59 pm EDT Thursday (01:59 UTC Friday). The engines burned for 38 seconds while the rocket remained firmly on the ground, according to a social media post by Blue Origin. The hold-down firing of the first stage engines was the final major test of the New Glenn rocket before launch day. Source: arstechnica.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:att sues ad industry watchdog instead of pulling ads that sl:2025-10-31T18:23:09.000Z",
    "title": "AT&T sues ad industry watchdog instead of pulling ads that slam T-Mobile",
    "url": "https://arstechnica.com/tech-policy/2025/10/att-sues-ad-industry-watchdog-instead-of-pulling-ads-that-slam-t-mobile/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-10-31T18:23:09.000Z",
    "summary_long": "AT&T yesterday sued the advertising industry’s official watchdog over the group’s demand that AT&T stop using its rulings for advertising and promotional purposes. As previously reported, BBB National Programs’ National Advertising Division (NAD) found that AT&T violated a rule “by issuing a video advertisement and press release that use the NAD process and its findings for promotional purposes,” and sent a cease-and-desist letter to the carrier. The NAD operates the US advertising industry’s system of self-regulation, which is designed to handle complaints that advertisers file against each other and minimize government regulation of false and misleading claims. While it’s clear that both AT&T and T-Mobile have a history of misleading ad campaigns, AT&T portrays itself as a paragon of honesty in new ads calling T-Mobile “the master of breaking promises.” An AT&T press release about the ad campaign said the NAD “asked T-Mobile to correct their marketing claims 16 times over the last four years,” and an AT&T commercial said…",
    "tags": []
  },
  {
    "id": "bigtech:trumps swift demolition of east wing may have launched asbes:2025-10-31T15:36:23.000Z",
    "title": "Trump’s swift demolition of East Wing may have launched asbestos plumes",
    "url": "https://arstechnica.com/health/2025/10/trumps-swift-demolition-of-east-wing-may-have-launched-asbestos-plumes/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Beth Mole\n                ",
    "published_at": "2025-10-31T15:36:23.000Z",
    "summary_long": "The speedy demolition of the East Wing of the White House last week has health advocates and Democratic lawmakers seeking answers about what efforts were taken, if any, to keep workers and passersby safe from potential plumes of asbestos that could arise from the destruction, according to a report by The Washington Post. The East Wing was originally constructed in 1902 and was renovated in 1942, and asbestos was used extensively in government buildings during this period, according to the Asbestos Disease Awareness Organization (ADAO), a nonprofit focused on preventing asbestos exposure. Anyone who inadvertently breathes in asbestos fibers launched into the air by construction work could be at heightened risk of lung diseases and cancer. “Every building of this age must undergo full asbestos inspection and abatement before any demolition begins,” Linda Reinstein, president and cofounder of ADAO, said in a press statement. Source: arstechnica.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "consumer:creative labs is crowdfunding a modular sound blaster audio :2025-10-31T16:19:57.000Z",
    "title": "Creative Labs is crowdfunding a modular Sound Blaster audio hub",
    "url": "https://www.engadget.com/audio/creative-labs-is-crowdfunding-a-modular-sound-blaster-audio-hub-161957129.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-10-31T16:19:57.000Z",
    "summary_long": "Creative Labs, the maker of Sound Blaster audio cards, has launched a Kickstarter for a modular audio hub called Sound Blaster Re:Imagine. The universal hub, which is reminiscent of Elgato's Stream Deck, is meant to allow routing from any input to any output with the press of a button. Users can connect their gaming consoles, PC and musical instruments to the Re:Imagine, as well as speakers, wired headsets and wireless headphones, transitioning seamlessly between them. The system uses magnetic modules including a 3-inch smart screen, four-button pad, rotary knob and dual sliders that can all be rearranged on the base unit. Source: www.engadget.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:spacex to launch 100th starlink flight of 2025:2025-10-31T14:47:30.000Z",
    "title": "SpaceX to launch 100th Starlink flight of 2025",
    "url": "https://spaceflightnow.com/2025/10/31/live-coverage-spacex-to-launch-100th-starlink-flight-of-2025/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Will Robinson-Smith",
    "published_at": "2025-10-31T14:47:30.000Z",
    "summary_long": "SpaceX to launch 100th Starlink flight of 2025 Source: spaceflightnow.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:core scientific upgraded to outperform following failed core:2025-10-31T14:32:32.000Z",
    "title": "Core Scientific Upgraded to Outperform Following Failed CoreWeave Merger: Macquarie",
    "url": "https://www.coindesk.com/markets/2025/10/31/core-scientific-upgraded-to-outperform-following-failed-coreweave-merger-macquarie",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-10-31T14:32:32.000Z",
    "summary_long": "Core Scientific Upgraded to Outperform Following Failed CoreWeave Merger: Macquarie Source: www.coindesk.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:dodgers vs blue jays game 6 tonight how to watch the 2025 ml:2025-10-31T23:06:26.000Z",
    "title": "Dodgers vs. Blue Jays, Game 6 tonight: How to watch the 2025 MLB World Series without cable",
    "url": "https://www.engadget.com/entertainment/streaming/dodgers-vs-blue-jays-game-6-tonight-how-to-watch-the-2025-mlb-world-series-without-cable-102530438.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Danica Creahan,Liz Kocan",
    "published_at": "2025-10-31T23:06:26.000Z",
    "summary_long": "The Toronto Blue Jays have taken the lead in the 2025 World Series against the Los Angeles Dodgers. The Fall Classic returns to Toronto's home turf for Game 6 tonight — Friday, Oct. 31 — at 8PM ET/5PM PT. The World Series odds still favor the Dodgers ahead of tonight's game, meaning we may very well make it to a Game 7. Source: www.engadget.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "nextfrontiers:nasa takes one step closer to launching quiet supersonic jet:2025-10-31T09:39:45.000Z",
    "title": "NASA takes one step closer to launching quiet supersonic jets",
    "url": "https://techxplore.com/news/2025-10-nasa-closer-quiet-supersonic-jets.html",
    "category_id": "nextfrontiers",
    "region": "Global",
    "source": "techxplore.com",
    "author": "",
    "published_at": "2025-10-31T09:39:45.000Z",
    "summary_long": "A supersonic jet plane designed to make very little noise took flight for the first time this week, cruising over the southern California desert just after sunrise in what could be the first step toward much faster commercial travel, according to NASA. Source: techxplore.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:crypto bank custodia suffers another court rejection in fed :2025-10-31T18:17:09.000Z",
    "title": "Crypto Bank Custodia Suffers Another Court Rejection in Fed Master Account Pursuit",
    "url": "https://www.coindesk.com/policy/2025/10/31/crypto-bank-custodia-suffers-another-court-rejection-in-fed-master-account-pursuit",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Nikhilesh De",
    "published_at": "2025-10-31T18:17:09.000Z",
    "summary_long": "Crypto Bank Custodia Suffers Another Court Rejection in Fed Master Account Pursuit Source: www.coindesk.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:sam bankmanfried posts lengthy ftx was never insolvent docum:2025-10-31T09:07:19.000Z",
    "title": "Sam Bankman-Fried Posts Lengthy 'FTX Was Never Insolvent' Document",
    "url": "https://www.coindesk.com/markets/2025/10/31/sam-bankman-fried-posts-30-page-ftx-was-never-insolvent-document",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Sam Reynolds",
    "published_at": "2025-10-31T09:07:19.000Z",
    "summary_long": "Sam Bankman-Fried Posts Lengthy 'FTX Was Never Insolvent' Document Source: www.coindesk.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "policy:friday squid blogging giant squid at the smithsonian:2025-10-31T21:06:18.000Z",
    "title": "Friday Squid Blogging: Giant Squid at the Smithsonian",
    "url": "https://www.schneier.com/blog/archives/2025/10/friday-squid-blogging-giant-squid-at-the-smithsonian.html",
    "category_id": "policy",
    "region": "Global",
    "source": "www.schneier.com",
    "author": "Bruce Schneier",
    "published_at": "2025-10-31T21:06:18.000Z",
    "summary_long": "I can’t believe that I haven’t yet posted this picture of a giant squid at the Smithsonian. As usual, you can also use this squid post to talk about the security stories in the news that I haven’t covered. Blog moderation policy. Source: www.schneier.com. Date: 2025-10-31. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:bluesky experiments with dislikes and social proximity to im:2025-10-31T20:52:26.000Z",
    "title": "Bluesky experiments with dislikes and 'social proximity' to improve conversations",
    "url": "https://www.engadget.com/social-media/bluesky-experiments-with-dislikes-and-social-proximity-to-improve-conversations-205226194.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-10-31T20:52:26.000Z",
    "summary_long": "Bluesky is adding a dislike button as a way to signal the kind of posts you don't want to see in your Discover feed. The experiment is part of several new ideas Bluesky is exploring to a improve conversations on its platform. The new experiments Bluesky is running are primarily built around the notion of \"social proximity.\" The company says it's aiming to build a system that maps your place in a \"social neighborhood\" of \"people you already interact with or would likely enjoy knowing.\" By prioritizing replies and posts from the people in your general \"neighborhood,\" the company believes it can make conversations \"feel more relevant, familiar, and less prone to misunderstandings.\" Following that logic, the beta test of the dislike button (which sounds private, rather than public-facing) will \"help the system understand what kinds of posts you’d prefer to see less of,\" but could also affect reply rankings in your threads and in the threads of other people…",
    "tags": []
  }
]