[
  {
    "id": "bigtech:microsoft makes zork i ii and iii open source under mit lice:2025-11-20T20:33:50.000Z",
    "title": "Microsoft makes Zork I, II, and III open source under MIT License",
    "url": "https://arstechnica.com/gaming/2025/11/microsoft-makes-zork-i-ii-and-iii-open-source-under-mit-license/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Samuel Axon\n                ",
    "published_at": "2025-11-20T20:33:50.000Z",
    "summary_long": "Zork, the classic text-based adventure game of incalculable influence, has been made available under the MIT License, along with the sequels Zork II and Zork III. The move to take these Zork games open source comes as the result of the shared work of the Xbox and Activision teams along with Microsoft’s Open Source Programs Office (OSPO). Parent company Microsoft owns the intellectual property for the franchise. Only the code itself has been made open source. Source: arstechnica.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:trump revives unpopular ted cruz plan to punish states that :2025-11-20T18:50:06.000Z",
    "title": "Trump revives unpopular Ted Cruz plan to punish states that impose AI laws",
    "url": "https://arstechnica.com/tech-policy/2025/11/trump-revives-unpopular-ted-cruz-plan-to-punish-states-that-impose-ai-laws/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Jon Brodkin\n                ",
    "published_at": "2025-11-20T18:50:06.000Z",
    "summary_long": "President Trump is considering an executive order that would require the federal government to file lawsuits against states with AI laws, and prevent states with AI laws from obtaining broadband funding. The draft order, “Eliminating State Law Obstruction of National AI Policy,” would order the attorney general to “establish an AI Litigation Task Force whose sole responsibility shall be to challenge State AI laws, including on grounds that such laws unconstitutionally regulate interstate commerce, are preempted by existing Federal regulations, or are otherwise unlawful in the Attorney General’s judgment.” The draft order says the Trump administration “will act to ensure that there is a minimally burdensome national standard—not 50 discordant State ones.” It specifically names laws enacted by California and Colorado and directs the Secretary of Commerce to evaluate whether other laws should be challenged. Read full article Comments Source: arstechnica.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society.",
    "tags": []
  },
  {
    "id": "bigtech:blue origin revealed some massively cool plans for its new g:2025-11-20T18:06:41.000Z",
    "title": "Blue Origin revealed some massively cool plans for its New Glenn rocket",
    "url": "https://arstechnica.com/space/2025/11/blue-origin-says-its-just-getting-started-with-the-new-glenn-rocket/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Eric Berger\n                ",
    "published_at": "2025-11-20T18:06:41.000Z",
    "summary_long": "One week after the successful second launch of its large New Glenn booster, Blue Origin revealed a roadmap on Thursday for upgrades to the rocket, including a new variant with more main engines and a super-heavy lift capability. These upgrades to the rocket are “designed to increase payload performance and launch cadence, while enhancing reliability,” the company said in an update published on its website. The enhancements will be phased in over time, starting with the third launch of New Glenn, which is likely to occur during the first half of 2026. A BIGGER BEAST The most significant part of the update concerned an evolution of New Glenn that will transform the booster into a super-heavy lift launch vehicle. Source: arstechnica.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:kalshi raises 1b at 11b valuation as prediction market race :2025-11-20T21:10:08.000Z",
    "title": "Kalshi Raises $1B at $11B Valuation as Prediction Market Race Continues: TechCrunch",
    "url": "https://www.coindesk.com/markets/2025/11/20/kalshi-raises-usd1b-to-challenge-polymarket-in-usd11b-valuation-race-techcrunch",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Helene Braun",
    "published_at": "2025-11-20T21:10:08.000Z",
    "summary_long": "Kalshi Raises $1B at $11B Valuation as Prediction Market Race Continues: TechCrunch Source: www.coindesk.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:meta ordered to pay 479 million to spanish media outlets:2025-11-20T20:10:00.000Z",
    "title": "Meta ordered to pay €479 million to Spanish media outlets",
    "url": "https://www.engadget.com/big-tech/meta-ordered-to-pay-%E2%82%AC479-million-to-spanish-media-outlets-201000460.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "",
    "published_at": "2025-11-20T20:10:00.000Z",
    "summary_long": "Stop me if you've heard this one before: Meta has been fined for unlawfully processing user data to gain a market advantage. On Thursday, Reuters reported that a Madrid court ordered the company to pay €479 million ($552 million) in damages to 87 Spanish media outlets. The fine stems from the company changing its legal grounds for harvesting personal data after new regulations took effect. The court found that Meta's data collection practices violated the EU's General Data Protection Regulation (GDPR) — and, by extension, Spanish antitrust law. Source: www.engadget.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:supervised contrastive learning for fewshot aigenerated imag:2025-11-20T16:53:24.000Z",
    "title": "Supervised Contrastive Learning for Few-Shot AI-Generated Image Detection and Attribution",
    "url": "https://arxiv.org/abs/2511.16541v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Jaime Álvarez Urueña",
    "published_at": "2025-11-20T16:53:24.000Z",
    "summary_long": "The rapid advancement of generative artificial intelligence has enabled the creation of synthetic images that are increasingly indistinguishable from authentic content, posing significant challenges for digital media integrity. This problem is compounded by the accelerated release cycle of novel generative models, which renders traditional detection approaches (reliant on periodic retraining) computationally infeasible and operationally impractical. This work proposes a novel two-stage detection framework designed to address the generalization challenge inherent in synthetic image detection. The first stage employs a vision deep learning model trained via supervised contrastive learning to extract discriminative embeddings from input imagery. Source: arxiv.org. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:dynamic participation in federated learning benchmarks and a:2025-11-20T16:36:50.000Z",
    "title": "Dynamic Participation in Federated Learning: Benchmarks and a Knowledge Pool Plugin",
    "url": "https://arxiv.org/abs/2511.16523v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Ming-Lun Lee",
    "published_at": "2025-11-20T16:36:50.000Z",
    "summary_long": "Federated learning (FL) enables clients to collaboratively train a shared model in a distributed manner, setting it apart from traditional deep learning paradigms. However, most existing FL research assumes consistent client participation, overlooking the practical scenario of dynamic participation (DPFL), where clients may intermittently join or leave during training. Moreover, no existing benchmarking framework systematically supports the study of DPFL-specific challenges. In this work, we present the first open-source framework explicitly designed for benchmarking FL models under dynamic client participation. Source: arxiv.org. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:correlationaware feature attribution based explainable ai:2025-11-20T15:51:00.000Z",
    "title": "Correlation-Aware Feature Attribution Based Explainable AI",
    "url": "https://arxiv.org/abs/2511.16482v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Poushali Sengupta",
    "published_at": "2025-11-20T15:51:00.000Z",
    "summary_long": "Explainable AI (XAI) is increasingly essential as modern models become more complex and high-stakes applications demand transparency, trust, and regulatory compliance. Existing global attribution methods often incur high computational costs, lack stability under correlated inputs, and fail to scale efficiently to large or heterogeneous datasets. We address these gaps with \\emph{ExCIR} (Explainability through Correlation Impact Ratio), a correlation-aware attribution score equipped with a lightweight transfer protocol that reproduces full-model rankings using only a fraction of the data. ExCIR quantifies sign-aligned co-movement between features and model outputs after \\emph{robust centering} (subtracting a robust location estimate, e.g., median or mid-mean, from features and outputs). Source: arxiv.org. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:falcon 9 starlink mission marks 100th launch of the year fro:2025-11-20T22:43:03.000Z",
    "title": "Falcon 9 Starlink mission marks 100th launch of the year from Florida’s Space Coast",
    "url": "https://spaceflightnow.com/2025/11/20/live-coverage-falcon-9-starlink-mission-marks-100th-launch-of-the-year-from-floridas-space-coast/",
    "category_id": "space",
    "region": "Global",
    "source": "spaceflightnow.com",
    "author": "Steven Young",
    "published_at": "2025-11-20T22:43:03.000Z",
    "summary_long": "A Falcon 9 rocket lifted off from the Kennedy Space Center Thursday evening on a milestone mission marking the 100th launch from the Space Coast this year. The Starlink 6-78 mission, carrying 29 satellites for SpaceX’s internet service, soared spaceward at 10:39 p.m. EST (0339 UTC), the Faclon 9 rocket rising from a fog bank that had blanketed the area around launch complex 39A. Earlier this month, missions by the three major launch companies operating from the spaceport broke the record of 93 liftoffs that was set in 2024. Source: spaceflightnow.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:microsoft has open sourced the zork trilogy of text games:2025-11-20T21:35:19.000Z",
    "title": "Microsoft has open sourced the Zork trilogy of text games",
    "url": "https://www.engadget.com/gaming/microsoft-has-open-sourced-the-zork-trilogy-of-text-games-213519368.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2025-11-20T21:35:19.000Z",
    "summary_long": "Preservation has become a pressing topic for games in this era of digital-only releases and games-as-a-service. So it's wonderful to have a big win in archiving a trio of seminal text games for the ages. Microsoft announced today that the code for Zork, Zork II and Zork III will be made available open source under the MIT License. The company's Open Source Programs Office, Xbox and Activision all contributed to the effort. Source: www.engadget.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa sets coverage for crew launch to join station expeditio:2025-11-20T19:34:00.000Z",
    "title": "NASA Sets Coverage for Crew Launch to Join Station Expedition",
    "url": "https://www.nasa.gov/news-release/nasa-sets-coverage-for-crew-launch-to-join-station-expedition/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Lauren E. Low",
    "published_at": "2025-11-20T19:34:00.000Z",
    "summary_long": "A Soyuz rocket launches to the International Space Station with Expedition 73 crew members aboard, Tuesday, April 8, 2025, at the Baikonur Cosmodrome in Kazakhstan. NASA/Joel Kowsky NASA astronaut Chris Williams will launch aboard the Roscosmos Soyuz MS-28 spacecraft to the International Space Station on Thursday, Nov. 27, accompanied by cosmonauts Sergey Kud-Sverchkov and Sergei Mikaev, where they will join the Expedition 73 crew advancing scientific research. Williams, Kud-Sverchkov, and Mikaev will lift off at 4:27 a.m. Source: www.nasa.gov. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:qualcomm promises better gaming performance with latest wind:2025-11-20T18:35:29.000Z",
    "title": "Qualcomm promises better gaming performance with latest Windows on Snapdragon update",
    "url": "https://www.engadget.com/gaming/pc/qualcomm-promises-better-gaming-performance-with-latest-windows-on-snapdragon-update-183529616.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Will Shanklin",
    "published_at": "2025-11-20T18:35:29.000Z",
    "summary_long": "Remember way back in 2024, when Qualcomm said most x86 Windows games would run smoothly on its Arm chipsets? Well, those promises were, shall we say, a bit premature. But with this week's launch of the Snapdragon Control Panel (along with other updates), the company says things are finally looking up for Snapdragon X Elite laptop owners. Alongside the launch of faster new chips, Qualcomm has made some quality-of-life improvements on the software end. Source: www.engadget.com. Date: 2025-11-20. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]