[
  {
    "id": "bigtech:northrop grummans new spacecraft is a real chonker:2025-09-15T22:22:53.000Z",
    "title": "Northrop Grumman’s new spacecraft is a real chonker",
    "url": "https://arstechnica.com/space/2025/09/northrop-grummans-new-spacecraft-is-a-real-chonker/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Stephen Clark\n                ",
    "published_at": "2025-09-15T22:22:53.000Z",
    "summary_long": "What happens when you use a SpaceX Falcon 9 rocket to launch Northrop Grumman's Cygnus supply ship? A record-setting resupply mission to the International Space Station. The first flight of Northrop's upgraded Cygnus spacecraft, called Cygnus XL, is on its way to the international research lab after launching Sunday evening from Cape Canaveral Space Force Station, Florida. This mission, known as NG-23, is set to arrive at the ISS early Wednesday with 10,827 pounds (4,911 kilograms) of cargo to sustain the lab and its seven-person crew. Source: arstechnica.com. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:google releases vaultgemma its first privacypreserving llm:2025-09-15T21:04:04.000Z",
    "title": "Google releases VaultGemma, its first privacy-preserving LLM",
    "url": "https://arstechnica.com/ai/2025/09/google-releases-vaultgemma-its-first-privacy-preserving-llm/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ryan Whitwam\n                ",
    "published_at": "2025-09-15T21:04:04.000Z",
    "summary_long": "The companies seeking to build larger AI models have been increasingly stymied by a lack of high-quality training data. As tech firms scour the web for more data to feed their models, they could increasingly rely on potentially sensitive user data. A team at Google Research is exploring new techniques to make the resulting large language models (LLMs) less likely to \"memorize\" any of that content. LLMs have non-deterministic outputs, meaning you can't exactly predict what they'll say. Source: arstechnica.com. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "bigtech:internet archives big battle with music publishers ends in s:2025-09-15T20:52:01.000Z",
    "title": "Internet Archive’s big battle with music publishers ends in settlement",
    "url": "https://arstechnica.com/tech-policy/2025/09/internet-archives-big-battle-with-music-publishers-ends-in-settlement/",
    "category_id": "bigtech",
    "region": "Global",
    "source": "arstechnica.com",
    "author": "\n                    Ashley Belanger\n                ",
    "published_at": "2025-09-15T20:52:01.000Z",
    "summary_long": "A settlement has been reached in a lawsuit where music publishers sued the Internet Archive over the Great 78 Project, an effort to preserve early music recordings that only exist on brittle shellac records. No details of the settlement have so far been released, but a court filing on Monday confirmed that the Internet Archive and UMG Recordings, Capitol Records, Sony Music Entertainment, and other record labels \"have settled this matter.\" More details may come in the next 45 days, when parties must submit filings to officially dismiss the lawsuit, but it's unlikely the settlement amount will be publicly disclosed. Days before the settlement was announced, record labels had indicated that everyone but the Internet Archive and its founder, Brewster Kahle, had agreed to sign a joint settlement, seemingly including the Great 78 Project's recording engineer George Blood, who was also a target of the litigation. But in the days since, IA has gotten on board, posting a blog confirming…",
    "tags": []
  },
  {
    "id": "fintech:bitmines ether treasury crosses 215m stake in worldcoin vehi:2025-09-15T14:02:28.000Z",
    "title": "BitMine's Ether Treasury Crosses 2.15M, Stake in Worldcoin Vehicle Rises 10-Fold",
    "url": "https://www.coindesk.com/business/2025/09/15/bitmine-s-ether-treasury-crosses-2-15m-stake-in-worldcoin-vehicle-rises-10-fold",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-09-15T14:02:28.000Z",
    "summary_long": "BitMine Immersion Technologies (BMNR), the digital asset treasury company focused on Ethereum's ether (ETH) and helmed by Fundstrat's Tom Lee, said its crypto, cash and equity holdings hit $10.77 billion. As of Sunday, the Las Vegas-based firm held 2,151,676 ETH, adding 82,233 tokens to its stash last week, according to a Monday press release. It also held $569 million in unencumbered cash. The ether is worth $9.7 billion at current prices. Source: www.coindesk.com. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:panterabacked solana treasury firm helius raises 500m stock :2025-09-15T13:07:17.000Z",
    "title": "Pantera-Backed Solana Treasury Firm Helius Raises $500M, Stock Soars Over 200%",
    "url": "https://www.coindesk.com/markets/2025/09/15/pantera-backed-solana-treasury-firm-helius-raises-usd500m-stock-soars-over-200",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Krisztian Sandor",
    "published_at": "2025-09-15T13:07:17.000Z",
    "summary_long": "Helius Medical Technologies (HSDT) announced on Monday it's raising more than $500 million in a private financing round to create a Solana-focused treasury company. The vehicle will hold SOL, the native token of the Solana blockchain, as its reserve asset and aims to expand to more than $1.25 billion via stock warrants tied to the deal, the press release said. The financing was led by Pantera Capital and Summer Capital, with participation from investors including Animoca Brands, FalconX and HashKey Capital. Shares of the firm rallied over 200% above $24 in pre-market trading following the announcement. Source: www.coindesk.com. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:justeva a toolkit to evaluate llm fairness in legal knowledg:2025-09-15T16:31:26.000Z",
    "title": "JustEva: A Toolkit to Evaluate LLM Fairness in Legal Knowledge Inference",
    "url": "http://arxiv.org/abs/2509.12104v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Zongyue Xue",
    "published_at": "2025-09-15T16:31:26.000Z",
    "summary_long": "The integration of Large Language Models (LLMs) into legal practice raises pressing concerns about judicial fairness, particularly due to the nature of their \"black-box\" processes. This study introduces JustEva, a comprehensive, open-source evaluation toolkit designed to measure LLM fairness in legal tasks. JustEva features several advantages: (1) a structured label system covering 65 extra-legal factors; (2) three core fairness metrics - inconsistency, bias, and imbalanced inaccuracy; (3) robust statistical inference methods; and (4) informative visualizations. The toolkit supports two types of experiments, enabling a complete evaluation workflow: (1) generating structured outputs from LLMs using a provided dataset, and (2) conducting statistical analysis and inference on LLMs' outputs through regression and other statistical methods. Source: arxiv.org. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "space:nasa sets launch coverage for space weather missions:2025-09-15T21:29:53.000Z",
    "title": "NASA Sets Launch Coverage for Space Weather Missions",
    "url": "https://www.nasa.gov/news-release/nasa-sets-launch-coverage-for-space-weather-missions/",
    "category_id": "space",
    "region": "Global",
    "source": "www.nasa.gov",
    "author": "Jessica Taveau",
    "published_at": "2025-09-15T21:29:53.000Z",
    "summary_long": "From left to right, NASA’s Carruthers Geocorona Observatory, IMAP (Interstellar Mapping and Acceleration Probe), and the National Oceanic and Atmospheric Administration’s (NOAA) Space Weather Follow On-Lagrange 1 (SWFO-L1) missions will map our Sun’s influence across the solar system in new ways. Credit: NASA NASA will provide live coverage of prelaunch and launch activities for an observatory designed to study space weather and explore and map the boundaries of our solar neighborhood. Launching with IMAP (Interstellar Mapping and Acceleration Probe) are two rideshare missions, NASA’s Carruthers Geocorona Observatory and the National Oceanic and Atmospheric Administration’s (NOAA) Space Weather Follow On-Lagrange 1 (SWFO-L1), both of which will provide insight into space weather and its impacts at Earth and across the solar system. Liftoff of the missions on a SpaceX Falcon 9 rocket is targeted for 7:32 a.m. Source: www.nasa.gov. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "ai_data:mmore massive multimodal open rag extraction:2025-09-15T13:56:06.000Z",
    "title": "MMORE: Massive Multimodal Open RAG & Extraction",
    "url": "http://arxiv.org/abs/2509.11937v1",
    "category_id": "ai_data",
    "region": "Global",
    "source": "arxiv.org",
    "author": "Alexandre Sallinen",
    "published_at": "2025-09-15T13:56:06.000Z",
    "summary_long": "We introduce MMORE, an open-source pipeline for Massive Multimodal Open RetrievalAugmented Generation and Extraction, designed to ingest, transform, and retrieve knowledge from heterogeneous document formats at scale. MMORE supports more than fifteen file types, including text, tables, images, emails, audio, and video, and processes them into a unified format to enable downstream applications for LLMs. The architecture offers modular, distributed processing, enabling scalable parallelization across CPUs and GPUs. On processing benchmarks, MMORE demonstrates a 3.8-fold speedup over single-node baselines and 40% higher accuracy than Docling on scanned PDFs. Source: arxiv.org. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "fintech:wall street bank citigroup sees ether falling to 4300 by yea:2025-09-15T20:57:22.000Z",
    "title": "Wall Street Bank Citigroup Sees Ether Falling to $4,300 by Year-End",
    "url": "https://www.coindesk.com/markets/2025/09/15/wall-street-bank-citigroup-sees-ether-falling-to-usd4-300-by-year-end",
    "category_id": "fintech",
    "region": "Global",
    "source": "www.coindesk.com",
    "author": "Will Canny",
    "published_at": "2025-09-15T20:57:22.000Z",
    "summary_long": "Wall Street giant Citigroup (C) has launched new ether (ETH) forecasts, calling for $4,300 by year-end, which would be a decline from the current $4,515. That's the base case though. The bank's full assessment is wide enough to drive an army regiment through, with the bull case being $6,400 and the bear case $2,200. The bank analysts said network activity remains the key driver of ether’s value, but much of the recent growth has been on layer-2s, where value “pass-through” to Ethereum’s base layer is unclear. Source: www.coindesk.com. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:new york details its plans for online age verification rules:2025-09-15T19:52:23.000Z",
    "title": "New York details its plans for online age verification rules",
    "url": "https://www.engadget.com/social-media/new-york-details-its-plans-for-online-age-verification-rules-195223379.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Anna Washenko",
    "published_at": "2025-09-15T19:52:23.000Z",
    "summary_long": "Last year, New York joined the wave of states passing legislation aimed at protecting minors using the Internet, particularly social media. Governor Kathy Hochul signed the Stop Addictive Feeds Exploitation (SAFE) for Kids Act and the New York Child Data Protection Act in June 2024. Today, the state's Attorney General Letitia James released more specifics about what the SAFE for Kids Act will entail in practice. Public comment is open until December 1 and the rules must be finalized within a year from that date. Source: www.engadget.com. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  },
  {
    "id": "consumer:early access is the latest place where steam is restricting :2025-09-15T19:08:06.000Z",
    "title": "Early Access is the latest place where Steam is restricting games with mature themes",
    "url": "https://www.engadget.com/gaming/early-access-is-the-latest-place-where-steam-is-restricting-games-with-mature-themes-190806818.html?src=rss",
    "category_id": "consumer",
    "region": "Global",
    "source": "www.engadget.com",
    "author": "Andre Revilla",
    "published_at": "2025-09-15T19:08:06.000Z",
    "summary_long": "Valve has apparently updated its Steam Early Access policy to no longer accept games with what the company deems to be \"mature themes.\" As first reported by Gamesmarkt earlier this month, gaming studio Dammitbird, which develops the adult adventure game Heavy Hearts, was not allowed to put the title on Steam Early Access because of its content. Payment processors like Mastercard and Visa have been mounting a pressure campaign on video game marketplaces Steam and Itch.io to remove certain adults-only content since early summer. After taking down a game called No Mercy in April at the behest of payment processors and an Australian anti-porn organization, there has been a steady expansion in the application of these new policies. Steam, for its part, made some incredibly vague policy changes to appease the payment giants, adding a sweeping clause that promises to ban certain kinds of adults-only content before proceeding to remove hundreds of games. Source: www.engadget.com. Date: 2025-09-15.",
    "tags": []
  },
  {
    "id": "ai_data:introducing upgrades to codex:2025-09-15T10:00:00.000Z",
    "title": "Introducing upgrades to Codex",
    "url": "https://openai.com/index/introducing-upgrades-to-codex",
    "category_id": "ai_data",
    "region": "Global",
    "source": "openai.com",
    "author": "",
    "published_at": "2025-09-15T10:00:00.000Z",
    "summary_long": "Introducing upgrades to Codex Source: openai.com. Date: 2025-09-15. Why it matters: outline likely impact on technology, business, or society. What’s next: note near-term developments or signals to watch.",
    "tags": []
  }
]